Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/ext/commands/cogs.po
Languages: ru

source: Cogs
ru: Коги

source: There comes a point in your bot's development when you want to organize a collection of commands, listeners, and some state into one class. Cogs allow you to do just that.
ru: В процессе разработки бота наступает момент, когда вы хотите организовать набор команд, слушателей и некоторых состояний в один класс. Коги позволяют вам сделать именно это.

source: The gist:
ru: Основная суть:

source: Each cog is a Python class that subclasses :class:`.commands.Cog`.
ru: Каждый ког - это класс Python, который является подклассом :class:`.commands.Cog`.

source: Every command is marked with the :func:`.commands.command` decorator.
ru: Каждая команда помечается декоратором :func:`.commands.command`.

source: Every listener is marked with the :meth:`.commands.Cog.listener` decorator.
ru: Каждый слушатель помечается декоратором :meth:`.commands.Cog.listener`.

source: Cogs are then registered with the :meth:`.Bot.add_cog` call.
ru: Затем коги регистрируются с помощью вызова :meth:`.Bot.add_cog`.

source: Cogs are subsequently removed with the :meth:`.Bot.remove_cog` call.
ru: Впоследствии коги удаляются с помощью вызова :meth:`.Bot.remove_cog`.

source: It should be noted that cogs are typically used alongside with :ref:`ext_commands_extensions`.
ru: Следует отметить, что коги обычно используются вместе с :ref:`ext_commands_extensions`.

source: Quick Example
ru: Быстрый пример

source: This example cog defines a ``Greetings`` category for your commands, with a single :ref:`command <ext_commands_commands>` named ``hello`` as well as a listener to listen to an :ref:`Event <discord-api-events>`.
ru: Этот пример кога определяет категорию ``Greetings`` для ваших команд, с одной :ref:``командой <ext_commands_commands>`` под названием ``hello``, а также слушателем для прослушивания :ref:``События <discord-api-events>`.

source: A couple of technical notes to take into consideration:
ru: Несколько технических замечаний, которые следует принять во внимание:

source: All listeners must be explicitly marked via decorator, :meth:`~.commands.Cog.listener`.
ru: Все слушатели должны быть явно помечены с помощью декоратора, :meth:`~.commands.Cog.listener`.

source: The name of the cog is automatically derived from the class name but can be overridden. See :ref:`ext_commands_cogs_meta_options`.
ru: Имя кога автоматически происходит от имени класса, но может быть переопределено. См. :ref:`ext_commands_cogs_meta_options`.

source: All commands must now take a ``self`` parameter to allow usage of instance attributes that can be used to maintain state.
ru: Все команды теперь должны принимать параметр ``self``, чтобы позволить использовать атрибуты экземпляра, которые могут быть использованы для поддержания состояния.

source: Cog Registration
ru: Регистрация Когов

source: Once you have defined your cogs, you need to tell the bot to register the cogs to be used. We do this via the :meth:`~.commands.Bot.add_cog` method.
ru: После того как вы определили коги, вам нужно сообщить боту, чтобы он зарегистрировал коги для использования. Мы делаем это с помощью метода :meth:`~.commands.Bot.add_cog`.

source: This binds the cog to the bot, adding all commands and listeners to the bot automatically.
ru: Это связывает ког с ботом, автоматически добавляя к нему все команды и слушателей.

source: Note that we reference the cog by name, which we can override through :ref:`ext_commands_cogs_meta_options`. So if we ever want to remove the cog eventually, we would have to do the following.
ru: Обратите внимание, что мы ссылаемся на ког по имени, которое мы можем переопределить через :ref:`ext_commands_cogs_meta_options`. Поэтому, если мы захотим в конечном итоге удалить ког, нам нужно будет сделать следующее.

source: Using Cogs
ru: Использование Когов

source: Just as we remove a cog by its name, we can also retrieve it by its name as well. This allows us to use a cog as an inter-command communication protocol to share data. For example:
ru: Точно так же, как мы удаляем ког по его имени, мы можем и получить его по имени. Это позволяет нам использовать ког в качестве протокола межкомандной связи для обмена данными. Например:

source: Special Methods
ru: Специальные Методы

source: As cogs get more complicated and have more commands, there comes a point where we want to customise the behaviour of the entire cog or bot.
ru: По мере того как коги становятся все сложнее и имеют больше команд, наступает момент, когда мы хотим кастомизировать поведение всего кога или бота.

source: They are as follows:
ru: К их числу относятся:

source: You can visit the reference to get more detail.
ru: Вы можете посмотреть справочник, чтобы получить более подробную информацию.

source: Meta Options
ru: Мета-опции

source: At the heart of a cog resides a metaclass, :class:`.commands.CogMeta`, which can take various options to customise some of the behaviour. To do this, we pass keyword arguments to the class definition line. For example, to change the cog name we can pass the ``name`` keyword argument as follows:
ru: В основе кога лежит метакласс, :class:`.commands.CogMeta`, который может принимать различные опции для кастомизации поведения. Для этого в строке определения класса мы передаем аргументы с ключевыми словами. Например, чтобы изменить имя кога, мы можем передать именованный аргумент ``name`` следующим образом:

source: To see more options that you can set, see the documentation of :class:`.commands.CogMeta`.
ru: Чтобы узнать больше опций, которые вы можете задать, смотрите документацию по :class:`.commands.CogMeta`.

source: Inspection
ru: Инспекция

source: Since cogs ultimately are classes, we have some tools to help us inspect certain properties of the cog.
ru: Поскольку коги в конечном счете являются классами, у нас есть некоторые инструменты, которые помогут нам проверить определенные свойства кога.

source: To get a :class:`list` of commands, we can use :meth:`.Cog.get_commands`. ::
ru: Чтобы получить :class:`list` из команд, мы можем использовать :meth:`.Cog.get_commands`. ::

source: If we want to get the subcommands as well, we can use the :meth:`.Cog.walk_commands` generator. ::
ru: Если мы хотим получить также и подкоманды, мы можем использовать генератор :meth:`.Cog.walk_commands`. ::

source: To do the same with listeners, we can query them with :meth:`.Cog.get_listeners`. This returns a list of tuples -- the first element being the listener name and the second one being the actual function itself. ::
ru: Чтобы сделать то же самое со слушателями, мы можем запросить их с помощью :meth:`.Cog.get_listeners`. Это возвращает список кортежей - первый элемент - имя слушателя, второй - сама функция. ::
