Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/api/abcs.po
Languages: es, ru

source: Abstract Base Classes
ru: Абстрактные базовые классы

source: An :term:`abstract base class` (also known as an ``abc``) is a class that models can inherit to get their behaviour. **Abstract base classes should not be instantiated**. They are mainly there for usage with :func:`isinstance` and :func:`issubclass`\.
es: Una :term:`clase base abstracta` (también conocidas como ``cba``) es un tipo de clase la cual otros objetos utilizan heredar sus funcionalidades. **Las clases base abstractas no deben ser inicializadas**. Su principal causa de uso es para utilizar comprobaciones :func:`isinstance` e :func:`issubclass`\.
ru: :term:`abstract base class` (также известный как ``abc``) — это класс, от которого модели могут наследовать свое поведение. **Абстрактные базовые классы не должны быть скопированы**. Они в основном предназначены для использования в :func:`isinstance` и :func:`issubclass`\.

source: This library has a module related to abstract base classes, in which all the ABCs are subclasses of :class:`typing.Protocol`.
es: La librería tiene un módulo centrado en las clases bases abstractas, en la que todas son heredadas de :class:`typing.Protocol`.
ru: В этой библиотеке есть модуль, связанный с абстрактными базовыми классами, в котором все ABC являются подклассами :class:`typing.Protocol`.

source: An ABC that details the common operations on a Discord model.
es: Una CBA que detalla las operaciones más comunes en un modelo de Discord.
ru: ABC, в котором описаны общие операции по модели Discord.

source: Almost all :ref:`Discord models <discord_api_models>` meet this abstract base class.
es: Casi todos los :ref:`modelos de Discord <discord_api_models>` cumplen el protocolo de esta clase base abstracta.
ru: Почти все :ref:`модели Discord <discord_api_models>` соответствуют этому абстрактному базовому классу.

source: If you want to create a snowflake on your own, consider using :class:`.Object`.
es: Si quieres crear un snowflake por tu cuenta, es preferible que uses :class:`.Object`.
ru: Если вы хотите создать snowflake самостоятельно, рассмотрите возможность использования :class:`.Object`.

source: The model's unique ID.
es: El ID único del modelo.
ru: Уникальный идентификатор модели.

source: type
es: tipo
ru: тип

source: An ABC that details the common operations on a Discord user.
es: Una CBA que detalla las operaciones más comunes en un usuario de Discord.
ru: ABC, в котором описаны общие операции с пользователем Discord.

source: The following implement this ABC:
es: Los siguientes son heredados de esta CBA:
ru: Следующие реализуют этот ABC:

source: This ABC must also implement :class:`~discord.abc.Snowflake`.
es: Esta CBA también debe implementar :class:`~discord.abc.Snowflake`.
ru: Этот ABC также реализует :class:`~discord.abc.Snowflake`.

source: The user's username.
es: El nombre del usuario.
ru: Имя пользователя.

source: The user's discriminator.
es: El discriminador del usuario.
ru: Дискриминатор пользователя.

source: If the user has migrated to the new username system, this will always be "0".
es: Si el usuario ha migrado al nuevo sistema de nombres de usuario, esto siempre será "0".
ru: Если пользователь мигрировал в новую систему имени пользователя, это всегда будет "0".

source: The user's global name.
es: El nombre global del usuario.
ru: Глобальное имя пользователя.

source: The avatar asset the user has.
es: El avatar que tiene el usuario.
ru: Аватар пользователя.

source: If the user is a bot account.
es: Si el usuario es un bot.
ru: Если пользователь является учетной записью бота.

source: Returns the user's display name.
es: Retorna el nombre mostrado del usuario.
ru: Возвращает отображаемое имя пользователя.

source: Returns a string that allows you to mention the given user.
es: Retorna una cadena que permite mencionar al usuario.
ru: Возвращает строку, которая позволяет упомянуть этого пользователя.

source: An ABC that details the common operations on a private Discord channel.
es: Una CBA que detalla las operaciones más comunes en un canal privado de Discord.
ru: ABC, в котором описаны общие операции с приватным каналом Discord.

source: The user presenting yourself.
es: El usuario que te representa.
ru: Пользователь, представляющий себя.

source: An ABC that details the common operations on a Discord guild channel.
es: Una CBA que detalla las operaciones más comunes en un canal de un servidor de Discord.
ru: ABC, в котором описаны общие операции с каналом сервера Discord.

source: The channel name.
es: El nombre del canal.
ru: Название канала.

source: The guild the channel belongs to.
es: El servidor al cual este canal pertenece.
ru: Сервер к которому принадлежит канал.

source: The position in the channel list. This is a number that starts at 0. e.g. the top channel is position 0.
es: La posición del canal en la lista de canales. Este es un entero comenzando desde 0. p. ej., el primer canal tiene la posición 0.
ru: Позиция в списке каналов. Это число, которое начинается с 0. Например, верхний канал имеет позицию 0.

source: Returns a list of roles that have been overridden from their default values in the :attr:`~discord.Guild.roles` attribute.
es: Retorna una lista de roles que han sido sobreescritos de su valor predeterminado en el atributo :attr:`~discord.Guild.roles`.
ru: Возвращает список ролей, которые были переопределены по сравнению с их значениями по умолчанию в атрибуте :attr:`~discord.Guild.roles`.

source: The string that allows you to mention the channel.
es: Retorna una cadena que permite mencionar el canal.
ru: Строка, которая позволяет упомянуть канал.

source: Returns a URL that allows the client to jump to the channel.
es: Retorna un enlace que permite al cliente ir directamente al canal.
ru: Возвращает URL, который позволяет клиенту перейти к каналу.

source: Returns the channel's creation time in UTC.
es: Retorna la fecha de creación del canal en UTC.
ru: Возвращает время создания канала в UTC.

source: Returns the channel-specific overwrites for a member or a role.
es: Retorna las sobrescrituras de un miembro o rol específicas de este canal.
ru: Возвращает переопределения прав канала для участника или роли.

source: Parameters
es: Parámetros
ru: Параметры

source: The role or user denoting whose overwrite to get.
es: El rol o usuario de los que quieres obtener las sobrescrituras.
ru: Роль или пользователь, обозначающий, чьи переопределения необходимо получить.

source: Returns
es: Retorna
ru: Возвращает

source: The permission overwrites for this object.
es: Las sobre escrituras de los permisos para este objeto.
ru: Переопределенные разрешения для этого объекта.

source: Return type
es: Tipo del valor retornado
ru: Тип возврата

source: Returns all of the channel's overwrites.
es: Retorna todas las sobrescrituras de este canal.
ru: Возвращает все переопределения прав канала.

source: This is returned as a dictionary where the key contains the target which can be either a :class:`~discord.Role` or a :class:`~discord.Member` and the value is the overwrite as a :class:`~discord.PermissionOverwrite`.
es: Esto es retornado como un diccionario donde la llave es el objeto, que puede ser de tipo :class:`~discord.Role` o :class:`~discord.Member`, y el valor es la sobrescritura, que es de tipo :class:`~discord.PermissionOverwrite`.
ru: Это возвращается как словарь, где ключ содержит цель, которая может быть :class:`~discord.Role` или :class:`~discord.Member`, а значением является :class:`~discord.PermissionOverwrite`.

source: The channel's permission overwrites.
es: Las sobrescrituras de los permisos de este canal.
ru: Переопределения прав канала.

source: The category this channel belongs to.
es: La categoría a la cual pertenece este canal.
ru: Категория, к которой принадлежит канал.

source: If there is no category then this is ``None``.
es: Si no pertenece a ninguna, entonces esto retorna ``None``.
ru: Если нет категории, то это ``None``.

source: Whether the permissions for this channel are synced with the category it belongs to.
es: Si los permisos de este canal están sincronizados con los de la categoría a la que pertenece.
ru: Будут ли права доступа этого канала синхронизированы с категорией, к которой он принадлежит.

source: If there is no category then this is ``False``.
es: Si no pertenece a ninguna categoría, entonces esto es ``False``.
ru: Если нет категории, то это ``False``.

source: Handles permission resolution for the :class:`~discord.Member` or :class:`~discord.Role`.
es: Gestiona la resolución de los permisos para el :class:`~discord.Member` o :class:`~discord.Role`.
ru: Обрабатывает разрешения для :class:`~discord.Member` или :class:`~discord.Role`.

source: This function takes into consideration the following cases:
es: Esta función tiene en cuenta los siguientes casos:
ru: Эта функция учитывает следующие случаи:

source: Guild owner
es: Propietario del servidor
ru: Владелец сервера

source: Guild roles
es: Roles del servidor
ru: Роли сервера

source: Channel overrides
es: Sobrescrituras de canales
ru: Переопределения канала

source: Member overrides
es: Sobrescrituras de miembros
ru: Переопределения участника

source: If a :class:`~discord.Role` is passed, then it checks the permissions someone with that role would have, which is essentially:
es: Si se proporciona un :class:`~discord.Role`, entonces esto comprueba los permisos de alguien que tenga el rol, que es esencialmente:
ru: Если передана :class:`~discord.Role`, то проверяются разрешения, которыми будет обладать человек с этой ролью, что, по сути, является проверкой:

source: The default role permissions
es: Los permisos del rol por defecto
ru: Права доступа роли по умолчанию

source: The permissions of the role used as a parameter
es: Los permisos del rol usado como parámetro
ru: Права доступа роли, используемой в качестве параметра

source: The default role permission overwrites
es: Las sobrescrituras de permisos del rol por defecto
ru: Переопределения прав доступа роли по умолчанию

source: The permission overwrites of the role used as a parameter
es: Las sobrescrituras de permisos del rol usado como parámetro
ru: Переопределения прав доступа роли, используемой в качестве параметра

source: The object passed in can now be a role object.
es: El objeto proporcionado ahora puede ser un rol.
ru: Теперь передаваемый объект может быть объектом роли.

source: The object to resolve permissions for. This could be either a member or a role. If it's a role then member overwrites are not computed.
es: El objeto del que obtener los permisos. Este puede ser un miembro o rol. Si es un rol, entonces las sobrescrituras de miembro no son calculadas.
ru: Объект, для которого необходимо вычислить разрешения. Это может быть либо участник, либо роль. Если это роль, то переопределение прав для участников не вычисляется.

source: The resolved permissions for the member or role.
es: Los permisos calculados del miembro o rol.
ru: Вычисленные разрешения для участника или роли.

source: Deletes the channel.
es: Elimina este canal.
ru: Удаляет канал.

source: You must have :attr:`~discord.Permissions.manage_channels` permission to use this.
es: Debes tener el permiso :attr:`~discord.Permissions.manage_channels` para poder usar esto.
ru: У вас должно быть разрешение :attr:`~discord.Permissions.manage_channels`, чтобы использовать это.

source: The reason for deleting this channel. Shows up on the audit log.
es: La razón por la que se elimina el canal. Se muestra en el registro de auditoría.
ru: Причина удаления этого канала. Отображается в журнале аудита.

source: Raises
es: Errores
ru: Вызывает

source: You do not have proper permissions to delete the channel.
es: No tienes los permisos necesarios para poder eliminar el canal.
ru: У вас нет соответствующих прав для удаления канала.

source: The channel was not found or was already deleted.
es: El canal no se encontró o ya fue eliminado.
ru: Канал не найден или уже был удален.

source: Deleting the channel failed.
es: Algo falló mientras se eliminaba el canal.
ru: Не удалось удалить канал.

source: Sets the channel specific permission overwrites for a target in the channel.
es: Establece las sobrescrituras de permisos para un objetivo en el canal.
ru: Устанавливает переопределение прав доступа для цели в канале.

source: The ``target`` parameter should either be a :class:`~discord.Member` or a :class:`~discord.Role` that belongs to guild.
es: El parámetro ``target`` debe ser del tipo :class:`~discord.Member` o :class:`~discord.Role` que pertenezca al servidor.
ru: Параметр ``target`` должен быть либо :class:`~discord.Member`, либо :class:`~discord.Role`, принадлежащие этому серверу.

source: The ``overwrite`` parameter, if given, must either be ``None`` or :class:`~discord.PermissionOverwrite`. For convenience, you can pass in keyword arguments denoting :class:`~discord.Permissions` attributes. If this is done, then you cannot mix the keyword arguments with the ``overwrite`` parameter.
es: El parámetro ``overwrite``, si es proporcionado, debe ser ``None`` o de tipo :class:`~discord.PermissionOverwrite`. Por conveniencia, puedes proporcionar argumentos de palabras clave que denoten atributos :class:`~discord.Permissions`. Si eso se hace, no se podrán combinar los argumentos de palabras clave con el parámetro ``overwrite``.
ru: Параметр ``overwrite``, если указано, должен быть ``None`` или :class:`~discord.PermissionOverwrite`. Для удобства вы можете передать ключевые аргументы, означающие :class:`~discord.Permissions`. Если это сделано, вы не можете смешивать ключевые аргументы с параметром ``overwrite``.

source: If the ``overwrite`` parameter is ``None``, then the permission overwrites are deleted.
es: Si el parámetro ``overwrite`` es ``None``, entonces se eliminarán las sobrescrituras ya existentes.
ru: Если параметр ``overwrite`` это ``None``, то переопределения прав удаляются.

source: You must have the :attr:`~discord.Permissions.manage_roles` permission to use this.
es: Debes tener el permiso :attr:`~discord.Permissions.manage_roles` para poder usar esto.
ru: У вас должно быть разрешение :attr:`~discord.Permissions.manage_roles`, чтобы использовать это.

source: This method *replaces* the old overwrites with the ones given.
es: Este método *reemplaza* las sobrescrituras antiguas con las proporcionadas.
ru: Этот метод *заменяет* старые переопределения с указанными.

source: Examples
es: Ejemplos
ru: Примеры

source: Setting allow and deny: ::
es: Estableciendo permitidos y denegados: ::
ru: Настройка разрешений и запретов: ::

source: Deleting overwrites ::
es: Eliminar sobrescrituras: ::
ru: Удаление переопределений: ::

source: Using :class:`~discord.PermissionOverwrite` ::
es: Usando :class:`~discord.PermissionOverwrite`: ::
ru: Использование :class:`~discord.PermissionOverwrite` ::

source: The member or role to overwrite permissions for.
es: El miembro o rol al que editar las sobrescrituras de permisos.
ru: Участник или роль для переопределения прав доступа.

source: The permissions to allow and deny to the target, or ``None`` to delete the overwrite.
es: Los permisos que aceptar o denegar al objetivo, o ``None`` para eliminar la sobrescritura.
ru: Разрешения, которые следует разрешить и запретить для цели, или ``None`` для удаления переопределения.

source: A keyword argument list of permissions to set for ease of use. Cannot be mixed with ``overwrite``.
es: Una lista de argumentos de palabras clave de los permisos a establecer para facilitar el uso. No se puede combinar con ``overwrite``.
ru: Список ключевых аргументов, которые можно установить для удобства использования. Не может быть использован вместе с ``overwrite``.

source: The reason for doing this action. Shows up on the audit log.
es: La razón por la que se hace esta acción. Se muestra en el registro de auditoría.
ru: Причина совершения данного действия. Отображается в журнале аудита.

source: You do not have permissions to edit channel specific permissions.
es: No tienes permisos para editar los permisos de este canal.
ru: У вас нет прав для редактирования разрешений канала.

source: Editing channel specific permissions failed.
es: Algo falló mientras se editaban los permisos del canal.
ru: Изменение переопределений прав доступа не удалось.

source: The role or member being edited is not part of the guild.
es: El rol o miembro que se va a editar no es parte del servidor.
ru: Редактируемая роль или участник не принадлежит серверу этого канала.

source: The overwrite parameter invalid or the target type was not :class:`~discord.Role` or :class:`~discord.Member`.
es: El parámetro ``overwrite`` no es válido o el tipo de objetivo no era un :class:`~discord.Role` o :class:`~discord.Member`.
ru: Параметр overwrite невалидный или целевой тип не является :class:`~discord.Role` или :class:`~discord.Member`.

source: Clones this channel. This creates a channel with the same properties as this channel.
es: Clona este canal. Esto crea uno nuevo con las mismas propiedades.
ru: Клонирует данный канал. Создает канал с такими же свойствами, что и этот канал.

source: You must have the :attr:`~discord.Permissions.manage_channels` permission to do this.
es: Debes tener el permiso :attr:`~discord.Permissions.manage_channels` para poder usar esto.
ru: Для этого у вас должно быть разрешение :attr:`~discord.Permissions.manage_channels`.

source: The name of the new channel. If not provided, defaults to this channel name.
es: El nuevo nombre del canal. Si no se proporciona, se usará el nombre del canal existente.
ru: Имя нового канала. Если не указано, по умолчанию используется имя этого канала.

source: The reason for cloning this channel. Shows up on the audit log.
es: La razón por la que se clona el canal. Se muestra en el registro de auditoría.
ru: Причина клонирования этого канала. Отображается в журнале аудита.

source: The channel that was created.
es: El canal que fue creado.
ru: Канал, который был создан.

source: You do not have the proper permissions to create this channel.
es: No tienes los permisos necesarios para crear este canal.
ru: У вас нет соответствующих прав для создания этого канала.

source: Creating the channel failed.
es: Algo falló mientras se creaba el canal.
ru: Не удалось создать канал.

source: A rich interface to help move a channel relative to other channels.
es: Una interfaz completa la cual ayuda a mover un canal en relación con los otros.
ru: Богатый интерфейс, позволяющий перемещать канал относительно других каналов.

source: If exact position movement is required, ``edit`` should be used instead.
es: Si la posición exacta a la que quiere moverse es requerida, deberías usar ``edit`` en su lugar.
ru: Если требуется точное перемещение позиции, вместо этого следует использовать ``edit``.

source: Voice channels will always be sorted below text channels. This is a Discord limitation.
es: Los canales de voz siempre se ordenarán después de los canales de texto. Esto es una limitación de Discord.
ru: Голосовые каналы всегда будут отсортированы ниже текстовых.

source: Whether to move the channel to the beginning of the channel list (or category if given). This is mutually exclusive with ``end``, ``before``, and ``after``.
es: Si debería moverse el canal al principio de la lista de canales (o categoría, si es proporcionada). Esto es mutuamente excluyente con ``end``, ``before`` y ``after``.
ru: Перемещать ли канал в начало списка каналов (или в категорию, если она задана). Этот параметр является взаимоисключающим для ``end``, ``before`` и ``after``.

source: Whether to move the channel to the end of the channel list (or category if given). This is mutually exclusive with ``beginning``, ``before``, and ``after``.
es: Si mover el canal al final de la lista de canales (o de la categoría, si es proporcionada). Esto es mutuamente excluyente con ``beginning``, ``before`` y ``after``.
ru: Перемещать ли канал в конец списка каналов (или категории, если она задана). Этот параметр является взаимоисключающим для ```beginning``, ``before`` и ``after``.

source: The channel that should be before our current channel. This is mutually exclusive with ``beginning``, ``end``, and ``after``.
es: El canal que debería estar antes del canal actual. Esto es mutuamente excluyente con ``beginning``, ``end`` y ``after``.
ru: Канал, который должен быть перед нашим текущим каналом. Это взаимоисключающее значение с ``beginning``, ``end`` и ``after``.

source: The channel that should be after our current channel. This is mutually exclusive with ``beginning``, ``end``, and ``before``.
es: El canal que debería estar después del canal actual. Esto es mutuamente excluyente con ``beginning``, ``end`` y ``before``.
ru: Канал, который должен быть после нашего текущего канала. Это взаимоисключающее значение с ``beginning``, ``end`` и ``before``.

source: The number of channels to offset the move by. For example, an offset of ``2`` with ``beginning=True`` would move it 2 after the beginning. A positive number moves it below while a negative number moves it above. Note that this number is relative and computed after the ``beginning``, ``end``, ``before``, and ``after`` parameters.
es: La cantidad de canales que mover para compensar. Por ejemplo, un desplazamiento de valor ``2`` con ``beginning=True`` moverá el canal 2 posiciones a partir del principio. Un número positivo mueve el canal hacia abajo, mientras uno negativo lo mueve hacia arriba. Tenga en cuenta que este número es relativo y calculado a partir de los parámetros ``beginning``, ``end``, ``before`` y ``after``.
ru: Количество каналов, на которое нужно сместить канал. Например, смещение ``2`` с ``beginning=True`` переместит его на 2 после начала списка каналов. Положительное число перемещает его ниже, а отрицательное - выше. Обратите внимание, что это число является относительным и вычисляется после параметров ``beginning``, ``end``, ``before`` и ``after``.

source: The category to move this channel under. If ``None`` is given then it moves it out of the category. This parameter is ignored if moving a category channel.
es: La categoría a la que mover este canal. Si se proporciona ``None`` entonces mueve el canal fuera de esta. Este parámetro es ignorado si se mueve una categoría.
ru: Категория, в которую нужно переместить этот канал. Если задано ``None``, то он будет перемещен из категории. Этот параметр игнорируется при перемещении категории.

source: Whether to sync the permissions with the category (if given).
es: Si se deben sincronizar los permisos con la categoría a la que se mueve (si es proporcionada).
ru: Нужно ли синхронизировать разрешения с категорией (если указана).

source: The reason for the move.
es: La razón por la que se mueve este canal.
ru: Причина перемещения.

source: An invalid position was given or a bad mix of arguments was passed.
es: Se proporcionó una posición no válida, o se mezclaron parámetros mutuamente excluyentes.
ru: Была указана невалидная позиция или передано неверное сочетание аргументов.

source: You do not have permissions to move the channel.
es: No tienes los permisos necesarios para poder mover el canal.
ru: У вас нет прав для перемещения канала.

source: Moving the channel failed.
es: Algo falló mientras se movía el canal.
ru: Не удалось переместить канал.

source: Creates an instant invite from a text or voice channel.
es: Crea una invitación instantánea a partir de un canal de texto o voz.
ru: Создает мгновенное приглашение из текстового или голосового канала.

source: You must have the :attr:`~discord.Permissions.create_instant_invite` permission to do this.
es: Debes tener el permiso :attr:`~discord.Permissions.create_instant_invite` para poder usar esto.
ru: Для этого у вас должно быть разрешение :attr:`~discord.Permissions.create_instant_invite`.
