Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/api/abcs.po
Languages: es, ru

source: A list of embeds to upload. Must be a maximum of 10.
es: Una lista de embeds que adjuntar. El máximo de elementos es 10.
ru: Список вложений для загрузки. Должно быть не более 10.

source: A list of stickers to upload. Must be a maximum of 3. .. versionadded:: 2.0
es: Una lista de stickers que adjuntar. El máximo de elementos es 3. .. versionadded:: 2.0
ru: Список стикеров для загрузки. Должно быть не более 3. .. versionadded:: 2.0

source: A list of stickers to upload. Must be a maximum of 3.
es: Una lista de stickers que adjuntar. El máximo de elementos es 3.
ru: Список стикеров для загрузки. Должно быть не более 3.

source: Whether to suppress embeds for the message.
es: Si suprimir los embeds del mensaje.
ru: Нужно ли удалять вложения в сообщении.

source: Whether to suppress push and desktop notifications for the message. .. versionadded:: 2.4
es: Si suprimir las notificaciones push y las notificaciones de escritorio de este mensaje. .. versionadded:: 2.4
ru: Подавлять ли push- и настольные уведомления о сообщении. .. versionadded:: 2.4

source: Whether to suppress push and desktop notifications for the message.
es: Si suprimir las notificaciones push y las notificaciones de escritorio de este mensaje.
ru: Подавлять ли push- и настольные уведомления о сообщении.

source: The poll to send. .. versionadded:: 2.6
es: La encuesta a enviar. .. versionadded:: 2.6
ru: Опрос для отправки. .. versionadded:: 2.6

source: The poll to send.
es: La encuesta a enviar.
ru: Опрос для отправки.

source: The message that was sent.
es: El mensaje que fue enviado.
ru: Сообщение, которое было отправлено.

source: Sending the message failed.
es: Algo falló mientras se enviaba el mensaje.
ru: Не удалось отправить сообщение.

source: You do not have the proper permissions to send the message.
es: No tienes los permisos necesarios para enviar este mensaje.
ru: У вас нет соответствующих прав для отправки этого сообщения.

source: The ``files`` list is not of the appropriate size, you specified both ``file`` and ``files``, or you specified both ``embed`` and ``embeds``, or the ``reference`` object is not a :class:`~discord.Message`, :class:`~discord.MessageReference` or :class:`~discord.PartialMessage`.
es: La lista ``files`` no cumple con los límites de tamaño, especificaste ambos parámetros ``file`` y ``files``, especificaste ambos parámetros ``embed`` y ``embeds``, o el valor del parámetro ``reference`` no es un objeto de tipo :class:`~discord.Message`, :class:`~discord.MesageReference` o :class:`~discord.PartialMessage`.
ru: Список ``files`` не имеет подходящего размера, вы указали одновременно ``file`` и ``files``, или указали одновременно ``embed`` и ``embeds``, или объект ``reference`` не является объектом :class:`~discord.Message`, :class:`~discord.MessageReference` или :class:`~discord.PartialMessage`.

source: Triggers a *typing* indicator to the destination.
es: Activa el indicador de *escribiendo* en el canal.
ru: Запускает индикатор *печатает* к месту назначения.

source: *Typing* indicator will go away after 10 seconds, or after a message is sent.
es: El indicador *escribiendo* desaparecerá luego de 10 segundos, o cuando se envía un mensaje.
ru: Индикатор *печатает* погаснет через 10 секунд или после отправки сообщения.

source: Retrieves a single :class:`~discord.Message` from the destination.
es: Obtiene un solo :class:`~discord.Message` del canal.
ru: Получает одно :class:`~discord.Message` из места назначения.

source: The message ID to look for.
es: El ID del mensaje a buscar.
ru: Идентификатор сообщения для поиска.

source: The message asked for.
es: El mensaje solicitado.
ru: Запрашиваемое сообщение.

source: The specified message was not found.
es: El mensaje especificado no fue encontrado.
ru: Указанное сообщение не найдено.

source: You do not have the permissions required to get a message.
es: No tienes los permisos necesarios para poder obtener un mensaje.
ru: У вас нет прав, необходимых для получения сообщения.

source: Retrieving the message failed.
es: Algo falló mientras se obtenía el mensaje.
ru: Получение сообщения не удалось.

source: Retrieves all messages that are currently pinned in the channel.
ru: Получает все сообщения, которые в данный момент закреплены в канале.

source: Due to a limitation with the Discord API, the :class:`.Message` objects returned by this method do not contain complete :attr:`.Message.reactions` data.
ru: Из-за ограничения в Discord API, объекты :class:`.Message`, возвращаемые этим методом, не содержат полных данных :attr:`.Message.reactions`.

source: The messages that are currently pinned.
ru: Сообщения, которые в данный момент закреплены.

source: Retrieving the pinned messages failed.
ru: Не удалось получить закрепленные сообщения.

source: Returns a :class:`bool` indicating whether you have the permissions to send the object(s).
es: Retorna un :class:`bool` el cual indica si tienes permisos de enviar el/los objeto/s.
ru: Возвращает значение :class:`bool`, указывающее, есть ли у вас разрешения на отправку объекта(ов).

source: Indicates whether you have the permissions to send the object(s).
es: Indica si tienes permisos de enviar el/los objeto/s.
ru: Указывает, есть ли у вас разрешения на отправку объекта(ов).

source: An invalid type has been passed.
es: Un objeto de tipo no válido ha sido proporcionado.
ru: Передан недопустимый тип.

source: An ABC that details the common operations on a channel that can connect to a voice server.
es: Una CBA que detalla las operaciones más comunes en un canal al que se puede conectar.
ru: ABC, в котором описаны общие операции с каналом, в котором можно подключиться к голосовому серверу.

source: This ABC is not decorated with :func:`typing.runtime_checkable`, so will fail :func:`isinstance`/:func:`issubclass` checks.
es: Esta CBA no fue decorada con :func:`typing.runtime_checkable` por lo que fallará las comprobaciones :func:`ininstance` e :func:`issubclass`.
ru: У этого ABC нет декоратора :func:`typing.runtime_checkable`, поэтому он не пройдет проверку :func:`isinstance`/:func:`issubclass`.
