Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/api/abcs.po
Languages: es, ru

source: How long the invite should last in seconds. If it's 0 then the invite doesn't expire. Defaults to ``0``.
es: Cuánto durará la invitación en segundos. Si se proporciona 0 entonces esta invitación no expirará. El valor por defecto es ``0``.
ru: Сколько времени должно длиться действие приглашения в секундах. Если значение равно 0, то срок действия приглашения не истекает. По умолчанию ``0``.

source: How many uses the invite could be used for. If it's 0 then there are unlimited uses. Defaults to ``0``.
es: Cuántos usos tendrá la invitación. Si se proporciona 0 entonces tendrá usos ilimitados. El valor por defecto es ``0``.
ru: Сколько раз приглашение может быть использовано. Если значение равно 0, то количество использований не ограничено. По умолчанию ``0``.

source: Denotes that the invite grants temporary membership (i.e. they get kicked after they disconnect). Defaults to ``False``.
es: Marca que la invitación otorgará una membresía temporal (es decir, son expulsados después de desconectarse). El valor por defecto es ``False``.
ru: Обозначает, что приглашение предоставляет временное членство (т.е. если участнику не была назначена роль, то он автоматически выгоняется после отключения). По умолчанию имеет значение ``False``.

source: Indicates if a unique invite URL should be created. Defaults to True. If this is set to ``False`` then it will return a previously created invite.
es: Indica si debería crearse un enlace único para la invitación. El valor por defecto es ``True``. Si se proporciona ``False`` entonces retornará una invitación ya existente.
ru: Указывает, следует ли создавать уникальный URL-адрес приглашения. По умолчанию имеет значение True. Если установить значение ``False``, то будет возвращено ранее созданное приглашение.

source: The reason for creating this invite. Shows up on the audit log.
es: La razón por la que se crea la invitación. Se muestra en el registro de auditoría.
ru: Причина создания этого приглашения. Отображается в журнале аудита.

source: The type of target for the voice channel invite, if any. .. versionadded:: 2.0
es: El tipo de objetivo para la invitación al canal de voz, si aplicable. .. versionadded:: 2.0
ru: Тип цели для приглашения в голосовой канал, если таковой имеется. .. versionadded:: 2.0

source: The type of target for the voice channel invite, if any.
es: El tipo de objetivo para la invitación al canal de voz, si aplicable.
ru: Тип цели для приглашения в голосовой канал, если таковой имеется.

source: The user whose stream to display for this invite, required if `target_type` is `TargetType.stream`. The user must be streaming in the channel. .. versionadded:: 2.0
es: El usuario cuál directo mostrar en esta invitación. Obligatorio si el valor del parámetro `target_type` es `TargetType.stream`. El usuario debe estar en directo en el canal. .. versionadded:: 2.0
ru: Пользователь, чей стрим должен отображаться в этом приглашении; требуется, если `target_type` - `TargetType.stream`. Пользователь должен стримить в этом канале. .. versionadded:: 2.0

source: The user whose stream to display for this invite, required if `target_type` is `TargetType.stream`. The user must be streaming in the channel.
es: El usuario cuál directo mostrar en esta invitación. Obligatorio si el valor del parámetro `target_type` es `TargetType.stream`. El usuario debe estar en directo en el canal.
ru: Пользователь, чей стрим должен отображаться в этом приглашении; требуется, если `target_type` - `TargetType.stream`. Пользователь должен стримить в этом канале.

source: The id of the embedded application for the invite, required if `target_type` is `TargetType.embedded_application`. .. versionadded:: 2.0
es: El ID de la aplicación que mostrar en la invitación. Obligatorio si el valor del parámetro de `target_type` es `TargetType.embedded_application`. .. versionadded:: 2.0
ru: Идентификатор встроенного приложения для приглашения, требуется, если `target_type` имеет значение `TargetType.embedded_application`. .. versionadded:: 2.0

source: The id of the embedded application for the invite, required if `target_type` is `TargetType.embedded_application`.
es: El ID de la aplicación que mostrar en la invitación. Obligatorio si el valor del parámetro de `target_type` es `TargetType.embedded_application`.
ru: Идентификатор встроенного приложения для приглашения, требуется, если `target_type` имеет значение `TargetType.embedded_application`.

source: The scheduled event object to link to the event. Shortcut to :meth:`.Invite.set_scheduled_event` See :meth:`.Invite.set_scheduled_event` for more info on event invite linking. .. versionadded:: 2.0
es: El objeto de evento que enlazar a la invitación. Atajo de :meth:`.Invite.set_scheduled_event`. Véase también :meth:`.Invite.set_scheduled_event` para más información en como enlazar un evento a la invitación. .. versionadded:: 2.0
ru: Объект запланированного события для привязки к событию. Сокращение от :meth:`.Invite.set_scheduled_event` См. дополнительные сведения о привязке приглашений к событиям в :meth:`.Invite.set_scheduled_event`. .. versionadded:: 2.0

source: The scheduled event object to link to the event. Shortcut to :meth:`.Invite.set_scheduled_event`
es: El objeto de evento que enlazar a la invitación. Atajo de :meth:`.Invite.set_scheduled_event`.
ru: Объект запланированного события для привязки к событию. Сокращение от :meth:`.Invite.set_scheduled_event`

source: See :meth:`.Invite.set_scheduled_event` for more info on event invite linking.
es: Véase también :meth:`.Invite.set_scheduled_event` para más información en como enlazar un evento a la invitación.
ru: Дополнительную информацию о привязке приглашений к событиям см. в разделе :meth:`.Invite.set_scheduled_event`.

source: The invite that was created.
es: La invitación que fue creada.
ru: Приглашение, которое было создано.

source: Invite creation failed.
es: Algo falló al crear la invitación.
ru: Не удалось создать приглашение.

source: The channel that was passed is a category or an invalid channel.
es: El canal que se proporcionó era una categoría o era un canal no válido.
ru: Переданный канал является категорией или невалидным каналом.

source: Returns a list of all active instant invites from this channel.
es: Retorna una lista de todas las invitaciones activas de este canal.
ru: Возвращает список всех активных мгновенных приглашений с этого канала.

source: You must have :attr:`~discord.Permissions.manage_channels` to get this information.
es: Debes tener el permiso :attr:`~discord.Permissions.manage_channels` para poder usar esto.
ru: Вы должны иметь :attr:`~discord.Permissions.manage_channels`, чтобы получить эту информацию.

source: The list of invites that are currently active.
es: La lista de invitaciones actualmente activas.
ru: Список приглашений, которые в данный момент активны.

source: You do not have proper permissions to get the information.
es: No tienes los permisos necesarios para poder obtener esta información.
ru: У вас нет соответствующих прав для получения этой информации.

source: An error occurred while fetching the information.
es: Algo falló mientras se obtenía la información.
ru: Произошла ошибка при получении информации.

source: An ABC that details the common operations on a model that can send messages.
es: Una CBA que detalla las operaciones más comunes en un modelo que permite enviar mensajes.
ru: ABC, в котором описаны общие операции над моделью, в которую можно отправлять сообщения.

source: Returns an :class:`~discord.AsyncIterator` that enables receiving the destination's message history.
es: Retorna un iterador asíncrono (:class:`~discord.AsyncIterator`) que permite recibir el historial de mensajes del canal.
ru: Возвращает :class:`~discord.AsyncIterator`, который позволяет получать историю сообщений.

source: You must have :attr:`~discord.Permissions.read_message_history` permissions to use this.
es: Debes tener el permiso :attr:`~discord.Permissions.read_message_history` para poder usar esto.
ru: У вас должно быть разрешение :attr:`~discord.Permissions.read_message_history`, чтобы использовать это.

source: The number of messages to retrieve. If ``None``, retrieves every message in the channel. Note, however, that this would make it a slow operation.
es: La cantidad de mensajes a obtener. Si se proporciona ``None``, obtiene todos los mensajes del canal. Ten en cuenta que esto lo haría una operación lenta.
ru: Количество сообщений, которые необходимо получить. Если ``None``, то будет получено каждое сообщение в канале. Заметьте, что это делает операцию медленной.

source: Retrieve messages before this date or message. If a datetime is provided, it is recommended to use a UTC aware datetime. If the datetime is naive, it is assumed to be local time.
es: Obtiene los mensajes antes de esta fecha o mensaje. Si se proporciona un datetime, se recomienda que sea con una zona horaria establecida en UTC, en caso de que no, se asumirá que está en hora local.
ru: Получение сообщений до указанной даты или сообщения. Если указана дата, то рекомендуется использовать время, соответствующее UTC. Если datetime не указан, предполагается, что это местное время.

source: Retrieve messages after this date or message. If a datetime is provided, it is recommended to use a UTC aware datetime. If the datetime is naive, it is assumed to be local time.
es: Obtiene los mensajes después de esta fecha o mensaje. Si se proporciona un datetime, se recomienda que sea con una zona horaria establecida en UTC, en caso de que no, se asumirá que está en hora local.
ru: Получение сообщений после указанной даты или сообщения. Если указана дата, то рекомендуется использовать время, соответствующее UTC. Если datetime не указан, предполагается, что это местное время.

source: Retrieve messages around this date or message. If a datetime is provided, it is recommended to use a UTC aware datetime. If the datetime is naive, it is assumed to be local time. When using this argument, the maximum limit is 101. Note that if the limit is an even number, then this will return at most limit + 1 messages.
es: Obtiene los mensajes alrededor de esta fecha o mensaje. Si se proporciona un datetime, se recomienda que sea con una zona horaria establecida en UTC, en caso de que no, se asumirá que está en hora local. Cuando se usa este argumento, el límite que se pueden obtener es de 101. Ten en cuenta que si el límite es par, entonces esto retornará como mucho el límite + 1 mensajes.
ru: Получение сообщений, относящихся к указанной дате или сообщению. Если указано дата, то рекомендуется использовать время, соответствующее UTC. Если datetime не указан, предполагается, что это местное время. При использовании этого аргумента максимальное ограничение равно 101. Обратите внимание, что если лимит - четное число, то будет возвращено не более лимита + 1 сообщений.

source: If set to ``True``, return messages in oldest->newest order. Defaults to ``True`` if ``after`` is specified, otherwise ``False``.
es: Si se proporciona ``True``, retorna los mensajes en orden de creación descendente (antiguo -> nuevo). El valor por defecto es ``True`` si se proporciona un valor a ``after``, sino es ``False``.
ru: Если установлено значение ``True``, сообщения будут возвращаться в порядке старый -> новый. По умолчанию имеет значение ``True``, если указано ``after``, иначе ``False``.

source: Yields
es: Genera
ru: Выход

source: :class:`~discord.Message` -- The message with the message data parsed.
es: :class:`~discord.Message` -- El mensaje con la información analizada.
ru: :class:`~discord.Message` -- Сообщение с разобранными данными сообщения.

source: You do not have permissions to get channel message history.
es: No tienes permisos para ver el historial de mensajes de este canal.
ru: У вас нет прав на получение истории сообщений канала.

source: The request to get message history failed.
es: Algo falló mientras se obtenía el historial de mensajes.
ru: Не удалось получить историю сообщений.

source: Usage ::
es: Uso ::
ru: Использование ::

source: Flattening into a list: ::
es: Convertir a una lista: ::
ru: Сжатие в список: ::

source: All parameters are optional.
es: Todos los parámetros son opcionales.
ru: Все параметры являются опциональными.

source: Returns a context manager that allows you to type for an indefinite period of time.
es: Retorna un gestor de contexto que permite que aparezcas como "escribiendo" por un periodo de tiempo indefinido.
ru: Возвращает контекстный менеджер, позволяющий печатать текст в течение неопределенного времени.

source: This is useful for denoting long computations in your bot. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~discord.context\_managers.Typing\``
ru: Это удобно для обозначения длинных вычислений в вашем боте. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~discord.context\_managers.Typing\``

source: This is both a regular context manager and an async context manager. This means that both ``with`` and ``async with`` work with this.
es: Esto es tanto como un gestor de contexto síncrono como asíncrono, que quiere decir que, se puede utilizar tanto en un gestor de contexto ``with`` como ``async with``.
ru: Это одновременно и обычный, и асинхронный контекстный менеджер. Это означает, что с ним работают как ``with``, так и ``async with``.

source: Example Usage: ::
es: Ejemplo de uso: ::
ru: Пример использования: ::

source: Sends a message to the destination with the content given.
es: Envía un mensaje al canal con el contenido proporcionado.
ru: Отправляет сообщение с заданным содержимым.

source: The content must be a type that can convert to a string through ``str(content)``. If the content is set to ``None`` (the default), then the ``embed`` parameter must be provided.
es: El valor del parámetro ``content`` debe de ser un objeto convertible a una cadena mediante ``str(content)``. Si se establece a ``None`` (el valor por defecto), entonces el parámetro ``embed`` debe ser porporcionado.
ru: Содержимое должно быть типом, который может быть преобразован в строку через ``str(content)``. Если для content задано значение ``None`` (по умолчанию), то необходимо указать параметр ``embed``.

source: To upload a single file, the ``file`` parameter should be used with a single :class:`~discord.File` object. To upload multiple files, the ``files`` parameter should be used with a :class:`list` of :class:`~discord.File` objects. **Specifying both parameters will lead to an exception**.
es: Para adjuntar un solo archivo se ha de utilizar el parámetro ``file`` con un :class:`~discord.File`. Para adjuntar varios archivos se recomienda utilizar el parámetro ``files`` en vez, en este caso, proporcionando una :class:`list` de objetos :class:`~discord.File`. **En caso de especificar los dos, se mostrará un error**.
ru: Для загрузки одного файла параметр ``file`` должен использоваться с одним объектом :class:`~discord.File`. Для загрузки нескольких файлов параметр ``files`` следует использовать с :class:`list` включающим в себя :class:`~discord.File`. **Указание обоих параметров приведет к исключению**.

source: To upload a single embed, the ``embed`` parameter should be used with a single :class:`~discord.Embed` object. To upload multiple embeds, the ``embeds`` parameter should be used with a :class:`list` of :class:`~discord.Embed` objects. **Specifying both parameters will lead to an exception**.
es: Para enviar un solo embed se ha de utilizar el parámetro ``embed`` con un objeto de tipo :class:`~discord.Embed`. Para adjuntar varios embeds se recomienda utilizar el parámetro ``embeds`` en vez, en este caso, proporcionando un objeto de tipo :class:`list` cuyos elementos han de ser instancias de :class:`~discord.Embed`. **En caso de especificar los dos, se mostrará un error**.
ru: Для загрузки одного вложения параметр ``embed`` должен использоваться с одним объектом :class:`~discord.Embed`. Чтобы загрузить несколько вложений, параметр ``embeds`` следует использовать с :class:`list` включающим в себя :class:`~discord.Embed`. **Указание обоих параметров приведет к исключению**.

source: The content of the message to send.
es: El contenido del mensaje a enviar.
ru: Содержимое сообщения для отправки.

source: Indicates if the message should be sent using text-to-speech.
es: Indica si el mensaje se enviará usando la función texto a voz.
ru: Указывает, следует ли отправлять сообщение с использованием технологии преобразования текста в речь.

source: The rich embed for the content.
es: El embed que adjuntar.
ru: Вложение для содержимого.

source: The file to upload.
es: El archivo que adjuntar.
ru: Файл для загрузки.

source: A list of files to upload. Must be a maximum of 10.
es: Una lista de archivos a adjuntar. Debe de ser un máximo de 10 elementos.
ru: Список файлов для загрузки. Должно быть не более 10.

source: The nonce to use for sending this message. If the message was successfully sent, then the message will have a nonce with this value.
es: El valor único a utilizar para enviar este mensaje. Si el mensaje se envió correctamente, entonces el mensaje tendrá como nonce este valor.
ru: Nonce, используемый для отправки этого сообщения. Если сообщение было успешно отправлено, то оно будет иметь nonce с этим значением.

source: Whether :attr:`nonce` is enforced to be validated. .. versionadded:: 2.5
es: Si se forzará la validación del atributo :attr:`nonce`. .. versionadded:: 2.5
ru: Нужно ли принудительно проверять :attr:`nonce`. .. versionadded:: 2.5

source: Whether :attr:`nonce` is enforced to be validated.
es: Si se forzará la validación del atributo :attr:`nonce`.
ru: Нужно ли принудительно проверять :attr:`nonce`.

source: If provided, the number of seconds to wait in the background before deleting the message we just sent. If the deletion fails, then it is silently ignored.
es: Si es proporcionado, la cantidad de segundos a esperar en segundo plano antes de eliminar el mensaje que se envió. Si algo falla mientras se eliminaba el mensaje, entonces el error es silenciosamente ignorado.
ru: Если указано, то количество секунд, которое нужно подождать в фоновом режиме перед удалением только что отправленного сообщения. Если удаление не удается, то оно молча игнорируется.

source: Controls the mentions being processed in this message. If this is passed, then the object is merged with :attr:`~discord.Client.allowed_mentions`. The merging behaviour only overrides attributes that have been explicitly passed to the object, otherwise it uses the attributes set in :attr:`~discord.Client.allowed_mentions`. If no object is passed at all then the defaults given by :attr:`~discord.Client.allowed_mentions` are used instead. .. versionadded:: 1.4
es: Controla las menciones que se procesarán en el mensaje. Si esto es proporcionado entonces se combinará con :attr:`~discord.Client.allowed_mentions`. La combinación solo sobrescribirá aquellos atributos que se hayan explícitamente proporcionado, sino, usa los establecidos en :attr:`~discord.Client.allowed_mentions`. Si no se proporciona ningún valor, usa como valor el establecido en :attr:`~discord.Client.allowed_mentions`. .. versionadded:: 1.4
ru: Управляет упоминаниями, обрабатываемыми в этом сообщении. Если это передано, то объект сливается с :attr:`~discord.Client.allowed_mentions`. Поведение слияния переопределяет только атрибуты, которые были явно переданы объекту, в противном случае используется атрибуты, установленные в :attr:`~discord.Client.allowed_mentions`. Если объект вообще не передается, то используются значения по умолчанию, указанные :attr:`~discord.Client.allowed_mentions`. .. versionadded:: 1.4

source: Controls the mentions being processed in this message. If this is passed, then the object is merged with :attr:`~discord.Client.allowed_mentions`. The merging behaviour only overrides attributes that have been explicitly passed to the object, otherwise it uses the attributes set in :attr:`~discord.Client.allowed_mentions`. If no object is passed at all then the defaults given by :attr:`~discord.Client.allowed_mentions` are used instead.
es: Controla las menciones que se procesarán en el mensaje. Si esto es proporcionado entonces se combinará con :attr:`~discord.Client.allowed_mentions`. La combinación solo sobrescribirá aquellos atributos que se hayan explícitamente proporcionado, sino, usa los establecidos en :attr:`~discord.Client.allowed_mentions`. Si no se proporciona ningún valor, usa como valor el establecido en :attr:`~discord.Client.allowed_mentions`.
ru: Управляет упоминаниями, обрабатываемыми в этом сообщении. Если это передано, то объект сливается с :attr:`~discord.Client.allowed_mentions`. Поведение слияния переопределяет только атрибуты, которые были явно переданы объекту, в противном случае используется атрибуты, установленные в :attr:`~discord.Client.allowed_mentions`. Если объект вообще не передается, то используются значения по умолчанию, указанные :attr:`~discord.Client.allowed_mentions`.

source: A reference to the :class:`~discord.Message` to which you are replying, this can be created using :meth:`~discord.Message.to_reference` or passed directly as a :class:`~discord.Message`. You can control whether this mentions the author of the referenced message using the :attr:`~discord.AllowedMentions.replied_user` attribute of ``allowed_mentions`` or by setting ``mention_author``. .. versionadded:: 1.6
ru: Ссылка на :class:`~discord.Message`, на которое вы отвечаете; она может быть создана с помощью :meth:`~discord.Message.to_reference` или передана непосредственно как :class:`~discord.Message`. Вы можете контролировать, упоминается ли при этом автор ссылающегося сообщения, используя :attr:`~discord.AllowedMentions.replied_user` атрибут ``allowed_mentions`` или установив ``mention_author``. .. versionadded:: 1.6

source: A reference to the :class:`~discord.Message` to which you are replying, this can be created using :meth:`~discord.Message.to_reference` or passed directly as a :class:`~discord.Message`. You can control whether this mentions the author of the referenced message using the :attr:`~discord.AllowedMentions.replied_user` attribute of ``allowed_mentions`` or by setting ``mention_author``.
ru: Ссылка на :class:`~discord.Message`, на которое вы отвечаете; она может быть создана с помощью :meth:`~discord.Message.to_reference` или передана непосредственно как :class:`~discord.Message`. Вы можете контролировать, упоминается ли при этом автор ссылающегося сообщения, используя :attr:`~discord.AllowedMentions.replied_user` атрибут ``allowed_mentions`` или установив ``mention_author``.

source: If set, overrides the :attr:`~discord.AllowedMentions.replied_user` attribute of ``allowed_mentions``. .. versionadded:: 1.6
es: Si es establecido, sobrescribe el atributo :attr:`~discord.AllowedMentions.replied_user` del parámetro ``allowed_mentions``. .. versionadded:: 1.6
ru: Если установлено, переопределяет :attr:`~discord.AllowedMentions.replied_user` атрибут ``allowed_mentions``. .. versionadded:: 1.6

source: If set, overrides the :attr:`~discord.AllowedMentions.replied_user` attribute of ``allowed_mentions``.
es: Si es establecido, sobrescribe el atributo :attr:`~discord.AllowedMentions.replied_user` del parámetro ``allowed_mentions``.
ru: Если установлено, переопределяет :attr:`~discord.AllowedMentions.replied_user` атрибут ``allowed_mentions``.

source: A Discord UI View to add to the message.
es: El contenedor de componentes al que añadir al mensaje.
ru: Discord UI View для добавления в сообщение.

source: A list of embeds to upload. Must be a maximum of 10. .. versionadded:: 2.0
es: Una lista de embeds que adjuntar. El máximo de elementos es 10. .. versionadded:: 2.0
ru: Список вложений для загрузки. Должно быть не более 10. .. versionadded:: 2.0
