Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/api/application_info.po
Languages: ru

source: Application Info
ru: Информация о приложении

source: Represents the application info for the bot provided by Discord.
ru: Представляет информацию о приложении для бота, предоставленную Discord.

source: The application ID.
ru: ID приложения.

source: type
ru: тип

source: The application name.
ru: Название приложения.

source: The application owner.
ru: Владелец приложения.

source: The application's team.
ru: Команда приложения.

source: The application description.
ru: Описание приложения.

source: Whether the bot can be invited by anyone or if it is locked to the application owner.
ru: Может ли бот быть приглашен кем угодно, или он закрыт только для владельца приложения.

source: Whether the bot requires the completion of the full OAuth2 code grant flow to join.
ru: Требуется ли боту завершить полный поток предоставления кода OAuth2, чтобы присоединиться.

source: A list of RPC origin URLs, if RPC is enabled.
ru: Список URL-адресов RPC, если RPC включен.

source: If this application is a game sold on Discord, this field will be the summary field for the store page of its primary SKU.
ru: Если это приложение является игрой, продаваемой в Discord, это поле будет сводкой страницы магазина его основной SKU.

source: The hex encoded key for verification in interactions and the GameSDK's `GetTicket <https://discord.com/developers/docs/game-sdk/applications#getticket>`_.
ru: Ключ в шестнадцатеричной кодировке для проверки во взаимодействиях и GameSDK `GetTicket <https://discord.com/developers/docs/game-sdk/applications#getticket>`_.

source: If this application is a game sold on Discord, this field will be the guild to which it has been linked to.
ru: Если это приложение является игрой, продаваемой в Discord, это поле будет сервером, к которому она была привязана.

source: If this application is a game sold on Discord, this field will be the id of the "Game SKU" that is created, if it exists.
ru: Если это приложение является игрой, продаваемой в Discord, это поле будет идентификатором "Game SKU", который создается, если он существует.

source: If this application is a game sold on Discord, this field will be the URL slug that links to the store page.
ru: Если это приложение является игрой, продаваемой в Discord, это поле будет URL-адресом, который ссылается на страницу в магазине.

source: The application's terms of service URL, if set.
ru: URL-адрес условий использования приложения, если установлено.

source: The application's privacy policy URL, if set.
ru: URL-адрес политики конфиденциальности приложения, если установлено.

source: Parameters
ru: Параметры

source: Retrieves the application's icon asset, if any.
ru: Возвращает иконку приложения, если имеется.

source: Retrieves the cover image on a store embed, if any.
ru: Возвращает обложку из магазина, если имеется.

source: This is only available if the application is a game sold on Discord.
ru: Это доступно только в том случае, если приложение продается в Discord.

source: If this application is a game sold on Discord, this field will be the guild to which it has been linked.
ru: Если это приложение является игрой, продаваемой в Discord, это поле будет сервером, к которому она была привязана.

source: Represents a partial AppInfo given by :func:`~discord.abc.GuildChannel.create_invite`
ru: Представляет частичную AppInfo, предоставленную :func:`~discord.abc.GuildChannel.create_invite`

source: Represents an application team for a bot provided by Discord.
ru: Представляет собой команду разработчиков бота, предоставляемого Discord.

source: The team ID.
ru: Идентификатор команды.

source: The team name.
ru: Название команды.

source: The team's owner ID.
ru: Идентификатор владельца команды.

source: A list of the members in the team.
ru: Список участников команды.

source: Retrieves the team's icon asset, if any.
ru: Возвращает иконку команды, если имеется.

source: The team's owner.
ru: Владелец команды.

source: Represents a team member in a team.
ru: Представляет собой участника команды.

source: Checks if two team members are equal.
ru: Проверяет, равны ли два участника команды.

source: Checks if two team members are not equal.
ru: Проверяет, не равны ли два участника команды.

source: Return the team member's hash.
ru: Возвращает хеш участника команды.

source: Returns the team member's name with discriminator or global_name.
ru: Возвращает имя участника команды с дискриминатором или глобальным именем.

source: The team member's username.
ru: Имя участника команды.

source: The team member's unique ID.
ru: Уникальный идентификатор участника команды.

source: The team member's discriminator. This is given when the username has conflicts.
ru: Дискриминатор участника команды. Дается когда имена пользователей конфликтуют.

source: If the user has migrated to the new username system, this will always be "0".
ru: Если пользователь мигрировал в новую систему имени пользователя, это всегда будет "0".

source: The team member's global name.
ru: Глобальное имя участника команды.

source: The avatar hash the team member has. Could be ``None``.
ru: Хеш аватара участника команды. Может быть ``None``.

source: Specifies if the user is a bot account.
ru: Определяет, является ли пользователь учетной записью бота.

source: The team that the member is from.
ru: Команда, в которой состоит участник.

source: The membership state of the member (e.g. invited or accepted)
ru: Статус членства участника (например, приглашенный или принятый)
