Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/api/async_iter.po
Languages: ru

source: Async Iterator
ru: Асинхронный Итератор

source: Some API functions return an "async iterator". An async iterator is something that is capable of being used in an :ref:`async for statement <py:async for>`.
ru: Некоторые функции API возвращают "асинхронный итератор". Асинхронный итератор - это то, что может быть использовано в операторе :ref:`async for <py:async for>`.

source: These async iterators can be used as follows: ::
ru: Эти асинхронные итераторы можно использовать следующим образом: ::

source: Certain utilities make working with async iterators easier, detailed below.
ru: Некоторые утилиты облегчают работу с асинхронными итераторами, о них мы расскажем ниже.

source: Represents the "AsyncIterator" concept. Note that no such class exists, it is purely abstract.
ru: Представляет концепцию "AsyncIterator". Обратите внимание, что такого класса не существует, он является чисто абстрактным.

source: Iterates over the contents of the async iterator.
ru: Выполняет итерацию над содержимым асинхронного итератора.

source: Advances the iterator by one, if possible. If no more items are found then this raises :exc:`NoMoreItems`.
ru: Продвигает итератор на один элемент, если это возможно. Если больше не найдено ни одного элемента, то возникает исключение :exc:`NoMoreItems`.

source: Similar to :func:`utils.get` except run over the async iterator.
ru: Аналогично :func:`utils.get`, только выполняется через асинхронный итератор.

source: Getting the last message by a user named 'Dave' or ``None``: ::
ru: Получение последнего сообщения от пользователя с именем 'Dave' или ``None``: ::

source: Similar to :func:`utils.find` except run over the async iterator.
ru: Аналогично :func:`utils.find`, только выполняется через асинхронный итератор.

source: Unlike :func:`utils.find`\, the predicate provided can be a |coroutine_link|_.
ru: В отличие от :func:`utils.find`\, предоставленный предикат может быть |coroutine_link|_.

source: Getting the last audit log with a reason or ``None``: ::
ru: Получение последнего журнала аудита с указанием причины или ``None``: ::

source: Parameters
ru: Параметры

source: The predicate to use. Could be a |coroutine_link|_.
ru: Предикат для использования. Может быть |coroutine_link|_.

source: Returns
ru: Возвращает

source: The first element that returns ``True`` for the predicate or ``None``.
ru: Первый элемент, который возвращает ``True`` для предиката или ``None``.

source: Flattens the async iterator into a :class:`list` with all the elements.
ru: Переводит асинхронный итератор в :class:`list` со всеми элементами.

source: A list of every element in the async iterator.
ru: Список каждого элемента в асинхронном итераторе.

source: Return type
ru: Возвращаемый тип

source: Collects items into chunks of up to a given maximum size. Another :class:`AsyncIterator` is returned which collects items into :class:`list`\s of a given size. The maximum chunk size must be a positive integer.
ru: Собирает элементы в чанки до заданного максимального размера. Возвращается другой :class:`AsyncIterator`, который собирает элементы в :class:`list`\ы заданного размера. Максимальный размер чанка должен быть целым положительным числом.

source: Collecting groups of users: ::
ru: Сбор групп пользователей: ::

source: The last chunk collected may not be as large as ``max_size``.
ru: Последний собранный чанк может быть не таким большим, как ``max_size``.

source: The size of individual chunks.
ru: Размер отдельных чанков.

source: This is similar to the built-in :func:`map <py:map>` function. Another :class:`AsyncIterator` is returned that executes the function on every element it is iterating over. This function can either be a regular function or a |coroutine_link|_.
ru: Это похоже на встроенную функцию :func:`map <py:map>`. Возвращается другой :class:`AsyncIterator`, который выполняет функцию на каждом итерируемым элементе. Эта функция может быть либо обычной функцией, либо |coroutine_link|_.

source: Creating a content iterator: ::
ru: Создание итератора содержимого: ::

source: The function to call on every element. Could be a |coroutine_link|_.
ru: Функция для вызова на каждом элементе. Может быть |coroutine_link|_.

source: This is similar to the built-in :func:`filter <py:filter>` function. Another :class:`AsyncIterator` is returned that filters over the original async iterator. This predicate can be a regular function or a |coroutine_link|_.
ru: Это похоже на встроенную функцию :func:`filter <py:filter>`. Возвращается другой :class:`AsyncIterator`, который фильтрует исходный асинхронный итератор. Этот предикат может быть обычной функцией или |coroutine_link|_.

source: Getting messages by non-bot accounts: ::
ru: Получение сообщений от учетных записей, не являющихся ботами: ::

source: The predicate to call on every element. Could be a |coroutine_link|_.
ru: Предикат для вызова на каждом элементе. Может быть |coroutine_link|_.
