Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/api/cogs.po
Languages: ru

source: Cogs
ru: Коги

source: The base class that all cogs must inherit from.
ru: Базовый класс, от которого должны наследоваться все коги.

source: A cog is a collection of commands, listeners, and optional state to help group commands together. More information on them can be found on the :ref:`ext_commands_cogs` page.
ru: Ког - это набор команд, слушателей и необязательных состояний, которые помогают сгруппировать команды. Более подробную информацию о них можно найти на странице :ref:`ext_commands_cogs`.

source: When inheriting from this class, the options shown in :class:`CogMeta` are equally valid here.
ru: При наследовании от этого класса опции, указанные в :class:`CogMeta`, одинаково актуальны и здесь.

source: Returns
ru: Возвращает

source: A :class:`list` of :class:`.ApplicationCommand`\s that are defined inside this cog. .. note:: This does not include subcommands.
ru: :class:`list` включающий в себя :class:`.ApplicationCommand`\ы которые определены внутри этого кога. .. note:: Сюда не входят подкоманды.

source: A :class:`list` of :class:`.ApplicationCommand`\s that are defined inside this cog.
ru: :class:`list` включающий в себя :class:`.ApplicationCommand`\ы которые определены внутри этого кога.

source: This does not include subcommands.
ru: Сюда не входят подкоманды.

source: Return type
ru: Тип возврата

source: Returns the cog's specified name, not the class name.
ru: Возвращает указанное имя кога, а не имя класса.

source: Returns the cog's description, typically the cleaned docstring.
ru: Возвращает описание когда, обычно очищенный docstring.

source: An iterator that recursively walks through this cog's commands and subcommands.
ru: Итератор, который рекурсивно перебирает команды и подкоманды этого кога.

source: Yields
ru: Выход

source: Union[:class:`.Command`, :class:`.Group`] -- A command or group from the cog.
ru: Union[:class:`.Command`, :class:`.Group`] -- Команда или группа из кога.

source: Returns a :class:`list` of (name, function) listener pairs that are defined in this cog.
ru: Возвращает :class:`list` (имя, функция) слушателей, которые определены в этом коге.

source: The listeners defined in this cog.
ru: Слушатели, определенные в этом коге.

source: A decorator that marks a function as a listener.
ru: Декоратор, который помечает функцию как слушателя.

source: This is the cog equivalent of :meth:`.Bot.listen`.
ru: Это эквивалентно :meth:`.Bot.listen`.

source: Parameters
ru: Параметры

source: The name of the event being listened to. If not provided, it defaults to the function's name.
ru: Имя прослушиваемого события. Если оно не указано, то по умолчанию используется имя функции.

source: If this listener should only be called once after each cog load. Defaults to false.
ru: Если этот слушатель должен вызываться только один раз после каждой загрузки кога.

source: Raises
ru: Вызывает

source: The function is not a coroutine function or a string was not passed as the name.
ru: Функция не является короутинной функцией или в качестве имени не была передана строка.

source: Checks whether the cog has an error handler. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`bool\``
ru: Проверяет, есть ли у кога обработчик ошибок. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`bool\``

source: A special method that is called when the cog gets removed.
ru: Специальный метод, который вызывается, когда ког удаляется.

source: This function **cannot** be a coroutine. It must be a regular function.
ru: Эта функция **не может** быть короутиной. Она должна быть обычной функцией.

source: Subclasses must replace this if they want special unloading behaviour.
ru: Подклассы должны заменить ее, если им нужно особое поведение при выгрузке кога.

source: A special method that registers as a :meth:`.Bot.check_once` check.
ru: Специальный метод, который регистрируется как проверка :meth:`.Bot.check_once`.

source: This function **can** be a coroutine and must take a sole parameter, ``ctx``, to represent the :class:`.Context` or :class:`.ApplicationContext`.
ru: Эта функция **может** быть короутиной и должна принимать единственный параметр, ``ctx``, представляющий собой :class:`.Context` или :class:`.ApplicationContext`.

source: The invocation context.
ru: Контекст вызова.

source: A special method that registers as a :meth:`.Bot.check` check.
ru: Специальный метод, который регистрируется как проверка:meth:`.Bot.check`.

source: A special method that registers as a :func:`~discord.ext.commands.check` for every command and subcommand in this cog.
ru: Специальный метод, который регистрируется как :func:`~discord.ext.commands.check` для каждой команды и подкоманды в этом коге.

source: A special method that is called whenever an error is dispatched inside this cog.
ru: Специальный метод, который вызывается всякий раз, когда внутри этого кога происходит ошибка.

source: This is similar to :func:`.on_command_error` except only applying to the commands inside this cog.
ru: Это похоже на :func:`.on_command_error`, только применяется к командам внутри этого кога.

source: This **must** be a coroutine.
ru: Это **должно** быть короутиной.

source: The invocation context where the error happened.
ru: Контекст вызова, в котором произошла ошибка.

source: The error that happened.
ru: Ошибка, которая произошла.

source: A special method that acts as a cog local pre-invoke hook.
ru: Специальный метод, который действует как локальный хук кога предварительного вызова.

source: This is similar to :meth:`.ApplicationCommand.before_invoke`.
ru: Это похоже на :meth:`.ApplicationCommand.before_invoke`.

source: A special method that acts as a cog local post-invoke hook.
ru: Специальный метод, который действует как локальный хук кога после вызова.

source: This is similar to :meth:`.ApplicationCommand.after_invoke`.
ru: Это похоже на :meth:`.ApplicationCommand.after_invoke`.

source: A metaclass for defining a cog.
ru: Метакласс для определения кога.

source: Note that you should probably not use this directly. It is exposed purely for documentation purposes along with making custom metaclasses to intermix with other metaclasses such as the :class:`abc.ABCMeta` metaclass.
ru: Обратите внимание, что вам, вероятно, не следует использовать его напрямую. Он используется исключительно в целях документации, а также для создания пользовательских метаклассов для смешивания с другими метаклассами, такими как метакласс :class:`abc.ABCMeta`.

source: For example, to create an abstract cog mixin class, the following would be done.
ru: Например, чтобы создать абстрактный класс cog mixin, нужно сделать следующее.

source: When passing an attribute of a metaclass that is documented below, note that you must pass it as a keyword-only argument to the class creation like the following example:
ru: При передаче атрибута метакласса, который документирован ниже, обратите внимание, что вы должны передавать его как аргумент создания класса, содержащий только ключевое слово, как показано в следующем примере:

source: The cog name. By default, it is the name of the class with no modification.
ru: Имя кога. По умолчанию это имя класса без изменений.

source: type
ru: тип

source: The cog description. By default, it is the cleaned docstring of the class.
ru: Описание кога. По умолчанию это очищенный docstring класса.

source: A list of attributes to apply to every command inside this cog. The dictionary is passed into the :class:`Command` options at ``__init__``. If you specify attributes inside the command attribute in the class, it will override the one specified inside this attribute. For example:
ru: Список атрибутов, применяемых к каждой команде внутри этого кога. Словарь передается в опции :class:`Command`` при ``__init__``. Если вы укажете атрибуты внутри атрибута command в классе, то он будет переопределять тот, который указан внутри этого атрибута. Например:

source: A shortcut to :attr:`.command_attrs`, what ``guild_ids`` should all application commands have in the cog. You can override this by setting ``guild_ids`` per command.
ru: Сокращение для :attr:`.command_attrs`, какие ``guild_ids`` должны быть у всех команд приложения в cog. Вы можете переопределить это, установив ``guild_ids`` для каждой команды.
