Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/api/exceptions.po
Languages: ru

source: Exceptions
ru: Исключения

source: Exception Hierarchy
ru: Иерархия исключений

source: Objects
ru: Объекты

source: The following exceptions are thrown by the library.
ru: Библиотека вызывает следующие исключения.

source: Base exception class for pycord
ru: Базовый класс исключения pycord

source: Ideally speaking, this could be caught to handle any exceptions raised from this library.
ru: В идеале, это может быть сделано для обработки любых исключений, возникающих при работе с этой библиотекой.

source: Exception that's raised when an operation in the :class:`Client` fails.
ru: Исключение, возникающее при неудачном выполнении операции в :class:`Client`.

source: These are usually for exceptions that happened due to user input.
ru: Обычно они предназначены для исключений, возникших из-за ввода данных пользователем.

source: Exception that's raised when the :meth:`Client.login` function fails to log you in from improper credentials or some other misc. failure.
ru: Исключение, возникающее, когда функция :meth:`Client.login` не смогла войти в систему из-за неправильных учетных данных или других ошибок.

source: Exception that is raised when an async iteration operation has no more items.
ru: Исключение, возникающее, когда в асинхронной итерационной операции больше нет элементов.

source: Exception that's raised when an HTTP request operation fails.
ru: Исключение, возникающее при неудачном HTTP-запросе.

source: The response of the failed HTTP request. This is an instance of :class:`aiohttp.ClientResponse`. In some cases this could also be a :class:`requests.Response`.
ru: Ответ на неудачный HTTP-запрос. Это экземпляр :class:`aiohttp.ClientResponse`. В некоторых случаях это также может быть экземпляр :class:`requests.Response`.

source: type
ru: тип

source: The text of the error. Could be an empty string.
ru: Текст ошибки. Может быть пустой строкой.

source: The status code of the HTTP request.
ru: Код статуса HTTP-запроса.

source: The Discord specific error code for the failure.
ru: Код ошибки, связанный со сбоем в Discord.

source: Parameters
ru: Параметры

source: Exception that's raised for when status code 403 occurs.
ru: Исключение, возникающее при появлении кода состояния 403.

source: Subclass of :exc:`HTTPException`
ru: Подкласс :exc:`HTTPException`

source: Exception that's raised for when status code 404 occurs.
ru: Исключение, возникающее при появлении кода состояния 404.

source: Exception that's raised for when a 500 range status code occurs.
ru: Исключение, возникающее при появлении кода состояния в диапазоне 500.

source: Subclass of :exc:`HTTPException`.
ru: Подкласс :exc:`HTTPException`.

source: Exception that's raised when the library encounters unknown or invalid data from Discord.
ru: Исключение, возникающее, когда библиотека получает неизвестные или недействительные данные из Discord.

source: Exception that's raised when an argument to a function is invalid some way (e.g. wrong value or wrong type).
ru: Исключение, возникающее, когда аргумент функции каким-либо образом недействителен (например, имеет неправильное значение или неправильный тип).

source: This could be considered the parallel of ``ValueError`` and ``TypeError`` except inherited from :exc:`ClientException` and thus :exc:`DiscordException`.
ru: Это можно считать параллелью ``ValueError`` и ``TypeError``, только унаследованной от :exc:`ClientException`` и, соответственно, :exc:`DiscordException``.

source: An exception that is raised when the gateway for Discord could not be found
ru: Исключение, которое возникает, когда шлюз для Discord не может быть найден

source: Exception that's raised when the gateway connection is closed for reasons that could not be handled internally.
ru: Исключение, возникающее, когда соединение со шлюзом закрывается по причинам, которые не могут быть обработаны.

source: The close code of the websocket.
ru: Код закрытия веб-сокета.

source: The reason provided for the closure.
ru: Причина закрытия.

source: The shard ID that got closed if applicable.
ru: Идентификатор шарда, который был закрыт, если применимо.

source: Exception that's raised when the gateway is requesting privileged intents, but they're not ticked in the developer page yet.
ru: Исключение, возникающее, когда шлюз запрашивает привилегированные намерения, но они еще не включены на странице разработчика.

source: Go to https://discord.com/developers/applications/ and enable the intents that are required. Currently, these are as follows:
ru: Перейдите на страницу https://discord.com/developers/applications/ и включите необходимые намерения. В настоящее время они следующие:

source: Exception that's raised when sending another interaction response using :class:`InteractionResponse` when one has already been done before.
ru: Исключение, возникающее при отправке еще одного ответа на интеракцию с помощью :class:`InteractionResponse`, когда один уже был сделан ранее.

source: An interaction can only respond once.
ru: На интеракцию можно ответить только один раз.

source: The interaction that's already been responded to.
ru: Интеракция, на которое уже был дан ответ.

source: An exception that is thrown for libopus related errors.
ru: Исключение, которое выбрасывается при ошибках, связанных с libopus.

source: The error code returned.
ru: Возвращенный код ошибки.

source: An exception that is thrown for when libopus is not loaded.
ru: Исключение, возникающее, когда libopus не загружен.

source: The base exception type for all application command related errors.
ru: Базовый тип исключения для всех ошибок, связанных с командами приложения.

source: This inherits from :exc:`DiscordException`.
ru: Наследуется от :exc:`DiscordException`.

source: This exception and exceptions inherited from it are handled in a special way as they are caught and passed into a special event from :class:`.Bot`\, :func:`.on_command_error`.
ru: Это исключение и унаследованные от него исключения обрабатываются особым образом, поскольку они перехватываются и передаются в специальное событие из :class:`.Bot`\, :func:`.on_command_error`.

source: Exception raised when the predicates in :attr:`.Command.checks` have failed.
ru: Исключение поднимается, если предикаты в :attr:`.Command.checks` не сработали.

source: This inherits from :exc:`ApplicationCommandError`
ru: Наследуется от :exc:`ApplicationCommandError`

source: Exception raised when the command being invoked raised an exception.
ru: Исключение, возникающее, когда вызываемая команда вызывает исключение.

source: The original exception that was raised. You can also get this via the ``__cause__`` attribute.
ru: Первоначальное исключение, которое было поднято. Вы также можете получить его через атрибут ``__cause__``.

source: Base exception for extension related errors.
ru: Базовое исключение для ошибок, связанных с расширением.

source: This inherits from :exc:`~discord.DiscordException`.
ru: Оно наследуется от :exc:`~discord.DiscordException`.

source: The extension that had an error.
ru: Расширение, в котором произошла ошибка.

source: An exception raised when an extension has already been loaded.
ru: Исключение, возникающее, когда расширение уже было загружено.

source: This inherits from :exc:`ExtensionError`
ru: Наследуется от :exc:`ExtensionError`

source: An exception raised when an extension was not loaded.
ru: Исключение, возникающее, когда расширение не было загружено.

source: An exception raised when an extension does not have a ``setup`` entry point function.
ru: Исключение, возникающее, когда расширение не имеет функции точки входа ``setup``.

source: An exception raised when an extension failed to load during execution of the module or ``setup`` entry point.
ru: Исключение, возникающее, когда расширение не удалось загрузить во время выполнения модуля или точки входа ``setup``.

source: The extension that had the error.
ru: Расширение, в котором возникла ошибка.

source: An exception raised when an extension is not found.
ru: Исключение, возникающее, когда расширение не найдено.

source: Made the ``original`` attribute always None.
ru: Атрибут ``original`` теперь всегда None.

source: Raised when a Sink error occurs.
ru: Возбуждается при возникновении ошибки Sink.

source: Exception that's thrown when there is an error while trying to record audio from a voice channel.
ru: Исключение, которое выбрасывается при ошибке во время попытки записи звука с голосового канала.

source: Exception thrown when an exception occurs with :class:`WaveSink`
ru: Исключение, возникающее при возникновении исключения в :class:`WaveSink`

source: Exception thrown when an exception occurs with :class:`MP3Sink`
ru: Исключение, возникающее при возникновении исключения в :class:`MP3Sink`

source: Exception thrown when an exception occurs with :class:`MP4Sink`
ru: Исключение, возникающее при возникновении исключения в :class:`MP4Sink`

source: Exception thrown when an exception occurs with :class:`M4ASink`
ru: Исключение, возникающее при возникновении исключения в :class:`M4ASink`

source: Exception thrown when an exception occurs with :class:`MKVSink`
ru: Исключение, возникающее при возникновении исключения в :class:`MKVSink`

source: Exception thrown when an exception occurs with :class:`MKASink`
ru: Исключение, возникающее при возникновении исключения в :class:`MKASink`

source: Exception thrown when an exception occurs with :class:`OGGSink`
ru: Исключение, возникающее при возникновении исключения в :class:`OGGSink`
