Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/api/sinks.po
Languages: ru

source: Core
ru: Ядро

source: Filters for :class:`~.Sink`
ru: Фильтры для :class:`~.Sink`

source: Parameters
ru: Параметры

source: Container of all Filters.
ru: Контейнер всех Фильтров.

source: A sink "stores" recorded audio data.
ru: Sink "хранит" записанные аудиоданные.

source: Can be subclassed for extra customizablilty.
ru: Может быть подклассом для дополнительной настройки.

source: It is recommended you use the officially provided sink classes, such as :class:`~discord.sinks.WaveSink`.
ru: Рекомендуется использовать официально предоставленные классы Sink, такие как :class:`~discord.sinks.WaveSink`.

source: just replace the following like so: ::
ru: просто замените это следующим образом: ::

source: Raises
ru: Вызывает

source: An invalid encoding type was specified.
ru: Был указан неверный тип кодировки.

source: Audio may only be formatted after recording is finished.
ru: Форматировать аудио можно только после завершения записи.

source: Gets all audio files.
ru: Получает все аудиофайлы.

source: Gets the audio file(s) of one specific user.
ru: Получает аудиофайл(ы) одного конкретного пользователя.

source: Handles data that's been completely decrypted and decoded and is ready to be saved to file.
ru: Работает с данными, которые были полностью расшифрованы и декодированы и готовы к сохранению в файл.

source: Writes audio data.
ru: Запись аудиоданных.

source: The AudioData is already finished writing.
ru: Запись AudioData уже завершена.

source: Finishes and cleans up the audio data.
ru: Завершает и очищает аудиоданные.

source: Called when audio data is formatted.
ru: Вызывается при форматировании аудиоданных.

source: The AudioData is still writing.
ru: AudioData продолжает писать.

source: Handles raw data from Discord so that it can be decrypted and decoded to be used.
ru: Обрабатывает необработанные данные из Discord, чтобы их можно было расшифровать и использовать.

source: Sink Classes
ru: Классы Sink

source: A special sink for .wav(wave) files.
ru: Специальный Sink для файлов .wav (wave).

source: Formats the recorded audio.
ru: Форматирует записанный звук.

source: Formatting the audio failed.
ru: Форматирование звука не удалось.

source: A special sink for .mp3 files.
ru: Специальный Sink для файлов .mp3.

source: A special sink for .mp4 files.
ru: Специальный Sink для файлов .mp4.

source: A special sink for .m4a files.
ru: Специальный Sink для файлов .m4a.

source: A special sink for .mkv files.
ru: Специальный Sink для файлов .mkv.

source: A special sink for .mka files.
ru: Специальный Sink для файлов .mka.

source: A special sink for .ogg files.
ru: Специальный Sink для файлов .ogg.
