Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/ext/tasks/index.po
Languages: fr

source: One of the most common operations when making a bot is having a loop run in the background at a specified interval. This pattern is very common but has a lot of things you need to look out for:
fr: L'une des opérations les plus courantes lors de la création d'un bot est d'avoir une boucle s'exécutant en arrière-plan à un intervalle spécifié. Ce modèle est très courant, mais présente de nombreux éléments auxquels il faut faire attention :

source: How do I handle :exc:`asyncio.CancelledError`?
fr: Comment gérer :exc:`asyncio.CancelledError` ?

source: What do I do if the internet goes out?
fr: Que faire si la connexion Internet est interrompue ?

source: What is the maximum number of seconds I can sleep anyway?
fr: Quelle est la durée maximale en secondes pendant laquelle je peux attendre avant d'annuler l'exécution ?

source: The goal of this Pycord extension is to abstract all these worries away from you.
fr: L'objectif de cette extension Pycord est d'abstraire toutes ces préoccupations pour vous.

source: Recipes
fr: Exemples

source: A simple background task in a :class:`~discord.ext.commands.Cog`:
fr: Une tâche en arrière-plan simple dans un :class:`~discord.ext.commands.Cog` :

source: Adding an exception to handle during reconnect:
fr: Ajouter une exception à gérer lors de la reconnexion :

source: Looping a certain amount of times before exiting:
fr: Boucler un certain nombre de fois avant de quitter :

source: Waiting until the bot is ready before the loop starts:
fr: Attendre que le bot soit prêt avant le début de la boucle :

source: Doing something during cancellation:
fr: Faire quelque chose pendant l'annulation :

source: API Reference
fr: Référence de l'API

source: A background task helper that abstracts the loop and reconnection logic for you.
fr: Un utilitaire pour les tâches en arrière-plan qui abstrait pour vous la logique de boucle et de reconnexion.

source: The main interface to create this is through :func:`loop`.
fr: L'interface principale pour créer ceci est à travers :func:`loop`.

source: Parameters
fr: Paramètres

source: A decorator that register a coroutine to be called after the loop finished running.
fr: Un décorateur qui enregistre une coroutine à appeler après l'exécution de la boucle.

source: The coroutine must take no arguments (except ``self`` in a class context).
fr: La coroutine ne doit prendre aucun argument (sauf ``self`` dans un contexte de classe).

source: This coroutine is called even during cancellation. If it is desirable to tell apart whether something was cancelled or not, check to see whether :meth:`is_being_cancelled` is ``True`` or not.
fr: Cette coroutine est appelée même en cas d'annulation. Si vous souhaitez distinguer si quelque chose a été annulé ou non, vérifiez si :meth:`is_being_cancelled` est ``True`` ou non.

source: The coroutine to register after the loop finishes.
fr: La coroutine à enregistrer après la fin de la boucle.

source: Raises
fr: Lève les exceptions suivantes

source: The function was not a coroutine.
fr: La fonction n'était pas une coroutine.

source: Return type
fr: Type de la valeur retournée

source: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~typing.TypeVar\`\\ \\\(\`\`FT\`\`\, bound\= \:py\:data\:\`\~typing.Callable\`\\ \\\[\:py\:data\:\`...\<Ellipsis\>\`\, \:py\:class\:\`\~typing.Awaitable\`\\ \\\[\:py\:data\:\`\~typing.Any\`\]\]\)`
fr: :sphinx_autodoc_typehints_type:`\:py\:class\:\`\~typing.TypeVar\`\\ \\\(\`\`\`\`\`\, bound\= \:py\:data\:\`\`\~typing.Callable\`\\\\\\\\[\:py\:data\:\`...\<Ellipsis\>\`\, \:py\:class\:\:\`\~typing.Awaitable\`\\\ \\[\:py\:data\:\:\:\`\~typing.Any\]\)\`

source: A decorator that registers a coroutine to be called before the loop starts running.
fr: Un décorateur qui enregistre une coroutine à appeler avant le début de l'exécution de la boucle.

source: This is useful if you want to wait for some bot state before the loop starts, such as :meth:`discord.Client.wait_until_ready`.
fr: Ceci est utile si vous voulez attendre un état du bot avant le début de la boucle, comme :meth:`discord.Client.wait_until_ready`.

source: The coroutine to register before the loop runs.
fr: La coroutine à enregistrer avant l'exécution de la boucle.

source: A decorator that registers a coroutine to be called if the task encounters an unhandled exception.
fr: Un décorateur qui enregistre une coroutine à appeler si la tâche rencontre une exception non gérée.

source: The coroutine must take only one argument the exception raised (except ``self`` in a class context).
fr: La coroutine ne doit prendre qu'un seul argument l'exception levée (sauf ``self`` dans un contexte de classe).

source: By default, this prints to :data:`sys.stderr` however it could be overridden to have a different implementation.
fr: Par défaut, cela imprime dans :data:`sys.stderr`, mais cela peut être remplacé par une autre implémentation.

source: The coroutine to register in the event of an unhandled exception.
fr: La coroutine à exécuter en cas d'exception non gérée.

source: Read-only value for the number of seconds between each iteration. ``None`` if an explicit ``time`` value was passed instead.
fr: Valeur en lecture seule représentant le nombre de secondes entre chaque itération. ``None`` si une valeur ``time`` explicite a été passée à la place.

source: Read-only value for the number of minutes between each iteration. ``None`` if an explicit ``time`` value was passed instead.
fr: Valeur en lecture seule représentant pour le nombre de minutes entre chaque itération. ``None`` si une valeur ``time`` explicite a été passée à la place.

source: Read-only value for the number of hours between each iteration. ``None`` if an explicit ``time`` value was passed instead.
fr: Valeur en lecture seule représentant pour le nombre d'heures entre chaque itération. ``None`` si une valeur ``time`` explicite a été passée à la place.

source: Read-only list for the exact times this loop runs at. ``None`` if relative times were passed instead.
fr: Liste en lecture seule des temps exacts auxquels cette boucle s'exécute. ``None`` si du temps relatifs a été passées a la place.

source: The current iteration of the loop.
fr: L'itération actuelle de la boucle.

source: When the next iteration of the loop will occur.
fr: Quand l'itération suivante de la boucle se produira.

source: Calls the internal callback that the task holds.
fr: Appelle la fonction de rappel interne que la tâche détient.

source: The arguments to use.
fr: Les arguments à utiliser.

source: The keyword arguments to use.
fr: Les arguments de mot-clé à utiliser.

source: Starts the internal task in the event loop.
fr: Démarre la tâche interne dans la boucle d'événement.

source: A task has already been launched and is running.
fr: Une tâche a déjà été lancée et est en cours d'exécution.

source: Returns
fr: Retours

source: The task that has been created.
fr: La tâche qui a été créée.

source: Gracefully stops the task from running.
fr: Empêche la tâche de s'exécuter proprement.

source: Unlike :meth:`cancel`\, this allows the task to finish its current iteration before gracefully exiting. :rtype: :sphinx_autodoc_typehints_type:`\:py\:obj\:\`None\``
fr: Contrairement à :meth:`cancel`\, cela permet à la tâche de terminer son itération actuelle avant de se terminer. :rtype: :sphinx_autodoc_typehints_type:`\:py\:obj\:\`None\``

source: If the internal function raises an error that can be handled before finishing then it will retry until it succeeds.
fr: Si la fonction interne lève une erreur pouvant être gérée avant la fin, elle sera réessayée jusqu'à ce qu'elle réussisse.

source: If this is undesirable, either remove the error handling before stopping via :meth:`clear_exception_types` or use :meth:`cancel` instead.
fr: Si cela est indésirable, soit retirez la gestion des erreurs avant d'arrêter via :meth:`clear_exception_types`, soit utilisez :meth:`cancel` à la place.

source: Cancels the internal task, if it is running.
fr: Annule la tâche interne si elle est en cours d'exécution.

source: A convenience method to restart the internal task.
fr: Une méthode pratique pour redémarrer la tâche interne.

source: Due to the way this function works, the task is not returned like :meth:`start`.
fr: En raison de la façon dont cette fonction fonctionne, la tâche n'est pas retournée comme :meth:`start`.

source: Adds exception types to be handled during the reconnect logic.
fr: Ajoute les types d'exception à traiter pendant la logique de reconnexion.

source: By default, the exception types handled are those handled by :meth:`discord.Client.connect`\, which includes a lot of internet disconnection errors.
fr: Par défaut, les types d'exceptions gérés sont ceux traités par :meth:`discord.Client.connect`, ce qui inclut de nombreux types d'erreurs de déconnexion Internet.

source: This function is useful if you're interacting with a 3rd party library that raises its own set of exceptions.
fr: Cette fonction est utile si vous interagissez avec une bibliothèque tierce qui augmente son propre ensemble d'exceptions.

source: An argument list of exception classes to handle.
fr: Une liste d'arguments de classes d'exception à gérer.

source: An exception passed is either not a class or not inherited from :class:`BaseException`.
fr: Une exception passée n'est soit pas une classe, soit elle n'est pas héritée de :class:`BaseException`.

source: Removes all exception types that are handled. :rtype: :sphinx_autodoc_typehints_type:`\:py\:obj\:\`None\``
fr: Supprime tous les types d'exception qui sont gérés. :rtype: :sphinx_autodoc_typehints_type:`\:py\:obj\:\:\`None\``

source: This operation obviously cannot be undone!
fr: Cette opération ne peut évidemment pas être annulée !

source: Removes exception types from being handled during the reconnect logic.
fr: Supprime les types d'exceptions qui ne sont pas gérés pendant la logique de reconnexion.

source: Whether all exceptions were successfully removed.
fr: Si toutes les exceptions ont bien été supprimées.

source: Fetches the internal task or ``None`` if there isn't one running.
fr: Récupère la tâche interne ou ``None`` s'il n'y en a pas.

source: Whether the task is being cancelled.
fr: Si la tâche est en cours d'annulation.

source: Whether the internal task has failed. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`bool\``
fr: Si la tâche interne a échoué. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`bool\``

source: Check if the task is currently running. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`bool\``
fr: Vérifie si la tâche est en cours d'exécution. :rtype: :sphinx_autodoc_typehints_type:`\:py\:class\:\`bool\``

source: Changes the interval for the sleep time.
fr: Modifie l'intervalle de temps de veille.

source: The number of seconds between every iteration.
fr: Le nombre de secondes entre chaque itération.

source: The number of minutes between every iteration.
fr: Le nombre de minutes entre chaque itération.

source: The number of hours between every iteration.
fr: Le nombre d'heures entre chaque itération.

source: The exact times to run this loop at. Either a non-empty list or a single value of :class:`datetime.time` should be passed. This cannot be used in conjunction with the relative time parameters. .. versionadded:: 2.0 .. note:: Duplicate times will be ignored, and only run once.
fr: Les heures exactes auxquelles exécuter cette boucle. Vous devez passer soit une liste non vide, soit une seule valeur de :class:`datetime.time`. Cela ne peut pas être utilisé en conjonction avec les paramètres de temps relatifs. .. versionadded:: 2.0 .. note:: Les heures dupliquées seront ignorées et exécutées une seule fois.

source: The exact times to run this loop at. Either a non-empty list or a single value of :class:`datetime.time` should be passed. This cannot be used in conjunction with the relative time parameters.
fr: Les heures exactes auxquelles exécuter cette boucle. Vous devez passer soit une liste non vide, soit une seule valeur de :class:`datetime.time`. Cela ne peut pas être utilisé en conjonction avec les paramètres de temps relatifs.

source: Duplicate times will be ignored, and only run once.
fr: Les doublons seront ignorés, et ne seront exécutés qu'une seule fois.

source: An invalid value was given.
fr: Une valeur non valide a été donnée.

source: An invalid value for the ``time`` parameter was passed, or the ``time`` parameter was passed in conjunction with relative time parameters.
fr: Une valeur invalide pour le paramètre ``time`` a été passée, ou le paramètre ``time`` a été passé en conjonction avec des paramètres de temps relatifs.

source: A decorator that schedules a task in the background for you with optional reconnect logic. The decorator returns a :class:`Loop`.
fr: Un décorateur qui planifie une tâche en arrière-plan pour vous avec une logique de reconnexion optionnelle. Le décorateur renvoie une :class:`Loop`.

source: The exact times to run this loop at. Either a non-empty list or a single value of :class:`datetime.time` should be passed. Timezones are supported. If no timezone is given for the times, it is assumed to represent UTC time. This cannot be used in conjunction with the relative time parameters. .. note:: Duplicate times will be ignored, and only run once. .. versionadded:: 2.0
fr: Les heures exactes auxquelles exécuter cette boucle. Vous devez passer soit une liste non vide, soit une seule valeur de :class:`datetime.time`. Les fuseaux horaires sont pris en charge. Si aucun fuseau horaire n'est spécifié pour les heures, il est supposé qu'elles représentent l'heure UTC. Cela ne peut pas être utilisé en conjonction avec les paramètres de temps relatifs. .. note:: Les heures dupliquées seront ignorées et exécutées une seule fois. .. versionadded:: 2.0

source: The exact times to run this loop at. Either a non-empty list or a single value of :class:`datetime.time` should be passed. Timezones are supported. If no timezone is given for the times, it is assumed to represent UTC time.
fr: Les heures exactes auxquelles exécuter cette boucle. Vous devez passer soit une liste non vide, soit une seule valeur de :class:`datetime.time`. Les fuseaux horaires sont pris en charge. Si aucun fuseau horaire n'est spécifié, il est supposé que les heures représentent l'heure UTC.

source: This cannot be used in conjunction with the relative time parameters.
fr: Ne peut pas être utilisé en conjonction avec les paramètres de temps relatifs.

source: The number of loops to do, ``None`` if it should be an infinite loop.
fr: Le nombre de boucles à faire, ``None`` si elle doit être une boucle infinie.

source: Whether to handle errors and restart the task using an exponential back-off algorithm similar to the one used in :meth:`discord.Client.connect`.
fr: Si vous voulez gérer les erreurs et redémarrer la tâche en utilisant un algorithme de back-off exponentiel similaire à celui utilisé dans :meth:`discord.Client.connect`.

source: The loop to use to register the task, if not given defaults to :func:`asyncio.get_event_loop`.
fr: La boucle à utiliser pour enregistrer la tâche, si elle n'est pas donnée par défaut à :func:`asyncio.get_event_loop`.

source: The function was not a coroutine, an invalid value for the ``time`` parameter was passed, or ``time`` parameter was passed in conjunction with relative time parameters.
fr: La fonction n'est pas une coroutine, une valeur invalide a été passée pour le paramètre ``time``, ou le paramètre ``time`` a été passé en conjonction avec des paramètres de temps relatifs.
