Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/cogs.po
Languages: es, ru

source: There comes a point in your bot's development when you want to organize a collection of commands, listeners, and some state into one class. Cogs allow you to do just that.
es: Llega un punto en el desarrollo de tu bot cuando quieres organizar una colección de comandos, oyentes y algún estado en una clase. Los cogs te permiten hacer exactamente eso.
ru: В процессе разработки бота наступает момент, когда вы хотите организовать набор команд, слушателей и некоторых состояний в один класс. Cogs позволяют вам сделать именно это.

source: The gist:
es: El gist:
ru: Суть:

source: Each cog is a Python class that subclasses :class:`.Cog`.
es: Cada cog es una clase de Python que hereda de :class:`.Cog`.
ru: Каждый cog - это класс Python, который является подклассом :class:`.Cog`.

source: Every command is marked with the :func:`discord.command` decorator or the corresponding shortcut command decorator.
es: Cada comando está marcado con el decorador :func:`discord.command` o el decorador de comandos atajo correspondiente.
ru: Каждая команда помечается декоратором :func:`discord.command` или соответствующим декоратором команды ярлыка.

source: Every listener is marked with the :meth:`.Cog.listener` decorator.
es: Cada oyente está marcado con el decorador :meth:`.Cog.listener`.
ru: Каждый слушатель помечается декоратором :meth:`.Cog.listener`.

source: Cogs are then registered with the :meth:`.Bot.add_cog` call.
es: Los cogs se registran con la llamada :meth:`.Bot.add_cog`.
ru: Затем Cogs регистрируются с помощью вызова :meth:`.Bot.add_cog`.

source: Cogs are subsequently removed with the :meth:`.Bot.remove_cog` call.
es: Los cogs se eliminan con la llamada :meth:`.Bot.remove_cog`.
ru: Впоследствии Cogs удаляются с помощью вызова :meth:`.Bot.remove_cog`.

source: Quick Example
es: Ejemplo rápido
ru: Быстрый пример

source: This example cog defines a ``Greetings`` category for your commands, with a single slash command named ``hello`` as well as a listener to listen to an :ref:`Event <discord-api-events>`.
es: Este ejemplo de cog define una categoría ``Greetings`` para tus comandos, con un solo comando de barra llamado ``hello`` así como un oyente para escuchar un :ref:`Event <discord-api-events>`.
ru: Этот пример cog определяет категорию ``Приветствия'' для ваших команд, с командой с одним слешем под названием ``hello'', а также слушатель для прослушивания :ref:`Event <discord-api-events>`.

source: A couple of technical notes to take into consideration:
es: Un par de notas técnicas a tener en cuenta:
ru: Несколько технических замечаний, которые следует принять во внимание:

source: All listeners must be explicitly marked via decorator, :meth:`~.Cog.listener`.
es: Todos los oyentes deben marcarse explícitamente a través de un decorador, :meth:`~.Cog.listener`.
ru: Все слушатели должны быть явно отмечены с помощью декоратора, :meth:`~.Cog.listener`.

source: The name of the cog is automatically derived from the class name but can be overridden.
es: El nombre del cog se deriva automáticamente del nombre de la clase pero se puede sobreescribir.
ru: Имя Cog автоматически выводится из имени класса, но может быть переопределено.

source: All commands must now take a ``self`` parameter to allow usage of instance attributes that can be used to maintain state.
es: Ahora todos los comandos deben tener un parámetro ``self`` para permitir el uso de atributos de la instancia que pueden ser usados para mantener el estado.
ru: Все команды теперь должны принимать параметр ``self'', чтобы позволить использовать атрибуты экземпляра, которые могут быть использованы для поддержания состояния.

source: Cog Registration
es: Registro de cogs
ru: Регистрация Cog

source: Once you have defined your cogs, you need to tell the bot to register the cogs to be used. We do this via the :meth:`~.Bot.add_cog` method.
es: Una vez que hayas definido tus cogs, necesitas decirle al bot que registre los cogs a usar. Hacemos esto mediante el método :meth:`~.Bot.add_cog`.
ru: После того как вы определили Cogs, вам нужно сообщить боту, чтобы он зарегистрировал Cogs для использования. Мы делаем это с помощью метода :meth:`~.Bot.add_cog`.

source: This binds the cog to the bot, adding all commands and listeners to the bot automatically.
es: Esto vincula el cog al bot, añadiendo todos los comandos y oyentes al bot automáticamente.
ru: Это связывает Cog с ботом, автоматически добавляя к нему все команды и слушателей.

source: Using Cogs
es: Uso de cogs
ru: Использование Cogs

source: Just as we remove a cog by its name, we can also retrieve it by its name as well. This allows us to use a cog as an inter-command communication protocol to share data. For example:
es: Del mismo modo que eliminamos un cog por su nombre, también podemos recuperarlo por su nombre. Esto nos permite usar un cog como un protocolo de comunicación entre comandos para compartir datos. Por ejemplo:
ru: Как мы удаляем Cogs по его имени, так же мы можем и получить его по его имени. Это позволяет нам использовать Cogs в качестве протокола межкомандной связи для обмена данными. Например:
