Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/discord.po
Languages: es, fr, ru, zh_cn

source: Creating a Bot Account
es: Crear una cuenta bot
fr: Création d'un compte de Bot
ru: Создание учётной записи бота
zh_cn: 创建一个Bot帐户

source: In order to work with the library and the Discord API in general, we must first create a Discord Bot account.
es: Para poder trabajar con la biblioteca y la API de Discord en general, primero debemos crear una cuenta de bot en Discord.
fr: Dans le but de travailler avec la bibliothèque et l'API de Discord en général, nous devons d'abord créer un compte de Bot Discord.
ru: Для того чтобы работать с библиотекой и Discord API в целом, мы должны сначала создать учетную запись бота Discord.
zh_cn: 为了与库和Discord API进行合作，我们必须先创建一个 Discord Bot 帐户。

source: Creating a Bot account is a pretty straightforward process.
es: Crear una cuenta de bot es un proceso bastante sencillo.
fr: Créer un compte de Bot est un processus plutôt simple.
ru: Создание учетной записи бота — это довольно простой процесс.
zh_cn: 创建一个Bot帐户是一个非常简单且直观的操作。

source: Make sure you're logged on to the `Discord website <https://discord.com>`_.
es: Asegúrate de haber iniciado sesión en el `sitio web de Discord <https://discord.com>`_.
fr: Assurez-vous d'être connecté au `site Discord <https://discord.com>`.
ru: Убедитесь, что вы вошли на сайте `Discord <https://discord.com>`_.
zh_cn: 请确保你已经登入了 `Discord网站<https://discord.com>`_。

source: Navigate to the `application page <https://discord.com/developers/applications>`_
es: Ve a la página de `aplicaciones <https://discord.com/developers/applications>`_
fr: Allez sur la `page application <https://discord.com/developpers/applications>`_
ru: Перейдите на `страницу приложений <https://discord.com/developers/applications>`_
zh_cn: 前往`应用程序页面 <https://discord.com/developers/applications>`_

source: Click on the "New Application" button.
es: Haz clic en el botón "New Application".
fr: Cliquez sur le bouton « New Application ».
ru: Нажмите на кнопку "New Application".
zh_cn: 点击 "New Application" 按钮。

source: The new application button.
es: El botón de nueva aplicación.
fr: Le bouton « New Application ».
ru: Кнопка нового приложения.
zh_cn: 新的应用程序按钮。

source: Give the application a name and click "Create".
es: Dale un nombre a la aplicación y haz clic en "Create".
fr: Donnez un nom à votre application et cliquez sur « Create ».
ru: Дайте приложению имя и нажмите "Создать".
zh_cn: 给予应用程序一个名字然后点击"Create"。

source: The new application form filled in.
es: El formulario de la nueva aplicación llenado.
fr: Le formulaire de création de nouvelle application rempli.
ru: Заполненная форма по созданию нового приложения.
zh_cn: 填写新的应用程序表格。

source: Create a Bot User by navigating to the "Bot" tab and clicking "Add Bot".
es: Crea un usuario de bot navegando a la pestaña "Bot" y haz clic en "Add Bot".
fr: Créer un bot en cliquant sur "Bot" puis sur "Ajouter un bot".
ru: Создайте бот пользователя, перейдя на вкладку "Bot" и нажав "Add Bot".
zh_cn: 通过导航到“Bot”选项卡点击“Add Bot” 以创建机器人用户。

source: Click "Yes, do it!" to continue.
es: Haz clic en "Yes, do it!" para continuar.
fr: Cliquez sur "Oui" pour continuer.
ru: Нажмите "Yes, do it!", чтобы продолжить.
zh_cn: 点击"Yes, do it!"继续

source: The Add Bot button.
es: El botón Añadir bot.
fr: Le bouton d'ajout de Bot.
ru: Кнопка Добавить бота.
zh_cn: 添加机器人按钮。

source: Make sure that **Public Bot** is ticked if you want others to invite your bot.
es: Asegúrate de que el **Public Bot** esté activado si quieres que otros inviten a tu bot.
fr: Assurez-vous que **Public Bot** est coché si vous souhaitez que d'autres personnes puissent inviter votre bot.
ru: Убедитесь, что флажок **Public Bot** установлен, если вы хотите, чтобы другие могли приглашать вашего бота.
zh_cn: 如果你想让其他人可以邀请你的机器人，请确保**Public Bot**选项已启用。

source: You should also make sure that **Require OAuth2 Code Grant** is unchecked unless you are developing a service that needs it. If you're unsure, then **leave it unchecked**.
es: También deberías asegurarte que **Require OAuth2 Code Grant** esté desactivado, a no ser que estés desarrollando un servicio que lo necesite. Si no estás seguro, entonces **mantenlo desactivado**.
fr: Vous devriez également vous assurer que la case **Require OAuth2 Code Grant** est décochée, sauf si vous développez un service qui le nécessite. Si vous n'êtes pas sûr, **laissez la case décochée**.
ru: Вам также следует убедиться, что флажок **Require OAuth2 Code Grant** снят, если только вы не разрабатываете сервис, которому это необходимо. Если вы не уверены, то **оставьте этот флажок снятым**.
zh_cn: 你还需要确保 **Require OAuth2 Code Grant** 是不启用的，除非你正在开发一个需要它的服务。如果你不确定是否要启用，则**让他处于不启用的状态**。

source: How the Bot User options should look like for most people.
es: Cómo se deberían ver las opciones de usuario Bot para la mayoría de las personas.
fr: A quoi les paramètres du Bot devraient ressembler pour la plupart des gens.
ru: Как должны выглядеть опции бот пользователя для большинства людей.
zh_cn: 对于大多数人来说，Bot 用户选项应该是什么样子。

source: Copy the token using the "Copy" button.
es: Copie el token usando el botón "Copy".
fr: Copiez le token en utilisant le bouton "copier".
ru: Скопируйте токен с помощью кнопки "Copy".
zh_cn: 透过使用"Copy"按钮复制令牌。

source: **This is not the Client Secret at the General Information page.**
es: **Este no es el Client Secret de la página de General Information.**
fr: **Il ne s'agit pas du token qui figure sur la page des informations générales.**
ru: **Это не Client Secret на странице Общей Информации.**
zh_cn: **这个并不是在General页面内的Client Secret**

source: It should be worth noting that this token is essentially your bot's password. You should **never** share this with someone else. In doing so, someone can log in to your bot and do malicious things, such as leaving servers, ban all members inside a server, or pinging everyone maliciously.
es: Vale la pena señalar que este token es esencialmente la contraseña de tu bot. **Nunca** deberías compartir esto con otra persona. Al hacerlo, alguien puede iniciar sesión en tu bot y realizar acciones maliciosas, como abandonar servidores, banear todos los miembros dentro de un servidor, o mencionar a everyone maliciosamente.
fr: Il est important de noter que ce token est le mot de passe de votre bot. Vous ne devez **jamais** le partager à qui que ce soit. En le partageant, quelqu'un pourrait se connecter à votre bot et réaliser des actions malveillantes avec celui-ci comme quitter certains serveurs, bannir des membres dans un serveur ou réaliser des mentions everyone avec des intentions malveillantes.
ru: Стоит отметить, что этот токен - фактически пароль вашего бота. Вы **никогда** не должны передавать его кому-либо еще. Это может привести к тому, что кто-то сможет войти в вашего бота и совершить вредоносные действия, например, покинуть серверы, забанить всех участников на сервере или злонамеренно пинговать всех подряд.
zh_cn: 需要注意的是，令牌就跟机器人的密码一样重要。你应该**永远不要**分享令牌给任何人。如果你分享了，则其他人可以登入你的机器人并且做一些怀有恶意的事情，例如说离开伺服器、停权在一个伺服器的所有使用者、或者是恶意艾特所有人。

source: The possibilities are endless, so **do not share this token.**
es: Las posibilidades son infinitas, así que **no compartas este token.**
fr: Les possibilités sont infinies donc **ne partagez pas ce token**.
ru: Варианты развития событий безграничны, поэтому **не делитесь этим токеном.**
zh_cn: 可能性是无限的，所以**请勿分享这个令牌**。

source: If you accidentally leaked your token, click the "Regenerate" button as soon as possible. This revokes your old token and re-generates a new one. Now you need to use the new token to login.
es: Si accidentalmente filtraste tu token, haz clic en el botón "Regenerate" tan pronto como puedas. Esto revoca tu viejo token y vuelve a generar uno nuevo. Ahora necesitas usar este nuevo token para iniciar sesión.
fr: Si vous avez fait fuiter accidentellement ce token, cliquez sur le bouton "Régénérer" dès que possible. Cela révoque votre ancien token et en génère un nouveau. Vous aurez alors besoins de ce nouveau token pour pouvoir vous connecter.
ru: В случае случайной утечки токена как можно скорее нажмите кнопку "Regenerate". Это отменит ваш старый токен и сгенерирует новый. Теперь вам нужно использовать новый токен для входа в систему.
zh_cn: 如果你不小心泄漏了你的令牌，请立刻点击"Regenerate"按钮。这将会撤销你旧有的令牌并且重新生成一个新的令牌。现在，你需要使用新的令牌进行登入。

source: And that's it. You now have a bot account and you can login with that token.
es: Y eso es todo. Ahora tienes una cuenta de bot y puedes iniciar sesión con ese token.
fr: Et c'est tout. Vous avez maintenant un compte de Bot et vous pouvez vous y connecter avec le jeton d'authentification.
ru: Вот и все. Теперь у вас есть учетная запись бота, и вы можете войти в систему с помощью этого токена.
zh_cn: 这样就结束了。你现在就拥有了一个机器人帐号而且可以透过令牌登入。

source: Inviting Your Bot
es: Invitar a tu bot
fr: Inviter Son Bot
ru: Приглашение Вашего Бота
zh_cn: 邀请你的机器人

source: So you've made a Bot User but it's not actually in any server.
es: Así que has creado un usuario de bot, pero en realidad no está en ningún servidor.
fr: Vous avez créé votre utilisateur Bot mais il n'est pas sur votre serveur.
ru: Итак, вы создали бот пользователя, но на самом деле его нет ни на одном сервере.
zh_cn: 你創建了一個機器人用戶，但是他並不存在於任何一個伺服器。

source: If you want to invite your bot you must create an invite URL for it.
es: Si quieres invitar a tu bot debes crear una URL de invitación para él.
fr: Si vous voulez inviter votre bot, vous devez créer un lien d'invitation.
ru: Если вы хотите пригласить вашего бота, вы должны создать ссылку-приглашение для него.
zh_cn: 如果你想邀请你的机器人，你需要创建一个邀请连结来邀请它。

source: Click on your bot's page.
es: Haz clic en la página de tu bot.
fr: Cliquez sur la page du Bot.
ru: Нажмите на страницу вашего бота.
zh_cn: 点击你的机器人的页面。

source: Expand the "OAuth2" tab and click on "URL Generator".
es: Expande la pestaña "OAuth2" y haz clic en "URL Generator".
fr: Dépliez l'onglet "OAuth2" et cliquez sur "URL Generator".
ru: Раскройте вкладку "OAuth2" и нажмите на "URL Generator".
zh_cn: 展开"OAuth2"的分页并且点击"URL Generator"。

source: How the OAuth2 tab should look like.
es: Cómo debería verse la pestaña OAuth2.
fr: A quoi l'onglet "OAuth2" doit ressembler.
ru: Как должна выглядеть вкладка OAuth2.
zh_cn: OAuth2 选项卡应该是什么样子。

source: Tick the "bot" and "applications.commands" checkboxes under "scopes".
es: Marca las casillas "bot" y "applications.commands" bajo "scopes".
fr: Sous "scopes", cochez les cases "bot" et "applications.commands".
ru: Установите флажки "bot" и "applications.commands" в разделе "scopes".
zh_cn: 在"scopes"分类底下勾选"bot"跟"applications.commands"两个选项。

source: The scopes checkbox with "bot" and "applications.commands" ticked.
es: Las casillas "bot" y "applications.commands" marcadas.
fr: "bot" et "applications.commands" cochés dans "scopes".
ru: Раздел scopes с установленными флажками "bot" и "applications.commands".
zh_cn: 勾选scopes区块内的"bot"跟"applications.commands"的勾选框。

source: Tick the permissions required for your bot to function under "Bot Permissions".
es: Selecciona los permisos necesarios para que tu bot funcione bajo "Bot Permissions".
fr: Cochez les permissions nécessaires pour le bon fonctionnement de votre bot sous "Bot Permissions".
ru: Установите разрешения, необходимые для работы вашего бота, в разделе "Bot Permissions".
zh_cn: 在"Bot Permissions"区块勾选你的机器人需要的权限。

source: Please be aware of the consequences of requiring your bot to have the "Administrator" permission.
es: Por favor, ten en cuenta las consecuencias de requerir que tu bot tenga el permiso de "Administrador".
fr: Prenez conscience des conséquences en demandant la permission "Administrateur".
ru: Учтите последствия, если вы потребуете для вашего бота разрешение "Администратор".
zh_cn: 请注意，您需要考虑要求您的机器人具备“管理员”权限的后果。

source: Bot owners must have 2FA enabled for certain actions and permissions when added in servers that have Server-Wide 2FA enabled. Check the `2FA support page <https://support.discord.com/hc/en-us/articles/219576828-Setting-up-Two-Factor-Authentication>`_ for more information.
es: Los propietarios de bots deben tener A2F habilitados para ciertas acciones y permisos cuando se agregan en servidores que tienen habilitado A2F. Consulta la `página de soporte de A2F <https://support.discord.com/hc/es/articles/219576828>`_ para más información.
fr: Les propriétaires de bots doivent activer l'authentification à deux facteurs (2FA) pour certaines actions et permissions lorsque leur bots sont ajoutés sur des serveurs où la 2FA est activée à l'échelle du serveur. Consultez la `page de support 2FA <https://support.discord.com/hc/fr/articles/219576828-Setting-up-Two-Factor-Authentication>`_ pour plus d'informations.
ru: Владельцы ботов должны иметь включенную 2FA для определенных действий и разрешений при добавлении на серверы, где включена серверная 2FA. Более подробную информацию можно найти на `странице поддержки 2FA <https://support.discord.com/hc/en-us/articles/219576828-Setting-up-Two-Factor-Authentication>`_.
zh_cn: 当机器人被邀请到有开启2FA伺服器的时候，机器人拥有者也必须开启2FA，机器人才可以进行一些特殊操作。\n查看`2FA支援页面<https://support.discord.com/hc/en-us/articles/219576828-Setting-up-Two-Factor-Authentication>`_了解更多资讯。

source: The permission checkboxes with some permissions checked.
es: Las casillas de permisos con algunos permisos marcados.
fr: Les cases à cocher des permissions avec quelques permissions cochées.
ru: Флажки разрешений, в которых установлены некоторые разрешения.
zh_cn: 被勾选部分权限的权限部分。

source: Now the resulting URL can be used to add your bot to a server. Copy and paste the URL into your browser, choose a server to invite the bot to, and click "Authorize".
es: Ahora la URL resultante puede ser usada para agregar tu bot a un servidor. Copia y pega la URL en tu navegador, elige un servidor al que invitar al bot, y haz clic en "Autorizar".
fr: Le lien résultant peut être utilisé pour ajouter votre bot à votre serveur. Copiez et collez le lien dans votre navigateur internet, choisissez le serveur sur lequel inviter votre bot et cliquez sur "Autoriser".
ru: Теперь полученный URL можно использовать для добавления бота на сервер. Скопируйте и вставьте URL в браузер, выберите сервер, на который хотите пригласить бота, и нажмите "Authorize".
zh_cn: 现在生成的 URL 可以用于将你的机器人添加到服务器。 复制并粘贴URL到您的浏览器，选择一个服务器邀请机器人并点击“授权”。

source: The person adding the bot needs "Manage Server" permissions to do so.
es: La persona que añade el bot necesita permisos de "Administrar Servidor" para hacerlo.
fr: La personne qui souhaite inviter le bot sur un serveur a besoin de la permission "Gérer le serveur" pour le faire.
ru: Человеку, добавляющему бота, нужны права "Управление сервером".
zh_cn: 添加机器人的人需要具有“管理服务器”的权限才能进行此操作。

source: If you want to generate this URL dynamically at run-time inside your bot and using the :class:`discord.Permissions` interface, you can use :func:`discord.utils.oauth_url`.
es: Si quieres generar esta URL dinámicamente en tiempo de ejecución dentro de tu bot y usando la interfaz :class:`discord.Permissions`, puedes usar :func:`discord.utils.oauth_url`.
fr: Si vous voulez générer ce lien dynamiquement avec votre bot pendant son exécution en utilisant l'interface :class:`discord.Permissions`, vous pouvez utiliser :func:`discord.utils.oauth_url`.
ru: Если вы хотите генерировать этот URL динамически во время выполнения внутри вашего бота и используя интерфейс :class:`discord.Permissions`, вы можете использовать :func:`discord.utils.oauth_url`.
zh_cn: 如果你想在运行时动态生成此 URL 并使用 :class: `discord.Permissions` 接口，你可以使用:func:`discord.utils.oauth_url`。
