Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/faq.po
Languages: es, ru

source: Discord special-cases uploading an image attachment and using it within an embed so that it will not display separately, but instead in the embed's thumbnail, image, footer or author icon.
es: Los casos especiales de Discord cargan una imagen adjunta y la usan dentro de una embed para que no se muestre por separado, sino en la thumbnail (miniatura) de la embed, imagen, el pie o el icono de autor.
ru: Discord специально обрабатывает загрузку вложения изображения и его использование внутри эмбеда, чтобы оно отображалось не отдельно, а в миниатюре, изображении, нижнем колонтитуле или иконке автора эмбеда.

source: To do so, upload the image normally with :meth:`abc.Messageable.send`, and set the embed's image URL to ``attachment://image.png``, where ``image.png`` is the filename of the image you will send.
es: Para hacerlo, adjunta una imagen normalmente con :meth:`abc.Messageable.send`, y establece la URL de la imagen a ``attachment://image.png``, donde ``image.png`` es el nombre de la imagen que vas a enviar.
ru: Для этого загрузите изображение обычным способом с помощью :meth:`abc.Messageable.send` и установите URL-адрес изображения эмбеда как ``attachment://image.png``, где ``image.png`` - это имя файла изображения, которое вы будете отправлять.

source: Is there an event for audit log entries being created?
es: ¿Hay un evento para la creación de registros de auditoría?
ru: Есть ли событие для создания записей журнала аудита?

source: As of version 2.5, you can receive audit log entries with the :func:`on_audit_log_entry` event.
es: A partir de la versión 2.5, puedes recibir entradas del registro de auditoría con el evento :func:`on_audit_log_entry`.
ru: Начиная с версии 2.5, вы можете получать записи журнала аудита с помощью события :func:`on_audit_log_entry`.

source: Commands Extension
es: Extensiones de comandos
ru: Расширение команд

source: Questions regarding ``discord.ext.commands`` belong here.
es: Las preguntas con respecto a ``discord.ext.commands`` pertenecen aquí.
ru: Здесь находятся вопросы, касающиеся ``discord.ext.commands``.

source: Why does ``on_message`` make my commands stop working?
es: ¿Por qué ``on_message`` hace que mis comandos dejen de funcionar?
ru: Почему ``on_message`` прекращает работу моих команд?

source: Overriding the default provided ``on_message`` forbids any extra commands from running. To fix this, add a ``bot.process_commands(message)`` line at the end of your ``on_message``. For example: ::
es: Sobrescribir el evento predeterminado ``on_message`` prohíbe a cualquier comando extra de ejecutarse. Para arreglar esto, añade ``bot.process_commands(message)`` al final de tu ``on_message``. Por ejemplo: ::
ru: Переопределение предоставленного по умолчанию ``on_message`` запрещает выполнение любых других команд. Чтобы исправить это, добавьте строку ``bot.process_commands(message)`` в конец вашего ``on_message``. Например: ::

source: Alternatively, you can place your ``on_message`` logic into a **listener**. In this setup, you should not manually call ``bot.process_commands()``. This also allows you to do multiple things asynchronously in response to a message. Example::
es: Como alternativa, puedes colocar la lógica de tu ``on_message`` en un **listener**. Con esta configuración, NO deberías llamar manualmente a ``bot.process_commands()``. Esto también te permite realizar múltiples cosas asincrónicamente en respuesta a un mensaje. Ejemplo::
ru: В качестве альтернативы вы можете поместить логику ``on_message`` в **listener**. При такой настройке не нужно вручную вызывать ``bot.process_commands()``. Это также позволяет выполнять несколько действий асинхронно в ответ на сообщение. Пример::

source: Why do my arguments require quotes?
es: ¿Por qué mis argumentos requieren comillas?
ru: Почему мои аргументы требуют кавычки?

source: In a simple command defined as: ::
es: En un simple comando definido como: ::
ru: В простой команде, определенной как: ::

source: Calling it via ``?echo a b c`` will only fetch the first argument and disregard the rest. To fix this you should either call it via ``?echo "a b c"`` or change the signature to have "consume rest" behaviour. Example: ::
es: Llamándolo a través de ``?echo a b c`` solo obtendrá el primer argumento e ignorará el resto. Para arreglar esto deberías llamar al comando a través de ``?echo "a b c"`` o cambiar la definición de tu comando para obtener un comportamiento "consumir al resto". Ejemplo: ::
ru: При вызове через ``?echo a b c``, будет получен только первый аргумент, а остальные будут проигнорированы. Чтобы исправить это, нужно либо вызвать его через ``?echo "a b c"``, либо изменить синтаксис так, чтобы она вела себя по принципу "потреблять остальное". Пример: ::

source: This will allow you to use ``?echo a b c`` without needing the quotes.
es: Esto te permitirá usar ``?echo a b c`` sin la necesidad de comillas.
ru: Это позволит вам использовать `` echo a b c`` без кавычек.

source: How do I get the original ``message``\?
es: ¿Cómo obtengo el ``mensaje`` original\?
ru: Как получить исходное ``message``\?

source: The :class:`~ext.commands.Context` contains an attribute, :attr:`~.Context.message` to get the original message.
es: El :class:`~ext.commands.Context` contiene el atributo :attr:`~.Context.message` para obtener el mensaje original.
ru: Класс :class:`~ext.commands.Context` содержит атрибут :attr:`~.Context.message` для получения исходного сообщения.

source: Example: ::
es: Ejemplo: ::
ru: Пример: ::

source: How do I make a subcommand?
es: ¿Cómo hago un subcomando?
ru: Как сделать подкоманду?

source: Use the :func:`~ext.commands.group` decorator. This will transform the callback into a :class:`~ext.commands.Group` which will allow you to add commands into the group operating as "subcommands". These groups can be arbitrarily nested as well.
es: Usa el decorador :func:`~ext.commands.group`. Esto transformará la retrollamada en una :class:`~ext.commands.Group` que te permitirá añadir comandos al grupo operando como un "subcomando". Estos grupos también pueden ser anidados arbitrariamente.
ru: Используйте декоратор :func:`~ext.commands.group`. Это преобразует обратный вызов в :class:`~ext.commands.Group`, что позволит вам добавлять команды в группу, работающую как "подкоманды". Эти группы также могут быть произвольно вложенными.

source: This could then be used as ``?git push origin master``.
es: Esto podría ser usado como ``?git push origin master``.
ru: Затем это может быть использовано как ``?git push origin master``.
