Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/faq.po
Languages: es, ru

source: Frequently Asked Questions
es: Preguntas frecuentes
ru: Часто Задаваемые Вопросы

source: This is a list of Frequently Asked Questions regarding using ``Pycord`` and its extension modules. Feel free to suggest a new question or submit one via pull requests.
es: Esta es una lista de preguntas frecuentes sobre el uso de ``Pycord`` y sus módulos de extensión. Siéntete libre de sugerir una nueva pregunta o envía una a través de una pull request.
ru: Это список Часто Задаваемых Вопросов относительно использования ``Pycord`` и его модулей расширений. Не стесняйтесь предложить новый вопрос или отправить пулл-реквесты.

source: Coroutines
es: Corutinas
ru: Короутины

source: Questions regarding coroutines and asyncio belong here.
es: Las preguntas sobre corutinas y asyncio pertenecen aquí.
ru: Здесь находятся вопросы, касающиеся короутинов и asyncio.

source: What is a coroutine?
es: ¿Qué es una corutina?
ru: Что такое короутина?

source: A |coroutine_link|_ is a function that must be invoked with ``await`` or ``yield from``. When Python encounters an ``await`` it stops the function's execution at that point and works on other things until it comes back to that point and finishes off its work. This allows for your program to be doing multiple things at the same time without using threads or complicated multiprocessing.
es: Una |coroutine_link|_ es una función que debe ser llamada con ``await`` o ``yield from``. Cuando Python se encuentra con un ``await``, se detiene la ejecución de la función en ese punto y se trabaja en otras cosas hasta que regresa a ese punto y termina su trabajo. Esto le permite a tu programa hacer múltiples cosas al mismo tiempo sin usar hilos o multiprocesamiento complicado.
ru: |coroutine_link|_ это функция, которая должна быть вызвана с ``await`` или ``yield from``. Когда Python сталкивается с ``await``, он останавливает выполнение функции в этой точке и работает над другими вещами, пока не вернется к этой точке и не завершит свою работу. Это позволяет вашей программе выполнять несколько действий одновременно без использования потоков или сложной многопроцессорной обработки.

source: **If you forget to await a coroutine then the coroutine will not run. Never forget to await a coroutine.**
es: **Si te olvidas de utilizar await en una corrutina, entonces ésta no funcionará. Nunca olvides utilizar await en una corutina.**
ru: **Если вы забудете написать await перед короутином, то короутин не выполнится. Никогда не забывайте await.**

source: Where can I use ``await``\?
es: ¿Dónde puedo usar ``await``\?
ru: Где можно использовать ``await``\?

source: You can only use ``await`` inside ``async def`` functions and nowhere else.
es: Solo puedes utilizar ``await`` dentro de funciones ``async def`` y en ningún otro lugar.
ru: Вы можете использовать ``await`` только внутри ``async def`` функций и нигде еще.

source: What does "blocking" mean?
es: ¿Qué significa "bloquear"?
ru: Что означает "блокирование"?

source: In asynchronous programming a blocking call is essentially all the parts of the function that are not ``await``. Do not despair however, because not all forms of blocking are bad! Using blocking calls is inevitable, but you must work to make sure that you don't excessively block functions. Remember, if you block for too long then your bot will freeze since it has not stopped the function's execution at that point to do other things.
es: En la programación asíncrona una llamada de bloqueo es esencialmente todas las partes de la función que no son ``await``. Sin embargo, no desesperes, porque no todas las formas de bloqueo son malas! Usar llamadas de bloqueo es inevitable, pero debes trabajar en asegurarte de no bloquear excesivamente las funciones. Recuerda, si bloqueas durante demasiado tiempo, tu bot se congelará ya que no ha detenido la ejecución de la función en ese momento para hacer otras cosas.
ru: В асинхронном программировании блокирующий вызов - это, по сути, все части функции, которые не являются ``await``. Однако не стоит отчаиваться, потому что не все формы блокировки плохи! Использование блокирующих вызовов неизбежно, но вы должны работать над тем, чтобы не блокировать функции чрезмерно. Помните, что если вы блокируете функцию слишком долго, то ваш бот зависнет, поскольку он не остановил выполнение функции в этот момент, чтобы заняться другими делами.

source: If logging is enabled, this library will attempt to warn you that blocking is occurring with the message: ``Heartbeat blocked for more than N seconds.`` See :ref:`logging_setup` for details on enabling logging.
es: Si activas el registro, esta biblioteca intentará advertirte de que un bloqueo está ocurriendo con el mensaje: ``Heartbeat blocked for more than N seconds.`` Puedes ver :ref:`logging_setup` para detalles sobre como activar el registro.
ru: Если логирование включено, библиотека попытается предупредить вас о блокирующем вызове с сообщением: ``Сердцебиение заблокировано более чем на N секунд.`` Подробности о включении логирования см. в :ref:`logging_setup``.

source: A common source of blocking for too long is something like :func:`time.sleep`. Don't do that. Use :func:`asyncio.sleep` instead. Similar to this example: ::
es: Una fuente común de bloqueo durante demasiado tiempo es algo como :func:`time.sleep`. No hagas eso. Utiliza :func:`asyncio.sleep` en su lugar. Similar a este ejemplo: ::
ru: Частым источником слишком долгой блокировки является что-то вроде :func:`time.sleep`. Не делайте этого. Вместо этого используйте :func:`asyncio.sleep`. Аналогично этому примеру: ::

source: Another common source of blocking for too long is using HTTP requests with the famous module :doc:`requests <req:index>`. While :doc:`requests <req:index>` is an amazing module for non-asynchronous programming, it is not a good choice for :mod:`asyncio` because certain requests can block the event loop too long. Instead, use the :doc:`aiohttp <aio:index>` library which is installed on the side with this library.
es: Otra fuente común de bloqueo durante demasiado tiempo es realizar peticiones HTTP con el famoso módulo :doc:`requests <req:index>`. Mientras que :doc:`requests <req:index>` es un asombroso módulo para la programación no asincrónica, no es una buena opción para :mod:`asyncio` porque ciertas peticiones pueden bloquear el loop de eventos por demasiado tiempo. En su lugar, usa el módulo :doc:`aiohttp <aio:index>` el cual viene instalado de lado con esta biblioteca.
ru: Другим распространенным источником слишком долгой блокировки является использование HTTP-запросов с известным модулем :doc:`requests <req:index>`. Хотя :doc:`requests <req:index>` - это замечательный модуль для неасинхронного программирования, он не является хорошим выбором для :mod:`asyncio`, поскольку некоторые запросы могут слишком долго блокировать цикл событий. Вместо него используйте библиотеку :doc:`aiohttp <aio:index>`, которая устанавливается на ряду с этой библиотекой.

source: Consider the following example: ::
es: Consideremos el siguiente ejemplo: ::
ru: Изучите следующий пример: ::

source: General
ru: Общее

source: General questions regarding library usage belong here.
es: Las preguntas generales sobre la biblioteca están aquí.
ru: Общие вопросы, касающиеся использования библиотеки, находятся здесь.

source: Where can I find usage examples?
es: ¿Dónde puedo encontrar ejemplos de uso?
ru: Где можно найти примеры использования?

source: Example code can be found in the `examples folder <https://github.com/Pycord-Development/pycord/tree/master/examples>`_ in the repository.
es: Puedes encontrar ejemplos de código en la `carpeta de ejemplos <https://github.com/Pycord-Development/pycord/tree/master/examples>`_ en el repositorio.
ru: Пример кода можно найти в папке `examples <https://github.com/Pycord-Development/pycord/tree/master/examples>`_ в репозитории.

source: How do I set the "Playing" status?
es: ¿Cómo establezco el estado "Jugando"?
ru: Как установить статус "Играет в"?

source: The ``activity`` keyword argument may be passed in the :class:`Client` constructor or :meth:`Client.change_presence`, given an :class:`Activity` object.
es: El argumento de palabra clave ``activity`` puede ser pasado en el constructor :class:`Client` o :meth:`Client.change_presence`, dado un objeto :class:`Activity`.
ru: Ключевой аргумент ``activity`` может быть передан в конструктор :class:`Client` или :meth:`Client.change_presence`, передавая объект :class:`Activity`.

source: The constructor may be used for static activities, while :meth:`Client.change_presence` may be used to update the activity at runtime.
es: El constructor puede ser usado para actividades estáticas, mientras que :meth:`Client.change_presence` puede ser usado para actualizar la actividad en tiempo de ejecución.
ru: Конструктор можно использовать для статичных активностей, а :meth:`Client.change_presence` можно использовать для обновления активности во время выполнения кода.

source: It is highly discouraged to use :meth:`Client.change_presence` or API calls in :func:`on_ready` as this event may be called many times while running, not just once.
es: No es para nada recomendable usar :meth:`Cliente.change_presence` o llamadas de API en :func:`on_ready` ya que este evento puede ser llamado muchas veces en tiempo de ejecución, no solo una vez.
ru: Крайне не рекомендуется использовать :meth:`Client.change_presence` или вызовы API в :func:`on_ready`, так как это событие может быть вызвано много раз во время работы, а не только один раз.

source: There is a high chance of disconnecting if presences are changed right after connecting.
es: Existe una gran probabilidad de desconexión si las presencias son cambiadas justo después de conectarse.
ru: Высока вероятность отключения, если сменить статус активности сразу после подключения.

source: The status type (playing, listening, streaming, watching) can be set using the :class:`ActivityType` enum. For memory optimisation purposes, some activities are offered in slimmed-down versions:
es: El tipo de estado (jugando, escuchando, streaming, viendo) puede ser establecido usando el enum :class:`ActivityType`. Por motivos de optimización de memoria, algunas actividades son ofrecidas en versiones reducidas:
ru: Тип статуса (играет в, слушает, стримит, смотрит) можно задать с помощью перечисления :class:`ActivityType`. Для оптимизации памяти некоторые действия предлагаются в урезанных версиях:

source: Putting both of these pieces of info together, you get the following: ::
es: Al juntar estas dos piezas de información, obtenemos lo siguiente: ::
ru: Если объединить два этих раздела информации, то получится следующее: ::

source: How do I send a message to a specific channel?
es: ¿Cómo puedo enviar un mensaje a un canal en específico?
ru: Как отправить сообщение в определенный канал?

source: You must fetch the channel directly and then call the appropriate method. Example: ::
es: Debemos obtener el canal directamente y luego llamar al método apropiado. Ejemplo: ::
ru: Вы должны получить канал напрямую и затем вызвать соответствующий метод. Пример: ::

source: How do I send a DM?
es: ¿Cómo envío un mensaje directo?
ru: Как отправить ЛС?

source: Get the :class:`User` or :class:`Member` object and call :meth:`abc.Messageable.send`. For example: ::
es: Obtén una instancia de :class:`User` o :class:`Member` y llama al método :meth:`abc.Messageable.send`. Por ejemplo: ::
ru: Получите объект :class:`User` или :class:`Member` и вызовите :meth:`abc.Messageable.send`. Например: ::

source: If you are responding to an event, such as :func:`on_message`, you already have the :class:`User` object via :attr:`Message.author`: ::
es: Si estás respondiendo a un evento, como :func:`on_message`, ya posees el objeto :class:`User` a través de :attr:`Message.author`: ::
ru: Если вы отвечаете на событие, например :func:`on_message`, у вас уже есть объект `User` :class: через :attr:`Message.author`: ::

source: How do I get the ID of a sent message?
es: ¿Cómo obtengo el ID de un mensaje enviado?
ru: Как получить ID отправленного сообщения?

source: :meth:`abc.Messageable.send` returns the :class:`Message` that was sent. The ID of a message can be accessed via :attr:`Message.id`: ::
es: :meth:`abc.Messageable.send` retorna el :class:`Message` que fue enviado. Puedes acceder al ID del mensaje a través de :attr:`Message.id`: ::
ru: :meth:`abc.Messageable.send` возвращает отправленное сообщение :class:`Message`. ID сообщения можно получить через :attr:`Message.id`: ::

source: How do I upload an image?
es: ¿Cómo puedo adjuntar una imagen?
ru: Как загрузить изображение?

source: To upload something to Discord you have to use the :class:`File` object.
es: Para adjuntar un archivo a Discord, tienes que utilizar una instancia de :class:`File`.
ru: Чтобы загрузить что-то в Discord, вы должны использовать объект :class:`File`.

source: A :class:`File` accepts two parameters, the file-like object (or file path) and the filename to pass to Discord when uploading.
es: La clase :class:`File` acepta dos parámetros, un objeto tipo archivo (o la ruta de este) y el nombre del archivo a pasar a Discord al momento de subirlo.
ru: :class:`File` принимает два параметра: файловый объект (или путь к файлу) и имя файла, передаваемого в Discord при загрузке.

source: If you want to upload an image it's as simple as: ::
es: Si quieres subir una imagen, es tan simple como: ::
ru: Если вы хотите загрузить изображение, это просто: ::

source: If you have a file-like object you can do as follows: ::
es: Si tienes un objeto tipo archivo, puedes hacer lo siguiente: ::
ru: Если у вас есть файловый объект, вы можете сделать следующее: ::

source: To upload multiple files, you can use the ``files`` keyword argument instead of ``file``\: ::
es: Para subir varios archivos, puedes utilizar el argumento de palabra clave ``files`` en lugar de ``file``\: ::
ru: Чтобы загрузить несколько файлов, вы можете использовать именованный аргумент ``files`` вместо ``file``\: ::

source: If you want to upload something from a URL, you will have to use an HTTP request using :doc:`aiohttp <aio:index>` and then pass an :class:`io.BytesIO` instance to :class:`File` like so:
es: Si quiere subir algo desde una URL, tendrás que realizar una petición HTTP utilizando :doc:`aiohttp <aio:index>` y luego pasar una instancia de :class:`io.BytesIO` a la clase :class:`File`. Tal que así:
ru: Если вы хотите загрузить что-то с URL, вам необходимо использовать HTTP-запрос с помощью :doc:`aiohttp <aio:index>`, а затем передать экземпляр :class:`io.BytesIO` в :class:`File`, как показано ниже:

source: How can I add a reaction to a message?
es: ¿Cómo puedo añadir una reacción a un mensaje?
ru: Как добавить реакцию на сообщение?

source: You use the :meth:`Message.add_reaction` method.
es: Utiliza el método :meth:`Message.add_reaction`.
ru: Используйте метод :meth:`Message.add_reaction`.

source: If you want to use unicode emoji, you must pass a valid unicode code point in a string. In your code, you can write this in a few different ways:
es: Si quieres usar emojis unicode, debes pasar un unicode válido en una cadena. En tu código, puedes escribir esto de varias maneras diferentes:
ru: Если вы хотите использовать эмодзи unicode, вы должны передать в строке действительный код unicode эмодзи. В коде это можно записать несколькими разными способами:

source: Quick example: ::
es: Ejemplo rápido: ::
ru: Быстрый пример: ::

source: In case you want to use emoji that come from a message, you already get their code points in the content without needing to do anything special. You **cannot** send ``':thumbsup:'`` style shorthands.
es: En caso de que quieras usar emojis que vienen de un mensaje, ya obtienes sus puntos de código en el contenido sin necesidad de hacer nada especial. **No puedes** enviar abreviaturas de estilo ``':thumbsup:'```.
ru: Если вы хотите использовать эмодзи, полученные из сообщения, вы уже получите их код в содержимом без необходимости что-то делать. Вы **не можете** отправлять сокращения в стиле ``':thumbsup:'``.

source: For custom emoji, you should pass an instance of :class:`Emoji`. You can also pass a ``'<:name:id>'`` string, but if you can use said emoji, you should be able to use :meth:`Client.get_emoji` to get an emoji via ID or use :func:`utils.find`/ :func:`utils.get` on :attr:`Client.emojis` or :attr:`Guild.emojis` collections.
es: Para emojis personalizados, debes pasar una instancia de :class:`Emoji`. También puedes pasar un string del tipo ``'<:nombre:id>'``, pero si puedes usar dicho emoji, deberías poder usar el método :meth:`Client.get_emoji` para obtener un emoji a través de su ID. Como alternativa, puedes utilizar :func:`utils.find`/ :func:`utils.get` sobre las colecciones de :attr:`Client.emojis` o :attr:`Guild.emojis`.
ru: Для пользовательских эмодзи вы должны передать экземпляр :class:`Emoji`. Вы также можете передать строку ``'<:name:id>'``, а если вы можете использовать указанные эмодзи, вы можете использовать :meth:`Client.get_emoji` для получения эмодзи по ID или использовать :func:`utils.find`/ :func:`utils.get` на коллекциях :attr:`Client.emojis` или :attr:`Guild.emojis`.

source: The name and ID of a custom emoji can be found with the client by prefixing ``:custom_emoji:`` with a backslash. For example, sending the message ``\:python3:`` with the client will result in ``<:python3:232720527448342530>``.
es: El nombre y ID de un emoji personalizado puede ser encontrado en Discord añadiendo a ``:custom_emoji:`` una barra invertida. Por ejemplo, al enviar el mensaje ``\:python3:`` en Discord, el resultado será ``<:python3:232720527448342530>``.
ru: Имя и ID пользовательского эмодзи можно узнать в клиенте, добавив к ``:custom_emoji:`` обратный слэш. Например, отправив сообщение ``\:python3:`` через клиент, вы получите ``<:python3:232720527448342530>``.

source: How do I pass a coroutine to the player's "after" function?
es: ¿Cómo puedo pasar una corrutina a la función "after" del reproductor?
ru: Как передать короутин в функцию "after" плеера?

source: The library's music player launches on a separate thread, ergo it does not execute inside a coroutine. This does not mean that it is not possible to call a coroutine in the ``after`` parameter. To do so you must pass a callable that wraps up a couple of aspects.
es: El reproductor de música de la biblioteca se lanza en un hilo separado, por consecuencia, no se ejecuta dentro de una corrutina. Esto no significa que no es posible llamar una corrutina en el parámetro ``after``. Para hacerlo debes pasar un callable que contenga un par de aspectos.
ru: Музыкальный плеер библиотеки запускается в отдельном потоке, поэтому он не выполняется внутри короутина. Это не означает, что нельзя вызвать короутин в параметре ``after``. Для этого необходимо передать доступный для вызова объект, который включает в себя несколько моментов.

source: The first gotcha that you must be aware of is that calling a coroutine is not a thread-safe operation. Since we are technically in another thread, we must take caution in calling thread-safe operations so things do not bug out. Luckily for us, :mod:`asyncio` comes with a :func:`asyncio.run_coroutine_threadsafe` function that allows us to call a coroutine from another thread.
es: De lo primero que debes ser consciente es que llamar a una corrutina no es una operación segura en hilos. Puesto que estamos en otro hilo, debemos tomar precaución al llamar operaciones seguras en hilos así las cosas no fallan. Para nuestra suerte, :mod:`asyncio` viene con la función :func:`asyncio.run_coroutine_threadsafe` que nos permite llamar a una corrutina desde otro hilo.
ru: Первый момент, о котором вы должны знать, заключается в том, что вызов короутина не является потокобезопасной операцией. Поскольку технически мы находимся в другом потоке, мы должны быть осторожны в вызове потокобезопасных операций, чтобы не допустить ошибок. К счастью для нас, :mod:`asyncio` имеет функцию :func:`asyncio.run_coroutine_threadsafe`, которая позволяет нам вызывать короутин из другого потока.

source: However, this function returns a :class:`~concurrent.futures.Future` and to actually call it we have to fetch its result. Putting all of this together we can do the following: ::
es: Sin embargo, esta función devuelve un :class:`~concurrent.futures.Future` y para llamarlo tenemos que obtener su resultado. Poniendo todo esto junto podemos hacer lo siguiente: ::
ru: Однако эта функция возвращает :class:`~concurrent.futures.Future`, и чтобы вызвать его, мы должны получить ее результат. Сложив все это вместе, мы можем сделать следующее: ::

source: How do I run something in the background?
es: ¿Cómo puedo ejecutar algo en segundo plano?
ru: Как выполнять что-то в фоновом режиме?

source: `Check the background_task.py example. <https://github.com/Pycord-Development/pycord/blob/master/examples/background_task.py>`_
es: `Comprueba el ejemplo background_task.py. <https://github.com/Pycord-Development/pycord/blob/master/examples/background_task.py>`_
ru: `Посмотрите пример background_task.py. <https://github.com/Pycord-Development/pycord/blob/master/examples/background_task.py>`_

source: How do I get a specific model?
es: ¿Cómo obtengo un modelo en específico?
ru: Как получить конкретную модель?

source: There are multiple ways of doing this. If you have a specific model's ID then you can use one of the following functions:
es: Hay varias maneras de hacer esto. Si tienes un ID de un modelo en específico entonces puedes usar una de las siguientes funciones:
ru: Есть несколько способов сделать это. Если у вас есть ID конкретной модели, вы можете использовать одну из следующих функций:

source: The following use an HTTP request:
es: Lo siguiente usa una solicitud HTTP:
ru: Следующие функции используют HTTP-запрос:

source: If the functions above do not help you, then use of :func:`utils.find` or :func:`utils.get` would serve some use in finding specific models.
es: Si las funciones anteriores no te ayudan, entonces usa :func:`utils.find` o :func:`utils.get` para encontrar modelos específicos.
ru: Если приведенные выше функции вам не помогли, то использование :func:`utils.find` или :func:`utils.get` будет полезно для поиска конкретных моделей.

source: How do I make a web request?
es: ¿Cómo hago una petición web?
ru: Как сделать веб-запрос?

source: To make a request, you should use a non-blocking library. This library already uses and requires a 3rd party library for making requests, :doc:`aiohttp <aio:index>`.
es: Para hacer una solicitud, deberás usar una librería sin bloqueo. Esta biblioteca ya usa y requiere una librería de terceros para hacer peticiones, :doc:`aiohttp <aio:index>`.
ru: Для выполнения запроса необходимо использовать неблокирующую библиотеку. Эта библиотека уже использует и требует стороннюю библиотеку для выполнения запросов, :doc:`aiohttp <aio:index>`.

source: See `aiohttp's full documentation <http://aiohttp.readthedocs.io/en/stable/>`_ for more information.
es: Véase la `documentación completa de aiohttp <http://aiohttp.readthedocs.io/en/stable/>`_ para más información.
ru: Более подробную информацию можно найти в полной документации по `aiohttp <http://aiohttp.readthedocs.io/en/stable/>`_.

source: How do I use a local image file for an embed image?
es: ¿Cómo uso una imagen local para una imagen en una embed?
ru: Как использовать локальный файл изображения в качестве изображения для эмбеда?
