Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/index.po
Languages: de, es, ko, ru

source: Extensions
de: Erweiterungen
es: Extensiones
ko: 확장
ru: Расширения

source: Meta
ko: 메타

source: Welcome to Pycord
de: Willkommen bei Pycord
es: Bienvenido a Pycord
ko: Pycord에 오신 것을 환영합니다
ru: Добро пожаловать в Pycord

source: Pycord is a modern, easy to use, feature-rich, and async ready API wrapper for Discord.
de: Pycord ist ein moderner, einfach zu bedienender, funktionsreicher und asynchroner API-Wrapper für Discord.
es: Pycord es un empaquetador de la API de Discord moderno, fácil de usar y asíncrono.
ko: Pycord는 사용하기 쉽고, 기능이 풍부하고, 비동기를 지원하는 최신 Discord API 래퍼입니다.
ru: Pycord - современный, легкий в использовании, многофункциональный и асинхронный API-враппер для Discord.

source: **Features:**
de: **Eigenschaften:**
es: **Características:**
ko: **특징:**
ru: **Возможности:**

source: Modern Pythonic API using ``async``\/``await`` syntax
de: Moderne Pythonische API mit ``async``\/``await`` Syntax
es: API moderna y pitónica usando la sintaxis ``async``\/``await``
ko: ``async``\/``await`` 구문 등 Python에 걸맞는 최신 API
ru: Современный Pythonic API, использующий синтаксис ``async``\/``await``

source: Sane rate limit handling that prevents 429s
de: Vernünftige Rate Limit-Handhabung, die 429s verhindert
es: Manejo sano de los límites que previene 429s
ko: 429 오류를 방지하는 알맞은 속도 제한
ru: Разумная обработка ограничений скорости, предотвращающая 429s

source: Command extension to aid with bot creation
de: Befehlsverlängerung zur Unterstützung bei der Bot-Erstellung
es: Extensión de comandos para ayudar a la creación de bots
ko: 봇 제작을 거들어 주는 명령어 확장
ru: Расширения с командами для помощи в создании ботов

source: Easy to use with an object oriented design
de: Einfach zu bedienen mit objektorientiertem Design
es: Fácil de usar con un diseño orientado a objetos
ko: 객체 지향 설계로 사용이 쉬움
ru: Легкий в использовании с объектно-ориентированным дизайном

source: Optimised for both speed and memory
de: Optimiert für Geschwindigkeit und Speicher
es: Optimizado para velocidad y memoria
ko: 속도와 메모리 둘 다 최적화됨
ru: Оптимизирован как для скорости, так и для памяти

source: Getting started
de: Erste Schritte
es: Comenzando
ko: 시작하기
ru: Начало работы

source: Is this your first time using the library? This is the place to get started!
de: Nutzen Sie die Bibliothek zum ersten Mal? Dies ist der Ort, an dem Sie loslegen können!
es: ¿Es tu primera vez utilizando la librería? ¡Este es el lugar para empezar!
ko: 이 라이브러리를 처음 써 보시나요? 여기서부터 시작해 보세요!
ru: Первый раз пользуетесь библиотекой? Это место, чтобы начать!

source: **First steps:** :doc:`installing` | :doc:`quickstart` | :doc:`logging` | :resource:`Guide <guide>`
de: **Erste Schritte:** :doc:`installing` | :doc:`quickstart` | :doc:`logging` | :resource:`Guide <guide>`
es: **Primeros pasos:** :doc:`installing` | :doc:`quickstart` | :doc:`logging` | :resource:`Guía <guide>`
ko: **첫걸음:** :doc:`installing` | :doc:`quickstart` | :doc:`logging` | :resource:`가이드 <guide>`
ru: **Первые шаги:** :doc:`installing` | :doc:`quickstart` | :doc:`logging` | :resource:`Guide <guide>`

source: **Working with Discord:** :doc:`discord` | :doc:`intents`
de: **Arbeiten mit Discord:** :doc:`discord` | :doc:`intents`
es: **Trabajando con Discord:** :doc:`discord` | :doc:`intents`
ko: **Discord 작업:** :doc:`discord` | :doc:`intents`
ru: **Работа с Discord:** :doc:`discord` | :doc:`intents`

source: **Examples:** Many examples are available in the :resource:`repository <examples>`.
de: **Beispiele:** Viele Beispiele sind in der :resource:`repository <examples>` verfügbar.
es: **Ejemplos:** Muchos ejemplos se encuentran en nuestro :resource:`repositorio <examples>`.
ko: **예시:** :resource:`리포지토리 <examples>`에서 각종 예시들을 찾아보실 수 있습니다..
ru: **Примеры:** Множество примеров доступно в :resource:`repository <examples>`.

source: Getting help
de: Hilfe erhalten
es: Obtener ayuda
ko: 도움 받기
ru: Получение помощи

source: If you're having trouble with something, these resources might help.
de: Wenn Sie Probleme mit etwas haben, könnten diese Ressourcen helfen.
es: Si presentas problemas con algo, estos recursos podrían ayudarte.
ko: 문제를 겪고 있다면 다음 자료들이 도움이 될 수 있습니다.
ru: Если у вас что-то не получается, эти ресурсы могут вам помочь.

source: Try the :doc:`faq` first, it's got answers to all common questions.
de: Probieren Sie zuerst die :doc:`faq` aus, sie hat Antworten auf alle gängigen Fragen.
es: Prueba a revisar las :doc:`faq` primero, contiene respuestas a preguntas comunes.
ko: 우선 :doc:`faq` 문서를 읽어 보세요. 흔히 묻는 질문들에 대한 답이 전부 있습니다.
ru: Попробуйте сначала :doc:`faq`, там есть ответы на все распространенные вопросы.

source: Ask us and hang out with us in our :resource:`Discord <discord>` server.
de: Fragen Sie uns und bleiben Sie bei uns in unserem :resource:`Discord <discord>` Server.
es: Pregúntanos y pasa el rato con nosotros en nuestro servidor de :resource:`Discord <discord>`.
ko: :resource:`Discord <discord>` 서버에서 문의하거나, 함께 시간을 보내 보세요.
ru: Спрашивайте и общайтесь с нами на нашем сервере :resource:`Discord <discord>`.

source: If you're looking for something specific, try the :ref:`index <genindex>` or :ref:`searching <search>`.
de: Wenn Sie etwas Konkretes suchen, probieren Sie den :ref:`Index <genindex>` oder :ref:`Suche <search>`.
es: Si estás buscando algo en específico, prueba el :ref:`índice <genindex>` o el :ref:`buscador <search>`.
ko: 특정한 무언가를 찾고 계시면, :ref:`색인 <genindex>`이나 :ref:`검색 페이지 <search>`를 살펴보세요.
ru: Если вы ищете что-то конкретное, попробуйте использовать :ref:`index <genindex>` или :ref:`searching <search>`.

source: Report bugs in the :resource:`issue tracker <issues>`.
de: Melde Fehler im :resource:`Issue-Tracker <issues>`.
es: Reporta bugs en nuestro :resource:`issue tracker <issues>`.
ko: :resource:`이슈 트래커 <issues>`에 버그를 알려 주세요.
ru: Сообщайте об ошибках в :resource:`issue tracker <issues>`.

source: Manuals
de: Anleitungen
es: Manuales
ko: 매뉴얼
ru: Руководства

source: These pages go into great detail about everything the API can do.
de: Diese Seiten gehen sehr detailliert auf alles, was die API tun kann.
es: Estas páginas entran en gran detalle sobre todo lo que la API puede hacer.
ko: 다음 페이지들에서는 API로 가능한 모든 것을 아주 상세하게 설명합니다.
ru: На этих страницах подробно описаны все возможности API.

source: Core API
es: Núcleo de la API
ko: 핵심 API

source: These extensions help you during development when it comes to common tasks.
de: Diese Erweiterungen helfen Ihnen bei der Entwicklung, wenn es um allgemeine Aufgaben geht.
es: Estas extensiones te ayudan durante el desarrollo cuando se trata de tareas comunes.
ko: 아래 확장들은 개발 중 자주 이뤄지는 작업들을 진행하는 데 도움을 줍니다.
ru: Эти расширения помогут вам в процессе разработки, когда речь идет об обычных задачах.

source: :doc:`ext/commands/index` - Bot commands framework
de: :doc:`ext/commands/index` - Bot Befehle Framework
es: :doc:`ext/commands/index` - Framework para comandos del bot
ko: :doc:`ext/commands/index` - 봇 명령어 프레임워크
ru: :doc:`ext/commands/index` - Система команд для ботов

source: :doc:`ext/tasks/index` - asyncio.Task helpers
de: :doc:`ext/tasks/index` - asyncio.Task-Helfer
es: :doc:`ext/tasks/index` - Ayudantes de asyncio.Task
ko: :doc:`ext/tasks/index` - asyncio.Task 보조 도구
ru: :doc:`ext/tasks/index` - Помощники asyncio.Task

source: :doc:`ext/pages/index` - A pagination extension module
de: :doc:`ext/pages/index` - Ein Modul zur Seitenerweiterung
es: :doc:`ext/pages/index` - Un módulo extensión para paginación
ko: :doc:`ext/pages/index` - 페이지네이션 확장 모듈
ru: :doc:`ext/pages/index` - Модуль пагинации

source: :doc:`ext/bridge/index` - A module that bridges slash commands to prefixed commands
de: :doc:`ext/bridge/index` - Ein Modul, das Schrägstrich Befehle zu vordefinierten Befehlen überbrückt
es: :doc:`ext/bridge/index` - Módulo que enlaza los comandos de barra y comandos de chat
ko: :doc:`ext/bridge/index` - 빗금 명령어와 채팅 명령어를 서로 잇는 모듈
ru: :doc:`ext/bridge/index` - Модуль, соединяющий слеш-команды и команды с префиксом

source: If you're looking for something related to the project itself, it's here.
de: Wenn Sie nach etwas suchen, das mit dem Projekt selbst zusammenhängt, dann ist es hier.
es: Si estás buscando algo relacionado con el proyecto en sí, está aquí.
ko: 여기에서 이 프로젝트에 대한 내용을 찾아보실 수 있습니다.
ru: Если вы ищете что-то, связанное с самим проектом, то это здесь.

source: :doc:`changelog` - The changelog for the library.
de: :doc:`changelog` - Der Changelog für die Bibliothek.
es: :doc:`changelog` - El registro de cambios para la librería.
ko: :doc:`changelog` - 라이브러리 변경 기록
ru: :doc:`changelog` - Журнал изменений библиотеки.

source: :doc:`version_guarantees` - The version guarantees for the library.
de: :doc:`version_guarantees` - Die Version garantiert für die Bibliothek.
es: :doc:`version_guarantees` - Las garantías de versionado de la librería.
ko: :doc:`version_guarantees` - 라이브러리의 버전에 대한 보증
ru: :doc:`version_guarantees`- Гарантии версии библиотеки.

source: :doc:`migrating_to_v1` - How to migrate from v0.x to v1.x.
de: :doc:`migrating_to_v1` - Wie man von v0.x nach v1.x migriert.
es: :doc:`migrating_to_v1` - Cómo migrar de v0.x a v1.x.
ko: :doc:`migrating_to_v1` - v0.x에서 v1.x으로 마이그레이션하는 방법
ru: :doc:`migrating_to_v1` - Как мигрировать с версии 0.x на версию 1.x.

source: :doc:`migrating_to_v2` - How to migrate from v1.x to v2.x.
de: :doc:`migrating_to_v2` - Wie man von v1.x nach v2.x migriert.
es: :doc:`migrating_to_v2` - Cómo migrar de v1.x a v2.x.
ko: :doc:`migrating_to_v2` - v1.x에서 v2.x으로 마이그레이션하는 방법
ru: :doc:`migrating_to_v2` - Как мигрировать с версии 1.x на версию 2.x.
