Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/installing.po
Languages: de, es, ko, pt_br, ru, zh_cn

source: Installing Pycord
de: Pycord installieren
es: Instalación de Pycord
ko: Pycord 설치하기
pt_br: Instalando o Pycord
ru: Установка Pycord
zh_cn: 安装Pycord

source: This is the documentation for Pycord, a library for Python to aid in creating applications that utilise the Discord API.
de: Dies ist die Dokumentation für Pycord, eine Bibliothek für Python, die bei der Erstellung von Anwendungen hilft, die die Discord API verwenden.
es: Esta es la documentación para Pycord, una biblioteca para Python para ayudar en la creación de aplicaciones que usan la API de Discord.
ko: 이 문서는 Discord API를 활용하는 애플리케이션을 제작하는 데 도와주는 라이브러리인 Pycord에 대한 문서입니다.
pt_br: Esta é a documentação do Pycord, uma biblioteca para Python auxiliar na criação de aplicativos que utilizam a API do Discord.
ru: Это документация по Pycord, библиотеке для Python, помогающей создавать приложения, использующие API Discord.
zh_cn: 这是Pycord的文挡，一个Python库，用于帮助创建、利用Discord API的库。

source: Prerequisites
de: Voraussetzungen
es: Requisitos previos
ko: 요구 사항
pt_br: Pré-requisitos
ru: Требования
zh_cn: 前置条件

source: Pycord works with Python 3.8 or higher. Support for earlier versions of Python is not provided. Python 2.7 or lower is not supported. Python 3.7 or lower is not supported.
de: Pycord funktioniert mit Python 3.8 oder höher. Es wird keine Unterstützung für frühere Python-Versionen bereitgestellt. Python 2.7 oder niedriger wird nicht unterstützt. Python 3.7 oder niedriger wird nicht unterstützt.
es: Pycord funciona con Python 3.8 o superior. No se proporciona soporte para versiones anteriores de Python. Python 2.7 o inferior no es compatible. Python 3.7 o inferior, no es compatible.
ko: Pycord는 Python 3.8 이상을 요구합니다. 이전 버전의 Python에 대한 지원은 제공되지 않습니다. Python 2.7 이하는 지원되지 않습니다. Python 3.7 이하는 지원되지 않습니다.
pt_br: Pycord funciona com Python 3.8 ou superior. Suporte para versões anteriores do Python não é fornecido. Python 2.7 ou inferior não é suportado. Python 3.7 ou inferior não é suportado.
ru: Pycord работает с Python 3.8 или выше. Поддержка более ранних версий Python не предоставляется. Python 2.7 или ниже не поддерживается. Python 3.7 или ниже не поддерживается.
zh_cn: Pycord可以使用Python3.8或以上的版本。不支持较早的Python版本。并不支持Python2.7或更低的Python。并不支持Python3.7或更低的版本。

source: Installing
de: Installieren
es: Instalación
ko: 설치하기
pt_br: Instalando
ru: Установка
zh_cn: 安装

source: For new features in upcoming versions, you will need to install the pre-release until a stable version is released. ::
de: Für neue Funktionen in kommenden Versionen müssen Sie die Vorversion installieren, bis eine stabile Version veröffentlicht ist. ::
es: Para nuevas características en las próximas versiones, necesitarás instalar la versión de pre lanzamiento hasta que se publique una versión estable. ::
ko: 향후 버전의 새 기능을 사용하려면, 안정(stable) 버전이 출시되기 전까지 프리릴리스 버전을 사용해야 합니다.
pt_br: Para novos recursos em versões futuras, você precisará instalar a versão pré-lançamento até que uma versão estável seja liberada. ::
ru: Для новых возможностей в будущих версиях Вам нужно будет установить пререлиз до выпуска стабильной версии. ::
zh_cn: 对于即将到来的版本的新功能，你将需要安装一个预发布版本直到一个稳定版本的发布。::

source: For Windows users, this command should be used to install the pre-release: ::
de: Für Windows-Benutzer sollte dieser Befehl verwendet werden, um die Betaversion zu installieren: ::
es: Para los usuarios de Windows, este comando debe usarse para instalar la versión de pre lanzamiento: ::
ko: Windows의 경우, 프리릴리스를 설치하려면 다음 명령을 사용해야 합니다. ::
pt_br: Para usuários do Windows, este comando deve ser usado para instalar a pre-release: ::
ru: Для пользователей Windows, эта команда должна использоваться для установки пререлиза: ::
zh_cn: 对于Windows用户，使用这个命令安装预发布版本：::

source: You can get the library directly from PyPI: ::
de: Sie können die Bibliothek direkt von PyPI erhalten: ::
es: Puedes obtener la biblioteca directamente desde PyPI: ::
ko: 다음 명령으로 PyPI에서 직접 라이브러리를 받을 수 있습니다.
pt_br: Você pode obter a biblioteca diretamente do PyPI: ::
ru: Библиотеку можно получить непосредственно из PyPI: ::
zh_cn: 你可以透过PyPI获取本库：::

source: If you are using Windows, then the following should be used instead: ::
de: Wenn Sie Windows verwenden, sollte stattdessen folgendes verwendet werden: ::
es: Si estás usando Windows, entonces deberías usar lo siguiente en su lugar: ::
ko: Windows의 경우, 대신 다음 명령을 사용해야 합니다. ::
pt_br: Se você estiver usando Windows, então o seguinte deve ser utilizado: ::
ru: Если вы используете Windows, вместо этого следует использовать следующее: ::
zh_cn: 如果你正在使用Windows，则应该遵照下方的指示进行操作：::

source: To install additional packages for speedup, you should use ``py-cord[speed]`` instead of ``py-cord``, e.g.
de: Um zusätzliche Pakete für Beschleunigung zu installieren, sollten Sie ``py-cord[speed]`` anstelle von ``py-cord`` verwenden, z.B.
es: Para instalar paquetes adicionales para una mayor velocidad, deberías usar ``py-cord[speed]`` en lugar de ``py-cord``, por ejemplo.
ko: 속도 향상을 위한 추가 패키지를 설치하려면, 아래와 같이 ``pycord`` 대신 ``py-cord[speed]``를 사용하셔야 합니다.
pt_br: Para instalar pacotes adicionais para otimização, você deve usar "py-cord[speed]" em vez de "py-cord", por exemplo:
ru: Для установки дополнительных пакетов для ускорения используйте ``py-cord[speed]`` вместо ``py-cord``, например:
zh_cn: 如果要安装额外的加速包体，你应该使用``py-cord[speed]``而不是``py-cord``，例如：

source: To get voice support, you should use ``py-cord[voice]`` instead of ``py-cord``, e.g. ::
de: Um Sprachunterstützung zu erhalten, sollten Sie ``py-cord[voice]`` anstelle von ``py-cord`` verwenden, z. B. ::
es: Para obtener soporte de voz, deberías usar ``py-cord[voice]`` en lugar de ``py-cord``, por ejemplo ::
ko: 음성 기능을 사용하려면, 아래와 같이 ``py-cord`` 대신 ``py-cord[voice]``를 사용하셔야 합니다. ::
pt_br: Para obter suporte a voice, você deve usar "py-cord[voice]" em vez de "py-cord", por exemplo: ::
ru: Чтобы получить голосовую поддержку, следует использовать ``py-cord[voice]`` вместо ``py-cord``, например ::
zh_cn: 如果要获取语音支援，你应该使用``py-cord[voice]``而不是``py-cord``，例如：::

source: On Linux environments, installing voice requires getting the following dependencies:
de: Auf Linux-Umgebungen erfordert das Installieren der Sprachunterstützung folgende Abhängigkeiten:
es: En entornos Linux, la instalación de voz requiere las siguientes dependencias:
ko: Linux 환경의 경우, 음성 기능을 사용하려면 다음 의존성이 필요합니다.
pt_br: Em ambientes Linux, a instalação de voice requer a obtenção das seguintes dependências:
ru: В среде Linux для установки голоса требуется наличие следующих зависимостей:
zh_cn: 在Linux环境下，安装语音支援包体需要以下依赖：

source: For a Debian-based system, the following command will get these dependencies:
de: Für ein Debian-basiertes System erhält der folgende Befehl folgende Abhängigkeiten:
es: Para un sistema basado en Debian, el siguiente comando instalará estas dependencias:
ko: Debian 기반 환경의 경우, 다음 명령으로 위 의존성을 설치할 수 있습니다.
pt_br: Em um sistema baseado em Debian, o seguinte comando irá obter essas dependências:
ru: Для основанной на Debian системы следующая команда получит требуемые зависимости:
zh_cn: 对于基于Debian的系统，以下指令将获取获得这些依赖：

source: Remember to check your permissions!
de: Denken Sie daran, Ihre Berechtigungen zu überprüfen!
es: ¡Recuerda comprobar tus permisos!
ko: 명령 실행 권한을 가지고 있는지 확인하세요!
pt_br: Lembre-se de verificar suas permissões!
ru: Не забудьте проверить ваши права!
zh_cn: 请记住检查您的权限！

source: Virtual Environments
de: Virtuelle Umgebungen
es: Entornos virtuales
ko: 가상 환경
pt_br: Ambientes Virtuais
ru: Виртуальные окружения
zh_cn: 虚拟环境

source: Sometimes you want to keep libraries from polluting system installs or use a different version of libraries than the ones installed on the system. You might also not have permissions to install libraries system-wide. For this purpose, the standard library as of Python 3.3 comes with a concept called "Virtual Environment"s to help maintain these separate versions.
de: Manchmal möchten Sie Bibliotheken davon abhalten, System Installationen zu verschmutzen oder eine andere Version von Bibliotheken als die auf dem System installierten zu verwenden. Möglicherweise haben Sie ebenfalls nicht die Berechtigung, Bibliotheken systemweit zu installieren. Zu diesem Zweck enthält die Standardbibliothek ab Python 3.3 ein Konzept mit dem Namen "Virtuelle Umgebung"en, um diese separaten Versionen zu unterhalten.
es: A veces se quiere evitar que las bibliotecas contaminen las instalaciones en el sistema o usar una versión distinta de aquellas instaladas en el sistema. Es posible que tampoco tengas permisos para instalar bibliotecas en tu sistema. Para este propósito, la biblioteca estándar a partir de Python 3.3 viene con un concepto llamado "entornos virtuales" para ayudar a mantener estas versiones separadas.
ko: 때때로 라이브러리가 시스템 환경을 오염시키는 것을 막는다거나, 시스템에 이미 설치된 것과는 다른 버전의 라이브러리를 쓰고 싶은 경우가 있습니다. 어쩌면 시스템에 직접 라이브러리를 설치할 수 있는 권한이 없을 수도 있습니다. 이러한 경우를 위해 Python 3.3부터의 표준 라이브러리에서는 각 버전의 라이브러리를 유지하는 데 도움을 주는 ‘가상 환경’이라는 개념이 제공됩니다.
pt_br: Às vezes, você deseja evitar que as bibliotecas interfiram nas instalações do sistema ou usar uma versão diferente das bibliotecas instaladas no sistema. Você também pode não ter permissões para instalar bibliotecas em todo o sistema. Para esse propósito, a biblioteca padrão a partir do Python 3.3 inclui um conceito chamado "Ambientes Virtuais" para ajudar a manter essas versões separadas.
ru: Иногда вы хотите, чтобы библиотеки не загрязняли системные установки или использовали версии библиотек, отличные от тех, что установлены в системе. Вы также можете не иметь прав на установку библиотек по всей системе. Для этой цели стандартная библиотека как Python 3.3 поставляется с концепцией "Виртуальное окружение", помогающей поддерживать эти отдельные версии.
zh_cn: 有时你想让库不要安装污染系统或使用不同于安装在系统上的库的版本。 您可能也没有权限在全系统安装库。 为此目的，截至Python 3.3的标准库含有一个称为“虚拟环境”的概念，以帮助维持这些单独的版本。

source: A more in-depth tutorial is found on :doc:`py:tutorial/venv`.
de: Eine ausführlichere Anleitung finden Sie auf :doc:`py:tutorial/venv`.
es: Puedes encontrar un tutorial más detallado en :doc:`py:tutorial/venv`.
ko: 자세한 튜토리얼은 :doc:`py:tutorial/venv`에서 확인하실 수 있습니다.
pt_br: Um tutorial mais detalhado pode ser encontrado em :doc:`py:tutorial/venv`.
ru: Более подробное руководство находится в :doc:`py:tutorial/venv`.
zh_cn: 更多更深的交学可以在 :doc:`py:tutorual/venv` 内找到。

source: However, for the quick and dirty:
de: Aber für die Schnellen und Schmutzigen:
es: Sin embargo, para lo rápido y sucio:
ko: 간단히 말하자면
pt_br: No entanto, para algo rápido e simples:
ru: Однако, если кратко:
zh_cn: 然而，就快速和简短而言：

source: Go to your project's working directory:
de: Gehen Sie zum Arbeitsverzeichnis Ihres Projekts:
es: Ve al directorio de trabajo de tu proyecto:
ko: 프로젝트의 작업 폴더로 접근합니다.
pt_br: Vá para o diretório de trabalho do seu projeto:
ru: Перейдите в рабочую папку вашего проекта:
zh_cn: 前往您项目的工作目录：

source: Activate the virtual environment:
de: Aktivieren Sie die virtuelle Umgebung:
es: Activa el entorno virtual:
ko: 가상 환경을 활성화합니다.
pt_br: Ative o ambiente virtual:
ru: Активируйте виртуальное окружение:
zh_cn: 激活虚拟环境：

source: On Windows you activate it with:
de: Auf Windows aktivieren Sie diese mit:
es: En Windows lo activas con:
ko: Windows에서 활성화하려면 다음을 실행하세요.
pt_br: No Windows, você o ativará com:
ru: На Windows вы активируете её с помощью:
zh_cn: 在Windows系统上激活它：

source: Use pip like usual:
de: Pip wie üblich verwenden:
es: Usa pip como de costumbre:
ko: 평소처럼 pip를 사용합니다.
pt_br: Use pip como de costume:
ru: Используйте pip, как обычно:
zh_cn: 跟往常一样的使用pip：

source: Congratulations. You now have a virtual environment all set up.
de: Glückwunsch. Sie haben nun eine virtuelle Umgebung eingerichtet.
es: Enhorabuena. Ahora tienes un entorno virtual configurado.
ko: 축하합니다. 가상 환경 구축이 모두 끝났습니다.
pt_br: Parabéns. Agora você tem um ambiente virtual configurado.
ru: Поздравляем. Теперь у вас есть настроенное виртуальное окружение.
zh_cn: 恭喜您。你现在已经设置完成了一个虚拟环境。

source: Basic Concepts
de: Basiskonzepte
es: Conceptos básicos
ko: 기본 개념
pt_br: Conceitos Básicos
ru: Основные концепции
zh_cn: 基础概念

source: Pycord revolves around the concept of :ref:`events <discord-api-events>`. An event is something you listen to and then respond to. For example, when a message happens, you will receive an event about it that you can respond to.
de: Pycord dreht sich um das Konzept von :ref:`events <discord-api-events>`. Ein Event ist etwas, auf das Sie hören und dann reagieren. Zum Beispiel, wenn eine Nachricht passiert, erhalten Sie ein Event darüber, auf das Sie reagieren können.
es: Pycord gira en torno al concepto de :ref:`eventos <discord-api-events>`. Un evento es algo a lo que escuchas y luego respondes. Por ejemplo, cuando ocurre un mensaje, recibirás un evento al que puedas responder.
ko: Pycord는 :ref:`이벤트 <discord-api-events>` 개념을 중심으로 작동합니다. 이벤트는 무언가를 감지하고 이에 반응하는 일을 합니다. 예컨대, 메시지가 전송되면 관련 이벤트를 받게 되며, 이에 대해 응답할 수 있게 됩니다.
pt_br: O Pycord gira em torno do conceito de :ref:`events <discord-api-events>`. Um evento é algo ao qual você ouve e então responde. Por exemplo, quando uma mensagem é enviada, você receberá um evento relacionado a isso, ao qual poderá responder.
ru: Pycord работает на основе концепции :ref:`событий <discord-api-events>`. Событие - это то, что вы ожидаете и на что потом отвечаете. Например, когда происходит сообщение, вы получаете об этом событие, на которое можете ответить.
zh_cn: Pycord围绕着 :ref:`event <discord-api-events>`的概念。event是一个让你可以去监听并且回应的东西。举个例子来说，当一个讯息创建，你将会收到一个event是关于这个讯息的并且可以用于回应。

source: A quick example to showcase how events work:
de: Ein schnelles Beispiel, um zu zeigen, wie Events funktionieren:
es: Un ejemplo rápido para mostrar cómo funcionan los eventos:
ko: 다음은 이벤트의 작동 방법를 보여주는 간단한 예입니다.
pt_br: Um exemplo rápido para mostrar como os eventos funcionam:
ru: Быстрый пример того, как работают события:
zh_cn: 一个显示event如何工作的简单示例：
