Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/intents.po
Languages: es, ru

source: A Primer to Gateway Intents
es: Un vistazo a las intenciones del gateway
ru: Введение в Шлюзовые Интенты

source: In version 1.5 comes the introduction of :class:`Intents`. This is a radical change in how bots are written. An intent basically allows a bot to subscribe to specific buckets of events. The events that correspond to each intent is documented in the individual attribute of the :class:`Intents` documentation.
es: La versión 1.5 viene con la introducción de :class:`Intents`. Este es un cambio radical en la forma que se escriben los bots. Una intención básicamente permite a tu bot a suscribirse a ciertos eventos del bucket. Los eventos que corresponden a cada intención están documentados en cada atributo individual de :class:`Intents`.
ru: В версии 1.5 появился класс :class:`Intents`. Это радикальное изменение в том, как пишутся боты. Интент в основном позволяет боту подписываться на определенные группы событий. События, соответствующие каждому интенту, описываются в индивидуальном атрибуте документации :class:`Intents`.

source: These intents are passed to the constructor of :class:`Client` or its subclasses (:class:`AutoShardedClient`, :class:`~.AutoShardedBot`, :class:`~.Bot`) with the ``intents`` argument.
es: Estas intenciones son pasadas al constructor de :class:`Client`, o sus subclases (:class:`AutoShardedClient`, :class:`~.AutoShardedBot`, :class:`~.Bot`), con el argumento ``intents``.
ru: Эти интенты передаются в конструктор :class:`Client` или его подклассов (:class:`AutoShardedClient`, :class:`~.AutoShardedBot`, :class:`~.Bot`) с аргументом ``intents``.

source: If intents are not passed, then the library defaults to every intent being enabled except the privileged intents, currently :attr:`Intents.members`, :attr:`Intents.presences`, and :attr:`Intents.message_content`.
es: Si no pasas ninguna intención, la biblioteca predeterminará a habilitar todas las intenciones, a excepción de las intenciones privilegiadas, actualmente siendo :attr:`Intents.members`, :attr:`Intents.presences`, y :attr:`Intents.message_content`.
ru: Если интенты не переданы, то библиотека по умолчанию включает все интенты, кроме привилегированных, а именно :attr:`Intents.members`, :attr:`Intents.presences` и :attr:`Intents.message_content`.

source: What intents are needed?
es: ¿Qué intenciones se necesitan?
ru: Какие интенты нужны?

source: The intents that are necessary for your bot can only be dictated by yourself. Each attribute in the :class:`Intents` class documents what :ref:`events <discord-api-events>` it corresponds to and what kind of cache it enables.
es: Las intenciones que son necesarias para tu bot solo pueden ser dictadas por ti mismo. Cada atributo en la clase :class:`Intents` documenta a que :ref:`eventos <discord-api-events>` corresponden y que tipo de caché habilitan.
ru: Интенты, необходимые вашему боту, вы можете определить только сами. Каждый атрибут в классе :class:`Intents` документирует, какому :ref:`событию <discord-api-events>` он соответствует и какой вид кэша он включает.

source: For example, if you want a bot that functions without spammy events like presences or typing then we could do the following:
es: Por ejemplo, si quieres un bot que funcione sin eventos que son molestos como las presencias o el tipo, entonces podríamos hacer lo siguiente:
ru: Например, если вам нужен бот, работающий без спамерских событий вроде статуса или набора текста, мы можем сделать следующее:

source: Note that this doesn't enable :attr:`Intents.members` or :attr:`Intents.message_content` since they are privileged intents.
es: Ten en cuenta que esto no habilita :attr:`Intents.members` o :attr:`Intents.message_content` ya que son intenciones privilegiadas.
ru: Обратите внимание, что это не включает :attr:`Intents.members` и :attr:`Intents.message_content`, поскольку они являются привилегированными интентами.

source: Another example showing a bot that only deals with messages and guild information:
es: Otro ejemplo donde se muestra un bot que solo se ocupa de los mensajes e información de servidores:
ru: Еще один пример бота, который работает только с сообщениями и информацией о гильдиях:

source: Privileged Intents
es: Intenciones privilegiadas
ru: Привилегированные Интенты

source: With the API change requiring bot owners to specify intents, some intents were restricted further and require more manual steps. These intents are called **privileged intents**.
es: Con el cambio de la API que requiere que los propietarios de los bots especifiquen intenciones, algunas intenciones fueron restringidas aún más y requieren más pasos manuales. Estas intenciones son llamadas **intenciones privilegiadas**.
ru: С изменением API, требующим от владельцев ботов указывать интенты, некоторые из них были дополнительно ограничены и требуют больше ручных действий. Такие интенты называются **привилегированными интентами**.

source: A privileged intent is one that requires you to go to the developer portal and manually enable it. To enable privileged intents do the following:
es: Una intención privilegiada es aquella que requiere que vayas al developer portal y la habilites manualmente. Para habilitar una intención privilegiada, haz lo siguiente:
ru: Привилегированный intent - это intent, который требует перехода на портал разработчика и ручного включения. Чтобы включить привилегированные intent'ы, выполните следующие действия:

source: Make sure you're logged on to the `Discord website <https://discord.com>`_.
es: Asegúrate de haber iniciado sesión en el `sitio web de Discord <https://discord.com>`_.
ru: Убедитесь, что вы вошли на сайте `Discord <https://discord.com>`_.

source: Navigate to the `application page <https://discord.com/developers/applications>`_.
es: Navega a la página de `aplicaciones <https://discord.com/developers/applications>`_.
ru: Перейдите на `страницу приложения <https://discord.com/developers/applications>`_.

source: Click on the bot you want to enable privileged intents for.
es: Haz clic en el bot para que el cual quieres activar las intenciones privilegiadas.
ru: Нажмите на бота, для которого вы хотите включить привилегированные интенты.

source: Navigate to the bot tab on the left side of the screen.
es: Navega a la pestaña de bot en el lado izquierda de la pantalla.
ru: Перейдите на вкладку "Bot" в левой части экрана.

source: The bot tab in the application page.
es: La pestaña de bot en la página de la aplicación.
ru: Вкладка "Bot" на странице приложения.

source: Scroll down to the "Privileged Gateway Intents" section and enable the ones you want.
es: Desplázate hacia abajo hasta la sección de "Privileged Gateway Intents" y activa los que desees.
ru: Прокрутите вниз до раздела "Privileged Gateway Intents" и включите нужные вам интенты.

source: The privileged gateway intents selector.
es: El selector de intenciones privilegiadas.
ru: Селектор интентов привилегированного шлюза.

source: Enabling privileged intents when your bot is in over 100 guilds requires going through `bot verification <https://support.discord.com/hc/en-us/articles/360040720412>`_.
es: Habilitar intenciones privilegiadas cuando tu bot está en más de 100 servidores, requiere pasar por la `verificación de bots <https://support-dev.discord.com/hc/es/articles/23926564536471>`_.
ru: Включение привилегированных интентов, если ваш бот состоит в более чем 100 гильдиях, требует прохождения `верификации бота <https://support.discord.com/hc/en-us/articles/360040720412>`_.

source: Even if you enable intents through the developer portal, you still have to enable the intents through code as well.
es: Incluso si activas las intenciones a través del portal de desarrolladores, todavía tienes que activar las intenciones a través de tu código.
ru: Даже если вы включите интенты через портал разработчика, вам все равно придется включить их и через код.

source: Do I need privileged intents?
es: ¿Necesito intenciones privilegiadas?
ru: Нужны ли мне привилегированные интенты?

source: This is a quick checklist to see if you need specific privileged intents.
es: Esta es una lista de verificación rápida para ver si necesitas intenciones privilegiadas específicas.
ru: Это краткий чек-лист, чтобы понять, нужны ли вам особые привилегированные интенты.

source: Presence Intent
es: Intención de presencia
ru: Интент статуса

source: Whether you use :attr:`Member.status` at all to track member statuses.
es: Si usas :attr:`Member.status` en absoluto para seguir los estados de los miembros.
ru: Если вы используете :attr:`Member.status` для отслеживания статусов участников.

source: Whether you use :attr:`Member.activity` or :attr:`Member.activities` to check member's activities.
es: Si usas :attr:`Member.activity` o :attr:`Member.activity.activities` para comprobar las actividades de miembros.
ru: Если вы используете :attr:`Member.activity` или :attr:`Member.activities` для проверки активностей участника.

source: Member Intent
es: Intención de miembros
ru: Интент участника

source: Whether you track member joins or member leaves, corresponds to :func:`on_member_join` and :func:`on_member_remove` events.
es: Si deseas registrar las entradas o salidas de miembros, corresponde a los eventos :func:`on_member_join` y :func:`on_member_remove`.
ru: Если вы отслеживаете присоединение или уход участников, соответствующими событиями :func:`on_member_join` и :func:`on_member_remove`.

source: Whether you want to track member updates such as nickname or role changes.
es: Si deseas realizar un seguimiento de las actualizaciones de los miembros, tales como nick o cambios de rol.
ru: Если вы хотите отслеживать обновления участников, такие как изменение никнейма или ролей.

source: Whether you want to track user updates such as usernames, avatars, discriminators, etc.
es: Si desea rastrear actualizaciones de usuarios como nombres de usuario, avatares, discriminadores, etc.
ru: Если вы хотите отслеживать обновления пользователей, такие как имена пользователей, аватары, дискриминаторы и т. д.

source: Whether you want to request the guild member list through :meth:`Guild.chunk` or :meth:`Guild.fetch_members`.
es: Si quieres solicitar la lista de miembros del servidor a través de :meth:`Guild.chunk` o :meth:`Guild.fetch_members`.
ru: Если вы хотите запрашивать список участников гильдии через :meth:`Guild.chunk` или :meth:`Guild.fetch_members`.

source: Whether you want high accuracy member cache under :attr:`Guild.members`.
es: Si quieres un caché de miembros de alta precisión bajo :attr:`Guild.members`.
ru: Если вам нужен высокоточный кэш участников под :attr:`Guild.members`.

source: Message Content Intent
es: Intención de contenido del mensaje
ru: Интент содержимого сообщения

source: Whether you have a message based command system using ext.commands
es: Si tienes un sistema de comandos basado en mensajes usando ext.commands
ru: Если у вас есть система команд на основе сообщений, использующая ext.commands

source: Whether you use the :func:`on_message` event for anything using message content, such as auto-moderation.
es: Si usas el evento :func:`on_message` para cualquier cosa usando contenido de mensajes, tales como moderación automática.
ru: Если вы используете :func:`on_message` для всего, что использует содержимое сообщений, например, для автомодерации.

source: Whether you use message content in :func:`on_message_edit`, :func:`on_message_delete`, :func:`on_raw_message_edit`, :func:`on_raw_message_delete`.
es: Si usas el contenido del mensaje en :func:`on_message_edit`, :func:`on_message_delete`, :func:`on_raw_message_edit`, :func:`on_raw_message_delete`.
ru: Если вы используете содержимое сообщения в :func:`on_message_edit`, :func:`on_message_delete`, :func:`on_raw_message_edit`, :func:`on_raw_message_delete`.

source: The bot can still receive message contents in DMs, when mentioned in guild messages, and for its own guild messages.
es: El bot todavía puede recibir contenidos de mensajes en sus MD, cuando se lo menciona en los mensajes en servidores, y para sus propios mensajes en servidores.
ru: Бот по-прежнему может получать содержимое сообщений в ЛС, при упоминании в сообщениях гильдии и для своих собственных сообщений гильдии.

source: Member Cache
es: Caché de miembros
ru: Кэш участника

source: Along with intents, Discord now further restricts the ability to cache members and expects bot authors to cache as little as is necessary. However, to properly maintain a cache the :attr:`Intents.members` intent is required in order to track the members who left and properly evict them.
es: Junto con las intenciones, Discord ahora restringe aún más la capacidad de cachear a los miembros y espera que los autores del bot cacheen tan poco como sea necesario. Sin embargo, para mantener correctamente un caché se requiere la intención :attr:`Intents.members` para poder hacer un seguimiento de los miembros que dejaron el servidor y removerlos correctamente.
ru: Наряду с интентами, Discord теперь еще больше ограничивает возможность кэширования участников и ожидает, что авторы ботов будут кэшировать столько, сколько необходимо. Однако для правильного сохранения кэша требуется интент :attr:`Intents.members`, чтобы отслеживать ушедших пользователей и правильно их удалять.

source: To aid with member cache where we don't need members to be cached, the library now has a :class:`MemberCacheFlags` flag to control the member cache. The documentation page for the class goes over the specific policies that are possible.
es: Para ayudar con el caché de miembros donde no necesitamos que los miembros sean cacheados, la biblioteca ahora tiene una bandera :class:`MemberCacheFlags` para controlar la caché de miembros. La página de documentación de la clase va más allá de las políticas específicas que son posibles.
ru: Чтобы помочь кэшу участников, когда нам не нужно, чтобы участники кэшировались, в библиотеке теперь есть флаг :class:`MemberCacheFlags` для управления кэшированием участников. На странице документации по этому классу описаны возможные политики.

source: It should be noted that certain things do not need a member cache since Discord will provide full member information if possible. For example:
es: Debe tenerse en cuenta que ciertas cosas no necesitan un caché de miembros, ya que Discord proporcionará información completa si es posible. Por ejemplo:
ru: Следует отметить, что некоторые вещи не нуждаются в кэше участника, так как Discord будет предоставлять полную информацию о пользователе, если это возможно. Например:

source: :func:`on_message` will have :attr:`Message.author` be a member even if cache is disabled.
es: :func:`on_message` tendrá :attr:`Message.author` como un miembro incluso si el caché está deshabilitado.
ru: В :func:`on_message` будет входить :attr:`Message.author`, даже если кэш отключен.

source: :func:`on_voice_state_update` will have the ``member`` parameter be a member even if cache is disabled.
es: :func:`on_voice_state_update` tendrá al parámetro ``member`` como un miembro incluso si el caché está deshabilitado.
ru: В :func:`on_voice_state_update` будет входить параметр ``member`` в виде участника, даже если кэш отключен.

source: :func:`on_reaction_add` will have the ``user`` parameter be a member when in a guild even if cache is disabled.
es: :func:`on_reaction_add` tendrá el parámetro ``user`` como miembro cuando esté en un servidor incluso si el caché está deshabilitado.
ru: :func:`on_reaction_add` будет иметь параметр ``user`` в виде участника, даже если кэш отключен.

source: :func:`on_raw_reaction_add` will have :attr:`RawReactionActionEvent.member` be a member when in a guild even if cache is disabled.
es: :func:`on_raw_reaction_add` tendrá :attr:`RawReactionActionEvent.member` como un miembro cuando esté en un servidor incluso si el caché está deshabilitado.
ru: :func:`on_raw_reaction_add` будет иметь :attr:`RawReactionActionEvent.member` в виде участника, даже если кэш отключен.

source: The reaction add events do not contain additional information when in direct messages. This is a Discord limitation.
es: Los eventos de añadir reacciones no contienen información adicional cuando nos encontramos en mensajes directos. Esta es una limitación de Discord.
ru: События добавления реакции не содержат дополнительной информации в личных сообщениях. Это ограничение Discord.

source: The reaction removal events do not have member information. This is a Discord limitation.
es: Los eventos de eliminación de reacciones no contienen información sobre los miembros. Esta es una limitación de Discord.
ru: События удаления реакции не имеют информации об участнике. Это ограничение Discord.

source: Other events that take a :class:`Member` will require the use of the member cache. If absolute accuracy over the member cache is desirable, then it is advisable to have the :attr:`Intents.members` intent enabled.
es: Otros eventos que acepten un :class:`Member` requerirán el uso de la caché de miembros. Si la precisión absoluta sobre la caché de miembros es asumible, entonces es recomendable activar la intención :attr:`Intents.members`.
ru: Другие события, которые принимают :class:`Member`, потребуют использования кэша участников. Если желательна абсолютная точность кэша участников, то рекомендуется включить интент :attr:`Intents.members`.

source: Retrieving Members
es: Obteniendo miembros
ru: Получение участников

source: If the cache is disabled or you disable chunking guilds at startup, we might still need a way to load members. The library offers a few ways to do this:
es: Si el caché está deshabilitado o desactivas el chunking de servidores al inicio, puede que necesitemos una forma de cargar miembros. La biblioteca ofrece algunas maneras de hacer esto:
ru: Если кэш отключен или вы отключили чанкинг гильдий при запуске, нам все равно понадобится способ загрузки участников. Библиотека предлагает несколько способов сделать это:

source: Used to query members by a prefix matching nickname or username.
es: Utilizado para consultar a los miembros por un prefijo que coincida con el nick o nombre de usuario.
ru: Используется для запроса пользователей по префиксу, совпадающему с никнеймом или именем пользователя.

source: This can also be used to query members by their user ID.
es: Esto también puede ser utilizado para consultar a los miembros por su ID de usuario.
ru: Это также можно использовать для запроса пользователей по их ID пользователя.

source: This uses the gateway and not the HTTP.
es: Esto utiliza la gateway y no las peticiones HTTP.
ru: Это использует шлюз, а не HTTP.

source: This can be used to fetch the entire member list through the gateway.
es: Esto se puede utilizar para obtener toda la lista de miembros a través de la gateway.
ru: Это можно использовать для получения всего списка участников через шлюз.

source: Used to fetch a member by ID through the HTTP API.
es: Utilizado para obtener un miembro por su ID a través de la API HTTP.
ru: Используется для получения участника по ID через HTTP API.

source: used to fetch a large number of members through the HTTP API.
es: usado para obtener un gran número de miembros a través de la API HTTP.
ru: Используется для получения большого количества участников через HTTP API.

source: It should be noted that the gateway has a strict rate limit of 120 requests per 60 seconds.
es: Cabe señalar que la gateway tiene un estricto límite de tasa de 120 solicitudes por 60 segundos.
ru: Следует отметить, что шлюз имеет строгое ограничение по скорости - 120 запросов за 60 секунд.

source: Troubleshooting
es: Resolución de problemas
ru: Устранение неполадок

source: Some common issues relating to the mandatory intent change.
es: Algunas cuestiones comunes relacionadas con el cambio de intenciones obligatorio.
ru: Некоторые распространенные проблемы, связанные с обязательным изменением интентов.

source: Where'd my members go?
es: ¿A dónde irían mis miembros?
ru: Куда пропали мои участники?

source: Due to an :ref:`API change <intents_member_cache>` Discord is now forcing developers who want member caching to explicitly opt-in to it. This is a Discord mandated change and there is no way to bypass it. In order to get members back you have to explicitly enable the :ref:`members privileged intent <privileged_intents>` and change the :attr:`Intents.members` attribute to true.
es: Debido a un :ref:`cambio en la API <intents_member_cache>`, Discord ahora está forzando a los desarrolladores que quieren cachear miembros a explícitamente optar por este. Este es un cambio mandificado de Discord y no hay forma de saltarlo. Para recuperar miembros, tienes que habilitar explícitamente las :ref:`intenciones privilegiadas de miembros <privileged_intents>` y cambiar :attr:`Intents.members` a true.
ru: В связи с :ref:`изменением в API <intents_member_cache>` Discord теперь заставляет разработчиков, желающих использовать кэширование участников, явным образом отказаться от него. Это обязательное изменение Discord, и обойти его невозможно. Чтобы вернуть участников, вам нужно явно включить :ref:`привилегированный интент участников <privileged_intents>` и изменить :attr:`Intents.members` на true.

source: For example:
es: Por ejemplo:
ru: Например:

source: Why does ``on_ready`` take so long to fire?
es: ¿Por qué ``on_ready`` tarda tanto en disparar?
ru: Почему вызов ``on_ready`` занимает так много времени?

source: As part of the API change regarding intents, Discord also changed how members are loaded in the beginning. Originally the library could request 75 guilds at once and only request members from guilds that have the :attr:`Guild.large` attribute set to ``True``. With the new intent changes, Discord mandates that we can only send 1 guild per request. This causes a 75x slowdown which is further compounded by the fact that *all* guilds, not just large guilds are being requested.
es: Como parte del cambio en la API referido a las intenciones, Discord también cambió como los miembros son cargados al inicio. Originalmente, la biblioteca podía solicitar hasta 75 servidores a la vez, y solo solicitar los miembros de aquellos servidores cuyo :attr:`Guild.large` era ``True``. Con este nuevo cambio de las intenciones, Discord dicta que solo podemos solicitar 1 servidor por petición. Esto causa una lentitud de x75, que es aun más contraproducente por el hecho de que **todos** los servidores, no solo aquellos grandes, están siendo solicitados.
ru: В рамках изменения API, касающегося интентов, Discord также изменил способ загрузки участников в начале. Изначально библиотека могла запрашивать 75 гильдий одновременно и запрашивать участников только из тех гильдий, у которых атрибут :attr:`Guild.large` установлен на ``True``. С новыми изменениями намерений Discord требует, чтобы мы могли отправлять только 1 гильдию за запрос. Это приводит к 75-кратному замедлению, которое усугубляется тем фактом, что запрашиваются *все* гильдии, а не только большие гильдии.

source: There are a few solutions to fix this.
es: Hay algunas soluciones para arreglar esto.
ru: Есть несколько решений, как это исправить.
