Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/intents.po
Languages: es, ru

source: The first solution is to request the privileged presences intent along with the privileged members intent and enable both of them. This allows the initial member list to contain online members just like the old gateway. Note that we're still limited to 1 guild per request but the number of guilds we request is significantly reduced.
es: La primera solución es solicitar la intención de las presencias privilegiadas junto con la intención de los miembros privilegiados y permitir ambas cosas. Esto permite que la lista inicial de miembros contenga miembros en línea como la gateway antigua. Ten en cuenta que todavía estamos limitados a 1 servidor por solicitud, pero el número de servidores que solicitamos se reduce significativamente.
ru: Первое решение - запрашивать привилегированный интент статусов вместе с привилегированным интентом участников и включить их оба. Это позволит первоначальному списку участников содержать онлайн-участников, как и в старом шлюзе. Обратите внимание, что мы по-прежнему ограничены 1 гильдией на запрос, но количество гильдий, которые мы запрашиваем, значительно уменьшилось.

source: The second solution is to disable member chunking by setting ``chunk_guilds_at_startup`` to ``False`` when constructing a client. Then, when chunking for a guild is necessary you can use the various techniques to :ref:`retrieve members <retrieving_members>`.
es: La segunda solución es deshabilitar el chunking de miembros estableciendo ``chunk_guilds_at_startup`` a ``False`` al construir un cliente. Luego, cuando sea necesario hacer chunking para un servidor, puedes usar las distintas técnicas para obtener :ref:`recuperar <retrieving_members>` los miembros.
ru: Второе решение - отключить чанкинг участников, установив ``chunk_guilds_at_startup`` на ``False`` при построении клиента. Затем, когда чанкинг для гильдии будет необходим, вы можете использовать различные техники для :ref:`получения участников <retrieving_members>`.

source: To illustrate the slowdown caused by the API change, take a bot who is in 840 guilds and 95 of these guilds are "large" (over 250 members).
es: Para ilustrar la desaceleración causada por el cambio de API, toma un bot que está en 840 servidores y 95 de estos servidores son "grandes" (más de 250 miembros).
ru: Чтобы проиллюстрировать замедление, вызванное изменением API, возьмем бота, который состоит в 840 гильдиях, и 95 из этих гильдий являются "большими" (более 250 участников).

source: Under the original system this would result in 2 requests to fetch the member list (75 guilds, 20 guilds) roughly taking 60 seconds. With :attr:`Intents.members` but not :attr:`Intents.presences` this requires 840 requests, with a rate limit of 120 requests per 60 seconds means that due to waiting for the rate limit it totals to around 7 minutes of waiting for the rate limit to fetch all the members. With both :attr:`Intents.members` and :attr:`Intents.presences` we mostly get the old behaviour so we're only required to request for the 95 guilds that are large, this is slightly less than our rate limit so it's close to the original timing to fetch the member list.
es: Bajo el sistema original esto resultaría en 2 solicitudes para obtener la lista de miembros (75 servidores, 20 servidores) aproximadamente tardando 60 segundos. Con :attr:`Intents.members` pero no :attr:`Intents.presences` esto requiere 840 peticiones, con un límite de tasa de 120 solicitudes por 60 segundos. Significa que debido a la espera del límite nos da un total de unos 7 minutos de espera para que el límite obtenga todos los miembros. Con :attr:`Intents.members` y :attr:`Intents.presences` obtenemos principalmente el comportamiento antiguo, así que solo estamos obligados a solicitar los 95 servidores grandes, esto es un poco menor que nuestro límite de tasa, por lo que está cerca del tiempo original para obtener la lista de miembros.
ru: При первоначальной системе это привело бы к тому, что 2 запроса на получение списка участников (75 гильдий, 20 гильдий) заняли бы примерно 60 секунд. При использовании :attr:`Intents.members`, но не :attr:`Intents.presences` это требует 840 запросов, при ограничении скорости 120 запросов в 60 секунд, что из-за ожидания ограничения скорости составляет около 7 минут ожидания, чтобы получить всех участников. При использовании :attr:`Intents.members` и :attr:`Intents.presences` мы в основном получаем старое поведение, так что нам нужно запросить только 95 гильдий, которые являются большими, это немного меньше, чем наш лимит скорости, так что это близко к оригинальному времени получения списка участников.

source: Unfortunately due to this change being required from Discord there is nothing that the library can do to mitigate this.
es: Lamentablemente, debido a este cambio que se requiere de Discord, no hay nada que la biblioteca pueda hacer para mitigar esto.
ru: К сожалению, из-за того, что это изменение требуется от Discord, библиотека ничего не может сделать, чтобы облегчить эту ситуацию.

source: If you truly dislike the direction Discord is going with their API, you can contact them via `support <https://dis.gd/contact>`_.
es: Si realmente no te gusta la dirección que Discord lleva con su API, puedes contactarlos a través de `soporte <https://dis.gd/contact>`_.
ru: Если вам действительно не нравится направление, в котором Discord движется со своим API, вы можете связаться с ними через `поддержку <https://dis.gd/contact>`_.
