Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/migrating_to_v2.po
Languages: es, pt

source: :attr:`Colour.blurple` is renamed to :attr:`Colour.og_blurple`, and :attr:`Colour.blurple` now returns the newer color.
es: :attr:`Colour.blurple` se renombra a :attr:`Colour.og_blurple`, y :attr:`Colour.blurple` ahora devuelve el color más reciente.
pt: :attr:`Colour.blurple` foi renomeado para :attr:`Colour.og_blurple`, e :attr:`Colour.blurple` agora retorna a cor mais nova.

source: ``missing_perms`` arguments and attributes of :class:`ext.commands.MissingPermissions` and :class:`ext.commands.BotMissingPermissions` are renamed to ``missing_permissions``.
es: Los argumentos y atributos ``missing_perms`` de :class:`ext.commands.MissingPermissions` y :class:`ext.commands.BotMissingPermissions` son renombrados a ``missing_permissions``.
pt: ``missing_perms`` argumentos e atributos de :class:`ext.commands.MissingPermissions` e :class:`ext.commands.BotMissingPermissions` são renomeados para ``missing_permissions``.

source: ``Client.self_bot``
pt: ``Cliente.self_bot``

source: ``User.relationship``, ``mutual_friends``, ``is_friend``, ``is_blocked``, ``block``, ``unblock``, ``remove_friend``, ``send_friend_request``, ``profile``
pt: ``User.relationship``, ``mutual_friends``, ``is_amigo``, ``is_bloqueado``, ``block``, ``unblock``, ``remove_amigo``, ``send_friend_request``, ``profile``

source: ``user.display_avatar.url``
pt: ``user.display_avatar

source: :meth:`Client.fetch_channel`
pt: :meth:`Cliente.fetch_channel`

source: :meth:`Client.get_channel`
pt: :meth:`Cliente.get_channel`

source: :meth:`Reaction.users`
pt: :meth:`Reacção.usuários`
