Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/migrating_to_v2.po
Languages: es, pt

source: Migrating to v2.0
es: Migrando a v2.0
pt: Migrando para v2.0

source: v2.0 introduced new Discord features and deprecated some old ones.
es: v2.0 introdujo nuevas características de Discord y obsoletas algunas antiguas.
pt: a v2.0 introduziu novos recursos do Discord e descontinuou alguns antigos.

source: Part of the redesign involves making application commands and components. These changes include a new :class:`Bot` class, :class:`ui.View`, and a new :class:`ApplicationContext` class. If you're interested in creating them, please check out our :resource:`guide <guide>`.
es: Parte del rediseño involucra hacer comandos y componentes de la aplicación. Estos cambios incluyen una nueva clase :class:`Bot`, :class:`ui. iew`, y una nueva clase :class:`ApplicationContext`. Si estás interesado en crearlos, por favor revisa nuestra :resource:`guide <guide>`.
pt: Parte do redesign envolve a criação de comandos e componentes para o aplicativo. Estas alterações incluem uma nova classe :class:`Bot`, :class:`ui. iew`, e uma nova classe :class:`ApplicationContext`. Se você está interessado em criá-las, por favor, confira nosso `guide :resource: <guide>`.

source: Python Version Change
es: Cambiar versión de Python
pt: Alteração de versão Python

source: In order to make development easier and also to allow for our dependencies to upgrade to allow usage of 3.8 or higher, the library had to remove support for Python versions lower than 3.7, which essentially means that **support for Python 3.7 and below has been dropped**.
es: Con el fin de facilitar el desarrollo y permitir que nuestras dependencias se actualicen para permitir el uso de 3. o superior, la biblioteca tuvo que eliminar el soporte para versiones Python inferiores a 3. , lo que básicamente significa que **el soporte para Python 3.7 y abajo ha sido eliminado**.
pt: Para facilitar o desenvolvimento, e também permitir que as nossas dependências atualizem para permitir o uso de 3. ou superior, a biblioteca teve que remover o suporte para versões Python menores que 3. , o que significa, essencialmente, que o **suporte para Python 3.7 e abaixo foi descartado**.

source: Major Model Changes
es: Cambios del modelo principal
pt: Alterações maiores no modelo

source: Below are major changes that have happened in v2.0:
es: Debajo hay cambios importantes que han ocurrido en v2.0:
pt: Abaixo estão as grandes mudanças que ocorreram na versão 2.0:

source: Dropped User Accounts Support
es: Soporte para cuentas de usuario eliminadas
pt: Suporte a Contas de Usuário Dropados

source: Before v2.0, user accounts were supported. This has been against the spirit of the library and discord ToS and has been removed. Thus, these features that were only applicable to them are removed:
es: Antes de la v2.0, las cuentas de usuario fueron soportadas. Esto ha estado en contra del espíritu de la biblioteca y discord ToS y ha sido eliminado. Así, se eliminan estas características que sólo eran aplicables a ellas:
pt: Antes da v2.0, as contas de usuários eram suportadas. Isso foi contra o espírito da biblioteca e do Discord de TSS e foi removido. Assim, estes recursos que eram aplicáveis apenas a eles são removidos:

source: ``bot`` argument of :meth:`Client.start` and :meth:`Client.run`
es: Argumento ``bot`` de :meth:`Client.start` y :meth:`Client.run`
pt: ``bot`` argumento de :meth:`Client.start` e :meth:`Client.run`

source: ``afk`` argument of :meth:`Client.change_presence`
es: Argumento ``afk`` de :meth:`Client.change_presence`
pt: ``afk`` argumento de :meth:`Client.change_presence`

source: Classes ``Profile``, ``Relationship``, ``Call Message``, ``Group Call``
es: Clases ``Perfil``, ``Relación``, ``Mensaje de llamada``, ``Llamada de grupo``
pt: Classes ``Perfil``, ``Relationship``, ``Call Message``, ``Group Call``

source: ``GroupChannel.add_recipients``, ``remove_recipients``, ``edit`` (NOTE: ``GroupChannel`` itself still remains)
es: ``GroupChannel.add_recipients``, ``remove_recipients``, ``edit`` (NOTA: ``GroupChannel`` en sí mismo todavía permanece)
pt: ``GroupChannel.add_recipients``, ``remove_recipients``, ``edit`` (NOTE: ``GroupChannel`` ainda resta)

source: ``Client.fetch_user_profile``
es: ``Client.fetch_usuario``
pt: ``Cliente.fetch_user_profile``

source: ``Message.call`` and ``ack``
es: ``Message.call`` y ``ack``
pt: ``Message.call`` e ``ack``

source: ``ClientUser.email``, ``premium``, ``premium_type``, ``get_relationship``, ``relationships``, ``friends``, ``blocked``, ``create_group``, ``edit_settings``
es: ``ClientUser.email``, ``premium``, ``premium_type``, ``get_relationship``, ``relaciones``, ``amigos``, ``bloqueado``, ``create_group``, ``edit_settings``

source: Arguments of ``ClientUser.edit``: ``password``, ``new_password``, ``email``, ``house``
es: Argumentos de ``ClientUser.edit``: ``password``, ``new_password``, ``email``, ``house``
pt: Argumentos de ``ClientUser.edit``: ``password``, ``new_password``, ``email``, ``house``

source: Events: ``on_relationship_add`` and ``on_relationship_update``
es: Eventos: ``on_relationship_add`` y ``on_relationship_update``
pt: Eventos: ``on_relationship_add`` e ``on_relationship_update``

source: Timezone-aware Time
es: Hora de zona horaria
pt: Hora do fuso horário

source: ``utcnow`` becomes ``now(datetime.timezone.utc)``. If you are constructing :class:`datetime.datetime`` yourself, pass ``tzinfo=datetime.timezone.utc``.
es: ``utcnow`` se convierte en ``now(datetime.timezone.utc)``. Si estás construyendo :class:`datetime.datetime`` tú mismo, pasa ``tzinfo=datetime.timezone.utc``.
pt: ``utcnow`` se torna ``now(datetime.timezone.utc)``. Se você estiver construindo :class:`datetime.datetime``, passe ``tzinfo=datetime.timezone.utc``.

source: Note that newly-added :meth:`utils.utcnow()` can be used as an alias of ``datetime.datetime.now(datetime.timezone.utc)``.
es: Ten en cuenta que el nuevo :meth:`utils.utcnow()` puede ser usado como un alias de ``datetime.datetime.now(datetime.timezone.utc)``.
pt: Note que adicionado :meth:`utils.utcnow()` pode ser usado como um alias de ``datetime.datetime.now(datetime.timezone.utc)``.

source: Asset Changes
es: Cambios de activos
pt: Mudanças de conteúdo

source: Asset-related attributes that previously returned hash strings (e.g. :attr:`User.avatar`) now returns :class:`Asset`. :attr:`Asset.key` returns the hash from now on.
es: Atributos relacionados con recursos que devuelven previamente cadenas de hash (por ejemplo, :attr:`User.avatar`) ahora devuelve :class:`Asset`. :attr:`Asset.key` devuelve el hash a partir de ahora.

source: ``Class.x_url`` and ``Class.x_url_as`` are removed. :meth:`Asset.replace` or :meth:`Asset.with_x` methods can be used to get specific asset sizes or types.
es: Los métodos ``Class.x_url`` y ``Class.x_url_as`` son eliminados. Los métodos :meth:`Asset.replace` o :meth:`Asset.with_x` pueden ser usados para obtener tamaños o tipos de activos específicos.
pt: ``Class.x_url`` e ``Class.x_url_as`` são removidos. :meth:`Asset.replace` ou :meth:métodos `Asset.with_x` podem ser usados para obter tamanhos ou tipos específicos de ativos.

source: :attr:`Emoji.url` and :attr:`PartialEmoji.url` are now :class:`str`. :meth:`Emoji.save` and :meth:`Emoji.read` are added to save or read emojis.
es: :attr:`Emoji.url` y :attr:`PartialEmoji.url` ahora son :class:`str`. :meth:`Emoji.save` y :meth:`Emoji.read` son añadidos para guardar o leer emojis.
pt: :attr:`Emoji.url` e :attr:`ParalEmoji.url` estão agora :class:`str`. :meth:`Emoji.save` e :meth:`Emoji.read` são adicionados para salvar ou ler emojis.

source: ``Emoji.url_as`` and ``PartialEmoji.url_as`` are removed.
es: ``Emoji.url_as`` y ``PartialEmoji.url_as`` son removidos.
pt: ``Emoji.url_as`` e ``ParalEmoji.url_as`` são removidos.

source: Some :class:`AuditLogDiff` attributes now return :class:`Asset` instead of :class:`str`: :attr:`AuditLogDiff.splash`, :attr:`AuditLogDiff.icon`, :attr:`AuditLogDiff.avatar`
es: Algunos atributos de :class:`mañitLogDiff` ahora devuelven :class:`Asset` en lugar de :class:`str`: :attr:`mañitLogDiff.splash`, :attr:`mañitLogDiff.icon`, :attr:`mañitLogDiff.avatar`
pt: Alguns atributos :class:`AuditLogDiff` agora retornam :class:`Asset` ao invés de :class:`str`: :attr:`AuditLogDiff.splash`, :attr:`AuditLogDiff.icon`, :attr:`AuditLogDiff.avatar`

source: :attr:`User.avatar` returns ``None`` if the avatar is not set and is instead the default avatar; use :attr:`User.display_avatar` for pre-2.0 behavior.
es: :attr:`User.avatar` devuelve ``Ning`` si el avatar no está establecido y en su lugar es el avatar predeterminado; use :attr:`User.display_avatar` para el comportamiento pre-2.0.
pt: :attr:`User.avatar` retorna ``None`` se o avatar não estiver definido e for o avatar padrão; use :attr:`User.display_avatar` para comportamento pré-2.0.

source: Before
es: Antes
pt: Antes

source: After
es: Después
pt: Depois

source: ``str(user.avatar_url_as(size=128))``
es: ``str(user.avatar_url_as(tamaño=128))``

source: ``await user.avatar_url.read()``
es: ``esperar user.avatar_url.read()``

source: ``await user.display_avatar.read()``
es: ``esperar user.display_avatar.read()``

source: ``str(url_as(size=128, static_format="png"))``
es: ``str(url_as(tamaño=128, static_format="png")``

source: Webhook Changes
es: Cambios de Webhook
pt: Alterações de webhook

source: :class:`Webhook` and :class:`WebhookMessage` are now always asynchronous. For synchronous use (``requests``), use :class:`SyncWebhook` and :class:`SyncWebhookMessage`.
es: :class:`Webhook` y :class:`WebhookMessage` son ahora siempre asincrónicas. Para uso sincrónico (``requests``), usa :class:`SyncWebhook` y :class:`SyncWebhookMessage`.
pt: :class:`Webhook` e :class:`WebhookMessage` agora estão sempre assíncronos. Para uso síncrono (``requests``), use :class:`SyncWebhook` e :class:`SyncWebhookMessage`.

source: ``WebhookAdapter``, ``AsyncWebhookAdapter``, and ``RequestsWebhookAdapter`` are removed, since they are unnecessary.
es: ``WebhookAdapter``, ``AsyncWebhookAdapter``, y ``RequestsWebhookAdapter`` son eliminados, ya que son innecesarios.
pt: ``WebhookAdapter``, ``AsyncWebhookAdapter``, e ``RequestsWebhookAdapter`` são removidos, uma vez que são desnecessárias.

source: ``adapter`` arguments of :meth:`Webhook.partial` and :meth:`Webhook.from_url` are removed. Sessions are now passed directly to ``partial`` / ``from_url``.
es: ``adapter`` argumentos de :meth:`Webhook.partial` y :meth:`Webhook.from_url` son removidos. Las sesiones ahora se pasan directamente a ``partial`` / ``from_url``.
pt: ``adapter`` argumentos de :meth:`Webhook.partial` e :meth:`Webhook.from_url` são removidos. As sessões agora são passadas diretamente para ``partial`` / ``from_url``.

source: Intents Changes
es: Cambios de Intentos
pt: Alterações de intensidade

source: :attr:`Intents.message_content` is now a privileged intent. Disabling it causes :attr:`Message.content`, :attr:`Message.embeds`, :attr:`Message.components`, and :attr:`Message.attachments` to be empty (an empty string or an empty array), directly causing :class:`ext.commands.Command` s to not run. See `here <https://support-dev.discord.com/hc/en-us/articles/4404772028055-Message-Content-Privileged-Intent-FAQ>`_ for more information.
es: :attr:`Intents.message_content` es ahora una intención privilegiada. Desactivándolo causa :attr:`Message.content`, :attr:`Message.embeds`, :attr:`Message.components`, y :attr:`Message. Adjuntos` para estar vacío (una cadena vacía o un array vacío), causando directamente :class:`ext. ommands.Command` s para no ejecutar. Ver `aquí <https://support-dev.discord.com/hc/en-us/articles/4404772028055-Message-Content-Privileged-Intent-FAQ>`_ para más información.
pt: :attr:`Intents.message_content` agora é uma intenção privilegiada. Desabilitando isso causa :attr:`Message.content`, :attr:`Message.embeds`, :attr:`Message.components`, e :attr:`Message. ttachments` para estar vazio (uma string vazia ou um array vazio), causando diretamente :class:`ext. ommands.Command` s para não executar. Veja `aqui <https://support-dev.discord.com/hc/en-us/articles/4404772028055-Message-Content-Privileged-Intent-FAQ>`_ para mais informações.

source: Threads Introduced
es: Hilos introducidos
pt: Tópicos introduzidos

source: The following methods and attributes can return :class:`Thread` objects:
es: Los siguientes métodos y atributos pueden devolver objetos :class:`Hilo`:
pt: Os seguintes métodos e atributos podem retornar Objetos :class:`Thread`:

source: :attr:`Message.channel`
es: :attr:`Mensaje.canal`

source: :class:`ext.commands.NSFWChannelRequired`'s ``channel`` argument
es: El argumento :class:`ext.commands.NSFWChannelRequired` de ``channel``
pt: :class:`ext.commands.NSFWChannelRequired`'s ``channel``

source: Permission Changes
es: Cambios de permisos
pt: Alterações de permissão

source: ``permissions_in`` has been removed in favor of checking the permissions of the channel for said user.
es: ``permissions_in`` ha sido eliminado en favor de verificar los permisos del canal para dicho usuario.
pt: ``permissions_in`` foi removido a favor de verificar as permissões do canal para esse usuário.

source: Edit Method Behavior Change
es: Editar cambio de comportamiento del método
pt: Editar Método de Comportamento Alterar

source: ``edit`` methods of most classes no longer update the cache in-place, and instead returns the modified object.
es: Los métodos ``edit`` de la mayoría de las clases ya no actualizan el caché en su lugar, y en su lugar devuelve el objeto modificado.
pt: Os métodos de ``edit`` da maioria das classes não atualizam mais o cache no local e, em vez disso, retornam o objeto modificado.

source: Positional-Keyword Argument Split
es: Dividir argumento palabra clave posicional
pt: Divisão de Argumento Palavra-Chave Posicional

source: The following are now positional only:
es: Los siguientes son sólo posicionales:
pt: Seguintes agora são apenas posicionais:

source: :meth:`PartialMessageable.get_partial_message`
es: :meth:`ParcialMessageable.get_partial_message`
pt: :meth:`ParalMessageable.get_partial_message`

source: The following are now keyword only:
es: Las siguientes son sólo palabra clave:
pt: Agora são apenas a palavra-chave:

source: Event Changes
es: Cambios de Evento
pt: Mudanças de Evento

source: :func:`on_presence_update` replaces `on_member_update` for updates to :attr:`Member.status` and :attr:`Member.activities`.
es: :func:`on_presence_update` reemplaza `on_member_update` por actualizaciones a :attr:`Member.status` y :attr:`Member.activity. ties`.
pt: :func:`on_presence_update` substitui `on_member_update` por atualizações para :attr:`Member.status` e :attr:`Member.activities`.

source: ``on_private_channel_create/delete`` will no longer be dispatched due to Discord changes.
es: ``on_private_channel_create/delete`` ya no será enviado debido a cambios de Discord.
pt: ``on_private_channel_create/delete`` não será mais despachado devido a mudanças no Discord.

source: :func:`on_socket_raw_receive` is no longer dispatched for incomplete data, and the value passed is always decompressed and decoded to :class:`str`. Previously, when received a multi-part zlib-compressed binary message, :func:`on_socket_raw_receive` was dispatched on all messages with the compressed, encoded :class:`bytes`.
es: :func:`on_socket_raw_receive` ya no es enviado por datos incompletos, y el valor pasado siempre es descomprimido y descodificado a :class:`str`. Anteriormente, cuando se recibió un mensaje binario multi-parte comprimido por zlib, :func:`on_socket_raw_receive` fue enviado en todos los mensajes con los `bytes` comprimidos y codificados :class:.
pt: :func:`on_socket_raw_receive` não é mais enviado para dados incompletos, e o valor passado é sempre descompactado e decodificado para :class:`str`. Anteriormente, quando recebeu uma mensagem binária composta por várias partes de zlib, :func:`on_socket_raw_receive` foi enviada em todas as mensagens com o compresso e codificado :class:`bytes`.

source: Message.type For Replies
es: Message.type para respuestas
pt: Message.type para respostas

source: :attr:`Message.type` now returns :attr:`MessageType.reply` for replies, instead of :attr:`MessageType.default`.
es: :attr:`Message.type` ahora devuelve :attr:`MessageType.reply` para respuestas, en lugar de :attr:`MessageType.default`.
pt: :attr:`Message.type` agora retorna :attr:`MessageType.reply` para respostas, em vez de :attr:`MessageType.default`.

source: Sticker Changes
es: Cambios de Sticker
pt: Alterações de Adesivo

source: ``Sticker.preview_image`` was removed as Discord no longer provides the data.
es: ``Sticker.preview_image`` fue eliminado ya que Discord ya no proporciona los datos.
pt: ``Sticker.preview_image`` foi removido pois o Discord não fornece mais os dados.

source: ``StickerType``, an enum of sticker formats, is renamed to :class:`StickerFormatType`. Old name is used for a new enum with different purpose (checking if the sticker is guild sticker or Nitro sticker).
es: ``StickerType``, un enum de formatos de sticker, se renombra a :class:`StickerFormatType`. El nombre antiguo se usa para una nueva enum con diferentes propósitos (comprobando si el sticker es el sticker del gremio o el Nitro).
pt: ``StickerType``, um enum dos formatos de stickers, é renomeado para :class:`StickerFormatType`. Nome antigo é usado para um enum novo com propósito diferente (verificar se o adesivo é de guilda ou adesivo de Nitro).

source: :attr:`Message.stickers` is now List[:class:`StickerItem`] instead of List[:class:`Sticker`]. While :class:`StickerItem` supports some operations of previous ``Sticker``, ``description`` and ``pack_id`` attributes do not exist. :class:`Sticker` can be fetched via :meth:`StickerItem.fetch` method.
es: :attr:`Message.stickers` ahora es List[:class:`StickerItem`] en lugar de List[:class:`Sticker`]. Mientras que :class:`StickerItem` soporta algunas operaciones del anterior ``Sticker``, los atributos ``description`` y ``pack_id`` no existen. :class:`Sticker` se puede obtener mediante el método :meth:`StickerItem.fetch`.
pt: :attr:`Message.stickers` agora é List[:class:`StickerItem`] em vez de List[:class:`Sticker`]. Enquanto :class:`StickerItem` suporta algumas operações de atributos anteriores ``Sticker``, ``description`` e ``pack_id`` não existem. :class:`Sticker` pode ser buscado através do método :meth:`StickerItem.fetch`.

source: ``Sticker.image`` is removed. :class:`Sticker` can still be fetched via :meth:`Sticker.read` or :meth:`Sticker.save` and its URL can be accessed via :attr:`Sticker.url`, just like new :class:`Emoji`.
es: ``Sticker.image`` ha sido eliminado. :class:`Sticker` todavía puede ser obtenido a través de :meth:`Sticker.read` o :meth:`Sticker. ave` y su URL se pueden acceder a través de :attr:`Sticker.url`, al igual que el nuevo :class:`Emoji`.

source: Due to the introduction of :class:`GuildSticker`, ``Sticker.tags`` is removed from the parent class :class:`Sticker` and moved to :attr:`StandardSticker.tags`.
es: Debido a la introducción de :class:`GuildSticker`, ``Sticker.tags`` se elimina de la clase padre :class:`Sticker` y se trasladó a :attr:`StandardSticker.tags`.
pt: Devido à introdução de :class:`GuildSticker`, ``Sticker.tags`` é removido da classe pai :class:`Sticker` e movido para :attr:`StandardSticker.tags`.

source: Type Changes
es: Cambios de tipo
pt: Mudanças de tipo

source: Many method arguments now reject ``None`` or return ``None``.
es: Muchos argumentos de método ahora rechazan ``nunca`` o devuelven ``nunca``.
pt: Muitos argumentos de método agora rejeitam ``None`` ou retornam ``None``.

source: :attr:`DMChannel.recipient` is now optional, and will return ``None`` in many cases.
es: :attr:`DMChannel.recipient` ahora es opcional, y devolverá ``Ningo`` en muchos casos.
pt: :attr:`DMChannel.recipient` agora é opcional, e irá retornar ``None`` em muitos casos.

source: :attr:`User.avatar` returns ``None`` if the avatar is not set and is instead the default avatar.
es: :attr:`User.avatar` devuelve ``Ning`` si el avatar no está establecido y en su lugar es el avatar predeterminado.
pt: :attr:`User.avatar` retorna ``None`` se o avatar não estiver definido e em vez disso é o avatar padrão.

source: :attr:`Guild.create_text_channel`'s ``topic`` argument no longer accepts ``None``.
es: El argumento ``topic`` de :attr:`Guild.create_text_channel` ya no acepta ``Ning``.
pt: :attr:`Guild.create_text_channel`'s ``topic`` não aceita mais o argumento ``None``.

source: :attr:`Guild.vanity_invite` can now return ``None``.
es: :attr:`Guild.vanity_invite` ahora puede devolver ``Ninguno``.
pt: :attr:`Guild.vanity_invite` agora pode retornar ``None``.

source: :attr:`Template.edit`'s ``name`` argument no longer accepts ``None``.
es: El argumento ``name`` de :attr:`Template.edit` ya no acepta ``Ninguno``.
pt: O argumento ``name`` de :attr:`Template.edit` não aceita mais o argumento ``None``.

source: :attr:`Member.edit`'s ``roles`` argument no longer accepts ``None``.
es: El argumento ``roles`` de :attr:`Member.edit ya no acepta ``Ninguno``.
pt: O argumento ``roles`` de :attr:`Member.edit` não aceita mais o argumento ``None``.

source: :attr:`Bot.add_listener` and :attr:`Bot.remove_listener`'s ``name`` arguments no longer accept ``None``.
es: Los argumentos de :attr:`Bot.add_listener` y :attr:`Bot.remove_listener` de ``name`` ya no aceptan ``ninguno``.
pt: :attr:`Bot.add_listener` e :attr:`Bot.remove_listener`'s ``name`` não aceitam mais os argumentos ``None``.

source: The following :class:`.ext.commands.Context` attributes can now be ``None``: ``prefix``, ``command``, ``invoked_with``, ``invoked_subcommand``.
es: Los siguientes atributos :class:`.ext.commands.Context` ahora pueden ser ``Ninguno``: ``prefix``, ``command``, ``invoked_with``, ``invoked_subcommand``.
pt: Os atributos :class:`.ext.commands.Context` podem agora ser ``None``: ``prefix``, ``command``, ``invoked_with``, ``invoked_subcommand``.

source: :attr:`ext.commands.Command.help` can now be ``None``.
es: :attr:`ext.commands.Command.help` ahora puede ser ``Ninguno``.
pt: :attr:`ext.commands.Command.help` agora pode ser ``None``.

source: Miscellaneous Changes
es: Cambios fiscales
pt: Mudanças diversas

source: The following were removed:
es: Se eliminaron las siguientes opciones:
pt: Os seguintes foram removidos:

source: ``guild_subscriptions`` argument of :class:`Client`
es: Argumento de ``guild_subscriptions`` de :class:`Client`
pt: Argumento ``guild_subscriptions`` do :class:`Cliente`

source: ``fetch_offline_members`` argument of :class:`Client`
es: ``fetch_offline_members`` argumento de :class:`Client`
pt: ``fetch_offline_members`` argumento de :class:`Cliente`

source: ``HelpCommand.clean_prefix`` moved to :attr:`ext.commands.Context.clean_prefix`
es: ``HelpCommand.clean_prefix`` movido a :attr:`ext.commands.Context.clean_prefix`
pt: ``HelpCommand.clean_prefix`` foi movido para :attr:`ext.commands.Context.clean_prefix`

source: ``VerificationLevel.table_flip`` (alias of ``high``) was removed. ``extreme``, ``very_high``, and ``double_table_flip`` attributes were removed and replaced with :attr:`VerificationLevel.highest`.
es: ``VerificationLevel.table_flip`` (alias de ``high``) fue eliminado. ``extreme``, ``very_high``, y ``double_table_flip`` atributos fueron removidos y reemplazados con :attr:`VerificationLevel.highest`.
pt: ``VerificationLevel.table_flip`` (alias de ``high``) foi removido. ``extreme``, ``very_high`` e os atributos ``double_table_flip`` foram removidos e substituídos por :attr:`VerificationLevel.highest`.

source: The following were renamed:
es: Se renombraron las siguientes:
pt: Os seguintes foram renomeados:
