Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/quickstart.po
Languages: es, fr, ru

source: Quickstart
es: Inicio rápido
fr: Démarrage rapide
ru: Быстрый старт

source: This page gives a brief introduction to the library. It assumes you have the library installed. If you don't, check the :ref:`installing` portion.
es: Esta página da una breve introducción a la biblioteca. Se asume que tienes la biblioteca instalada. Si no la tienes, revisa :ref:`installing`.
fr: Cette page donne une brève introduction à la bibliothèque. Nous supposons que vous avez déjà installé la bibliothèque. Si cela n'est pas fait, allez voir :ref:`installing`.
ru: Эта страница дает краткое введение в библиотеку. Предполагается, что Вы уже установили библиотеку. Если нет, следуйте :ref:`installing`.

source: A Minimal Bot
es: Un bot mínimo
fr: Un Bot Simple
ru: Минимальный бот

source: Let's make a bot that responds to a specific message and walk you through it.
es: Creemos un bot que responda a un mensaje en específico y guiarte en el proceso.
fr: Nous allons programmer un Bot qui répond à un message en particulier.
ru: Давайте создадим бота, который отвечает на конкретное сообщение и рассмотрим его на примере.

source: It looks something like this:
es: Se ve algo así:
fr: Cela devrait ressembler à ça :
ru: Это выглядит примерно так:

source: Because this example utilizes message content, it requires the :attr:`Intents.message_content` privileged intent.
es: Debido a que este ejemplo usa el contenido del mensaje, necesitamos la intención privilegiada :attr:`Intents.message_content`.
fr: Puisque cet exemple utilise le contenu des messages, nous avons besoin de l'Intent privé :attr:`Intents.message_content`.
ru: Поскольку в этом примере используется содержимое сообщения, для него требуется привилегированное Intent :attr:`Intents.message_content`.

source: Let's name this file ``example_bot.py``. Make sure not to name it ``discord.py`` as that'll conflict with the library.
es: Nombremos a este archivo ``example_bot.py``. Asegúrate de no nombrarlo ``discord.py``, ya que puede causar conflictos con la biblioteca.
fr: Nommons ce fichier ``example_bot.py``. Assurez-vous de ne pas le nommer ``discord.py``, cela rentrera en conflit avec le nom de la bibliothèque.
ru: Давайте назовем этот файл ``example_bot.py``. Убедитесь, что Вы не назвали его ``discord.py``, так как это будет конфликтовать с библиотекой.

source: There's a lot going on here, so let's walk you through it step by step:
es: Muchas cosas están sucediendo aquí, vamos paso a paso:
fr: Il y a beaucoup de choses à voir et à comprendre ici, allons-y pas à pas :
ru: Здесь много тем для обсуждения, поэтому давайте разберемся с этим шаг за шагом:

source: The first line just imports the library, if this raises a `ModuleNotFoundError` or `ImportError` then head on over to :ref:`installing` section to properly install.
es: La primera línea importa la biblioteca, si esto genera un `ModuleNotFoundError` o `ImportError`, entonces ve a la sección de :ref:`installing` para instalar correctamente la biblioteca.
fr: La première ligne importe juste la bibliothèque. Si les erreurs `ModuleNotFoundError` ou `ImportError` apparaissent alors retournez à la section :ref:`installing` et assurez-vous d'avoir correctement installé la bibliothèque.
ru: Первая строка просто импортирует библиотеку, если в этом случае возникает `ModuleNotFoundError` или `ImportError`, тогда перейдите в :ref:`installing` для правильной установки.

source: Next, we create an instance of a :class:`Client`. This client is our connection to Discord.
es: A continuación, creamos una instancia de :class:`Client`. Este cliente es nuestra conexión a Discord.
fr: Ensuite, nous créons une instance de :class:`Client` . Ce client est notre connexion à Discord.
ru: Далее мы создаем экземпляр :class:`Client`. Этот клиент является нашим соединением с Discord.

source: We then use the :meth:`Client.event` decorator to register an event. This library has many events. Since this library is asynchronous, we do things in a "callback" style manner.
es: Luego usamos el decorador :meth:`Client.event` para registrar un evento. La biblioteca cuenta con muchos eventos. Puesto que la biblioteca es asíncrona, hacemos las cosas en un estilo de "retrollamada".
fr: Après cela, nous utilisons le décorateur :meth:`Client.event` pour enregistrer un événement. Il y a de nombreux événements disponibles dans cette bibliothèque. Comme la bibliothèque est asynchrone, nous programmons avec des "fonctions de rappel".
ru: Затем мы используем декоратор :meth:`Client.event` для регистрации события. Эта библиотека имеет много событий. Поскольку эта библиотека асинхронна, мы делаем вещи в стиле "обратного вызова".

source: A callback is essentially a function that is called when something happens. In our case, the :func:`on_ready` event is called when the bot has finished logging in and setting things up and the :func:`on_message` event is called when the bot has received a message.
es: Una retrollamada es esencialmente una función que es llamada cuando algo pasa. En nuestro caso, el evento :func:`on_ready` es llamado cuando nuestro bot ha terminado de iniciar sesión y configurarse, y el evento :func:`on_message` es llamado cuando nuestro bot recibe un mensaje.
fr: Une fonction de rappel est appelée quand un événement se produit. Dans notre cas, l'événement :func:`on_ready` est appelé quand le bot a fini de se connecter et de se paramétrer, donc quand il est prêt à fonctionner. Tandis que l'événement :func:`on_message` est appelé quand le bot a reçu un message.
ru: Обратный вызов - это, функция, которая вызывается, когда что-то происходит. В нашем случае событие :func:`on_ready` вызывается, когда бот завершает авторизацию и настройку, а событие :func:`on_message` вызывается, когда бот получает сообщение.

source: Since the :func:`on_message` event triggers for *every* message received, we have to make sure that we ignore messages from ourselves. We do this by checking if the :attr:`Message.author` is the same as the :attr:`Client.user`.
es: Puesto que nuestro evento :func:`on_message` es llamado por *cada* mensaje recibido, tenemos que asegurarnos de ignorar nuestros mismos mensajes. Hacemos esto comprobando si el :attr:`Message.author` es el mismo que :attr:`Client.user`.
fr: Sachant que l'événement :func:`on_message` est actionné pour *tous* les messages reçus, nous devons nous assurer d'ignorer nos propres messages. On fait cela en vérifiant que le :attr:`Message.author` et le :attr:`Client.user` ne sont pas les mêmes.
ru: Поскольку :func:`on_message` событие вызывается для *каждого* полученного сообщения, мы должны убедиться что мы игнорируем сообщения от нас же самих. Для этого мы проверяем, совпадает ли :attr:`Message.author` с :attr:`Client.user`.

source: Afterwards, we check if the :class:`Message.content` starts with ``'$hello'``. If it does, then we send a message in the channel it was used in with ``'Hello!'``. This is a basic way of handling commands, which can be later automated with the :doc:`./ext/commands/index` framework.
es: Después, comprobamos si :class:`Message.content` empieza con ``'$hello'``. Si lo hace, entonces enviamos un mensaje al canal donde fue usado con ``'Hello!'``. Esto es una forma básica de manejar comandos, que luego puede ser automatizado con el framework :doc:`./ext/commands/index`.
fr: Après cela, nous vérifions si le :class:`Message.content` commence par ``'$hello'``. Si c'est le cas, nous envoyons le message ```'Hello!'`` dans le même salon que le message reçu. C'est une façon basique de gérer les commandes textuelles, que nous pourrons automatiser plus tard avec le module complémentaire :doc:`./ext/commands/index`.
ru: После этого мы проверяем начинается ли :class:`Message.content` с ``'$hello'``. Если это так, то мы отправим сообщение в канале, в котором было отправлено сообщение ``'Hello!'``. Это простой способ обработки команд, который впоследствии может быть автоматизирован с помощью фреймворка :doc:`./ext/commands/index`.

source: Finally, we run the bot with our login token. If you need help getting your token or creating a bot, look in the :ref:`discord-intro` section.
es: Finalmente, ejecutamos nuestro bot con nuestro token de inicio de sesión. Si necesitas ayuda para obtener tu token o para crear un bot, mira la sección :ref:`discord-intro`.
fr: Enfin, nous démarrons le bot avec notre jeton d'authentification (token en anglais). Si tu as besoin d'aide pour trouver ton jeton d'authentification ou tout simplement pour créer un bot, redirige-toi vers la section :ref:`discord-intro`.
ru: Наконец, мы запускаем бота с нашим токеном авторизации. Если Вам нужна помощь в получении токена авторизации или создании бота, посмотрите :ref:`discord-intro`.

source: Now that we've made a bot, we have to *run* the bot. Luckily, this is simple since this is just a Python script, we can run it directly.
es: Ahora que hemos creado un bot, tenemos que *ejecutar* el bot. Por suerte, esto es simple, ya que este es solo un script de Python, podemos ejecutarlo directamente.
fr: Maintenant que notre bot est créé, nous n'avons plus qu'à le *démarrer*. Par chance, ce n'est qu'un simple programme Python, nous pouvons l'exécuter directement.
ru: Теперь, когда мы создали бота, мы должны *запустить* бота. К счастью, это просто, так как это всего лишь скрипт на Python, мы можем запустить его напрямую.

source: On Windows:
es: En Windows:
fr: Sur Windows :
ru: На Windows:

source: On other systems:
es: En otros sistemas:
fr: Sur d'autres systèmes :
ru: На других системах:

source: Now you can try playing around with your basic bot.
es: Ahora puedes intentar jugar con tu bot básico.
fr: Maintenant, vous pouvez essayer de vous amuser avec votre bot.
ru: Теперь Вы можете поэкспериментировать с простым ботом.

source: A Minimal Bot with Slash Commands
es: Un bot mínimo con comandos de barra
fr: Un Bot Simple avec des commandes Slash
ru: Минимальный бот с слэш-командами

source: As a continuation, let's create a bot that registers a simple slash command!
es: Como una continuación, vamos a crear un bot que registre un simple comando de barra.
fr: Pour aller plus loin, faisons un bot qui enregistre des commandes slashs !
ru: В качестве продолжения, давайте создадим бота, который регистрирует простую слэш-команду!

source: Let's look at the differences compared to the previous example, step-by-step:
es: Veamos las diferencias en comparación con el ejemplo anterior, paso a paso:
fr: Commençons par comparer, pas-à-pas, les différences avec l'exemple précédent :
ru: Давайте посмотрим на различия по сравнению с предыдущим примером, шаг за шагом:

source: The first line remains unchanged.
es: La primera línea no ha cambiado.
fr: La première ligne reste inchangée.
ru: Первая строка остается неизменной.

source: Next, we create an instance of :class:`.Bot`. This is different from :class:`.Client`, as it supports slash command creation and other features, while inheriting all the features of :class:`.Client`.
es: A continuación, creamos una instancia de :class:`.Bot`. Esto es diferente de :class:`.Client`, ya que soporta la creación de comandos de barra y otras características, al tiempo que hereda todas las características de :class:`.Client`.
fr: Ensuite, nous créons une instance de :class:`Bot`. Il diffère de :class:`Client`, puisqu'il supporte la création de commandes slashs ainsi que plein d'autres fonctionnalités tout en héritant des fonctionnalités de :class:`Client`.
ru: Далее мы создаем экземпляр :class:`.Bot`. Это отличается от :class:`.Client`, так как поддерживает создание слэш-команд и другие возможности, наследуя все возможности :class:`.Client`.

source: We then use the :meth:`.Bot.slash_command` decorator to register a new slash command. The ``guild_ids`` attribute contains a list of guilds where this command will be active. If you omit it, the command will be globally available, and may take up to an hour to register.
es: Luego usamos el decorador :meth:`.Bot.slash_command` para registrar un nuevo comando de barra. El atributo ``guild_ids`` contiene una lista de servidores donde este comando será activo. Si se omite, el comando estará disponible globalmente, y puede tardar hasta una hora en registrarse.
fr: Puis, nous utilisons le décorateur :meth:`Bot.slash_command` pour enregistrer une nouvelle commande slash. L'attribut ``guilds_ids`` contient une liste de serveur discord où la commande sera fonctionnelle. Si vous ne le mettez pas, les commandes seront globalement actives (fonctionnelles sur tous les serveurs), et elles pourront prendre jusqu'à une heure à s'enregistrer.
ru: Затем мы используем :meth:`.Bot.slash_command` декоратор для регистрации новой слэш-команды. Атрибут ``guild_ids`` содержит список гильдий, в которых эта команда будет активна. Если вы его не укажите, команда будет доступна глобально и может занять до часа для регистрации.

source: Afterwards, we trigger a response to the slash command in the form of a text reply. Please note that all slash commands must have some form of response, otherwise they will fail.
es: Después, activamos una respuesta al comando de barra en forma de texto. Por favor, ten en cuenta que todos los comandos de barra deben tener alguna forma de respuesta, de lo contrario fallarán.
fr: Après cela, nous répondons à la commande slash sous la forme d'un message textuel. Notez que toutes les commandes slashs doivent avoir une forme de réponse, sinon elles échoueront.
ru: После этого мы отвечаем на слэш-команду в текстовом виде. Пожалуйста, обратите внимание, что все слэш-команды должны иметь хоть какой-то ответ, в противном случае они не сработают.

source: Finally, we, once again, run the bot with our login token.
es: Por último, una vez más, ejecutamos el bot con nuestro token de inicio de sesión.
fr: Enfin, nous, encore une fois, démarrons le bot avec le jeton d'authentification.
ru: Наконец, мы снова запустим бота с токеном авторизации.

source: Congratulations! Now you have created your first slash command!
es: ¡Enhorabuena! ¡Ahora has creado tu primer comando de barra!
fr: Félicitations ! Vous venez de créer votre première commande slash !
ru: Поздравляем! Вы создали свою первую слэш-команду!
