Repository: Pycord-Development/pycord
Catalog: docs/locales/*/LC_MESSAGES/version_guarantees.po
Languages: de, es, fr, it, ja, pt, ru, zh, zh_cn

source: Version Guarantees
de: Versionsgarantien
es: Versión garantizada
fr: Garanties de version
it: Versione Garanzie
ja: バージョン保証
pt: Garantia de versão
ru: Гарантии версии
zh: 版本保证
zh_cn: 版本保证

source: The library follows the `semantic versioning principle <https://semver.org/>`_ which means that the major version is updated every time there is an incompatible API change. However due to the lack of guarantees on the Discord side when it comes to breaking changes along with the fairly dynamic nature of Python it can be hard to discern what can be considered a breaking change and what isn't.
de: Die Bibliothek folgt dem `semantischen Versionierungsgrundsatz <https://semver.org/>`_ was bedeutet, dass die Hauptversion jedes Mal aktualisiert wird, wenn eine inkompatible API-Änderung vorliegt. Aufgrund der fehlenden Garantien auf der Discord-Seite, wenn es darum geht, Änderungen mit der ziemlich dynamischen Natur von Python zu durchbrechen, kann es jedoch schwierig sein zu erkennen, was als eine bahnbrechende Veränderung angesehen werden kann und was nicht.
es: La biblioteca sigue el `principio de versionado semántico <https://semver.org/>`_ que significa que la versión principal se actualiza cada vez que hay un cambio de API incompatible. Sin embargo, debido a la falta de garantías por parte de Discord cuando se trata de romper cambios junto con la naturaleza bastante dinámica de Python puede ser difícil discernir lo que se puede considerar un cambio de ruptura y lo que no.
fr: La bibliothèque suit le `principe de versionnage sémantique <https://semver.org/>`_ ce qui signifie que la version majeure est mise à jour chaque fois qu'il y a un changement d'API incompatible. Cependant, en raison du manque de garanties du côté Discord lorsqu'il s'agit de briser les changements ainsi que la nature assez dynamique de Python, il peut être difficile de discerner ce qui peut être considéré comme un changement cassé et ce qui ne l'est pas.
it: La libreria segue il principio di versionamento semantico <https://semver.org/>`_ che significa che la versione principale viene aggiornata ogni volta che c'è una modifica API incompatibile. Tuttavia, a causa della mancanza di garanzie sul lato Discord quando si tratta di rompere i cambiamenti insieme alla natura abbastanza dinamica di Python può essere difficile discernere quello che può essere considerato un cambiamento di rottura e ciò che non è.
ja: ライブラリは `semantic versioning principal <https://semver.org/>`_ に従います。これは互換性のないAPI変更が発生するたびにメジャーバージョンが更新されることを意味します。 しかし、Discord側の保証がないため、Pythonのかなりダイナミックな性質とともに変更を破ることになると、何が壊れた変化とみなされるか、何がそうでないのかを判断するのは難しいことです。
pt: A biblioteca segue o 'princípio de versionamento semântico <https://semver.org/>`_ o que significa que a versão principal é atualizada toda vez que há uma mudança incompatível na API. No entanto, devido à falta de garantias do lado do Discord, quando se trata de quebrar mudanças juntamente com a natureza bastante dinâmica do Python, pode ser difícil discernir o que pode ser considerado uma mudança e o que não é.
ru: Данная библиотека следует принципу `Семантического Версионирования <https://semver.org/>`. Это означает, что основная версия обновляется каждый раз, когда происходит несовместимое изменение API. Однако из-за отсутвия гарантий на стороне Дискорда, когда речь идёт о больших изменений наряду с довольно-таки динамической натурой Python, иногда трудно разлечить, что является большим обновлением, а что нет.
zh: 书库遵循`语义版本化原则 <https://semver.org/>`_ ，这意味着每次有不兼容的 API 更改时，主要版本都会更新。 然而，由于Discord方面缺乏保障，加上Python相当活跃的性质，很难看出什么可以被视为是一种突破性的变化，什么是什么是没有的。
zh_cn: 这个函式库遵循`语义化版本原则 <https://semver.org/>`_，大版本号只会在有**大型更动**或不相容的 API 更动时才会改变。然而，由于我们无法确保 Discord 什么时候会大幅改动他们的 API，以及考量到 Python 社群的活跃，我们对于什么是**大型更动**还没有一个统一的标准。

source: The first thing to keep in mind is that breaking changes only apply to **publicly documented functions and classes**. If it's not listed in the documentation here then it is not part of the public API and is thus bound to change. This includes attributes that start with an underscore or functions without an underscore that are not documented.
de: Das erste, was man im Auge behalten sollte, ist, dass das Abbrechen von Änderungen nur für **öffentlich dokumentierte Funktionen und Klassen zutreffen**. Wenn sie hier nicht in der Dokumentation aufgelistet ist, dann ist sie nicht Teil der öffentlichen API und wird sich daher zwangsläufig ändern. Dies beinhaltet Attribute, die mit einem Unterstrich oder Funktionen ohne Unterstrich beginnen, die nicht dokumentiert sind.
es: Lo primero que hay que tener en cuenta es que los cambios de ruptura sólo se aplican a **funciones y clases públicas**. Si no está listado en la documentación aquí, entonces no es parte de la API pública y por lo tanto está obligada a cambiar. Esto incluye atributos que comienzan con un guión bajo o funciones sin un guión bajo que no están documentados.
fr: La première chose à garder à l'esprit est que les changements cassés ne s'appliquent qu'aux **fonctions et classes publiquement documentées**. Si elle n'est pas listée dans la documentation ici, alors elle ne fait pas partie de l'API publique et est donc tenue de changer. Cela inclut les attributs qui commencent par un trait de soulignement ou des fonctions sans trait de soulignement qui ne sont pas documentés.
it: La prima cosa da tenere a mente è che i cambiamenti di rottura si applicano solo a **funzioni e classi pubblicamente documentate**. Se non è elencato nella documentazione qui allora non fa parte dell'API pubblica e quindi è tenuto a cambiare. Questo include gli attributi che iniziano con un underscore o funzioni senza un underscore che non sono documentati.
ja: 最初に注意すべきことは、壊れた変更は**公開されている関数とクラス**にのみ適用されることです。 ここでドキュメントに記載されていない場合は、それはパブリック API の一部ではなく、変更されることになります。 これには、文書化されていないアンダースコアまたはアンダースコアがない関数で始まる属性が含まれます。
pt: A primeira coisa a ter em mente é que a quebra de alterações só se aplica a **funções e classes publicamente documentadas**. Se ele não está listado na documentação aqui, então ele não faz parte da API pública e portanto está vinculado a mudar. Isto inclui atributos que começam com um sublinhado ou funções sem um sublinhado que não estão documentados.
ru: Первое, что нужно иметь в виду, это что большие обновления применяются только к **публично задокументированным функциям и классам**. Если в документации не пишут о той или иной функции, то он не является частью публично задокументированного API, и, поэтому может измениться в любой момент. Под это попадают аттрибуты, что начинаються с _, и также функции, что не начинаються с _, но не задокументированны.
zh: 首先要牢记的是，破裂的更改只适用于**公开记载的函数和类**。 如果它没有列在文档中，那么它不是公共API的一部分，因此必然会改变。 这包括以下划线开头的属性或没有文件记录的下划线的函数。
zh_cn: **大型更动**只适用于**文档上标註的函式与类别**。对于没有在文档上标注的内容（如以 `_` 命名的变数或函式）的改动，并不能算是一种**大型更动**，

source: The examples below are non-exhaustive.
de: Die folgenden Beispiele erheben keinen Anspruch auf Vollständigkeit.
es: Los ejemplos a continuación no son exhaustivos.
fr: Les exemples ci-dessous ne sont pas exhaustifs.
it: Gli esempi riportati di seguito non sono esaustivi.
ja: 以下の例は網羅的ではありません。
pt: Os exemplos abaixo não são exaustivos.
ru: Приведенные ниже примеры не исчерпывающие.
zh: 以下例子并非详尽无遗。
zh_cn: 以下的例子并不准确。

source: Examples of Breaking Changes
de: Beispiele für bahnbrechende Änderungen
es: Ejemplos de Interrupción de Cambios
fr: Exemples de ruptures de changements
it: Esempi di cambiamenti di rottura
ja: 破損変更の例
pt: Exemplos de mudanças de ruptura
ru: Пример больших изменений
zh: 打破更改的例子
zh_cn: 大型改动的范例

source: Changing the default parameter value to something else.
de: Ändern des Standardparameterwerts in einen anderen Wert.
es: Cambiando el valor por defecto del parámetro a otra cosa.
fr: Changement de la valeur par défaut du paramètre à autre chose.
it: Cambiare il valore del parametro predefinito in qualcos'altro.
ja: デフォルトのパラメータ値を別のものに変更します。
pt: Alterando o valor do parâmetro padrão para outra coisa.
ru: Изменение значения параметров по умолчанию на что-нибудь другое.
zh: 更改默认参数值为其他值。
zh_cn: 改变参数的预设值

source: Renaming a function without an alias to an old function.
de: Umbenennen einer Funktion ohne Alias ​​in eine alte Funktion.
es: Renombrar una función sin alias a una función antigua.
fr: Renommer une fonction sans alias vers une ancienne fonction.
it: Rinomina una funzione senza un alias a una vecchia funzione.
ja: 古い関数へのエイリアスなしで関数の名前を変更します。
pt: Renomeando uma função sem um alias para uma função antiga.
ru: Переименование функции без alias, на старое название.
zh: 将一个没有别名的函数重命名为旧函数。
zh_cn: 改变函式的名称，且不设置指向旧函数的别名

source: Adding or removing parameters to an event.
de: Hinzufügen oder Entfernen von Parametern zu einem Ereignis.
es: Agregando o eliminando parámetros a un evento.
fr: Ajout ou suppression de paramètres à un événement.
it: Aggiungere o rimuovere parametri a un evento.
ja: イベントにパラメータを追加または削除します。
pt: Adicionar ou remover parâmetros para um evento.
ru: Добавлен и или удаление параметров event-а.
zh: 添加或删除参数到一个事件。
zh_cn: 改变一种事件的参数

source: Examples of Non-Breaking Changes
de: Beispiele für nicht bahnbrechende Änderungen
es: Ejemplos de cambios sin interrupción
fr: Exemples de changements sans interruption
it: Esempi di cambiamenti non rotti
ja: 非破壊的変更の例
pt: Exemplos de alterações não quebradas
ru: Пример изменений, что ничего не ломают
zh: 不打破更改的例子
zh_cn: 非大型改动的范例

source: Adding or removing private underscored attributes.
de: Hinzufügen oder Entfernen privater unterstrichener Attribute.
es: Agregando o eliminando atributos subrayados privados.
fr: Ajout ou suppression d'attributs soulignements privés.
it: Aggiunta o rimozione di attributi sottolineati privati.
ja: アンダースコアの非公開属性の追加または削除。
pt: Adicionar ou remover atributos sublinhados privados.
ru: Добавление или удаление приватных атрибутов.
zh: 添加或删除私有强调属性。
zh_cn: 改变以 `_` 命名的属性

source: Adding an element into the ``__slots__`` of a data class.
de: Hinzufügen eines Elements zu den „__slots__“ einer Datenklasse.
es: Añadiendo un elemento en el ``__slots__`` de una clase de datos.
fr: Ajout d'un élément dans la classe de données ``__slots__`` d'une classe de données.
it: Aggiungere un elemento nel ``__slots__`` di una classe di dati.
ja: データクラスの「__slots__」に要素を追加します。
pt: Adicionando um elemento ao ``__slots__`` de uma classe de dados.
ru: Добавление элемента в ``__slots__`` класса данных.
zh_cn: 将新的元素加入 data class 的 ``__slots__``

source: Changing the behaviour of a function to fix a bug.
de: Hinzufügen eines Elements zu den „__slots__“ einer Datenklasse.
es: Cambiando el comportamiento de una función para corregir un error.
fr: Modification du comportement d'une fonction pour corriger un bogue.
it: Cambiare il comportamento di una funzione per correggere un bug.
ja: バグを修正する関数の動作を変更します。
pt: Alterando o comportamento de uma função para corrigir um erro.
ru: Изменение поведения функции для исправления ошибки.
zh: 更改函数的行为以修复漏洞。
zh_cn: 改变函式的行为来解决一些 Bug

source: Changes in the documentation.
de: Änderungen in der Dokumentation.
es: Cambios en la documentación.
fr: Changements dans la documentation.
it: Modifiche nella documentazione.
ja: ドキュメントの変更
pt: Alterações na documentação.
ru: Изменение документации.
zh: 5. 文件的更改。
zh_cn: 改变文档

source: Modifying the internal HTTP handling.
de: Ändern der internen HTTP-Verarbeitung.
es: Modificando el manejo HTTP interno.
fr: Modification de la gestion interne HTTP.
it: Modifica della gestione HTTP interna.
ja: 内部 HTTP 処理を変更します。
pt: Modificando a manipulação interna de HTTP.
ru: Модификация внутренней обработки HTTP.
zh: 修改内部HTTP处理程序。
zh_cn: 改变内部 HTTP 处理程序

source: Upgrading the dependencies to a new version, major or otherwise.
de: Aktualisieren der Abhängigkeiten auf eine neue Version, ob Hauptversion oder nicht.
es: Actualizando las dependencias a una nueva versión, mayor o no.
fr: Mettre à jour les dépendances vers une nouvelle version, majeure ou autre.
it: Aggiornare le dipendenze a una nuova versione, maggiore o meno.
ja: 依存関係を新しいバージョン、メジャーまたはそうでないにアップグレードします。
pt: Atualizando as dependências para uma nova versão, principal ou diferente.
ru: Обновление зависимостей до новой версии, основной или иной.
zh: 升级依赖关系到一个新版本，主要或其他版本。
zh_cn: 将依赖项升级到新版本，无论是主要版还是其他版本。
